{"slug":"fedex","carrier_id":"FedEx","carrier_title":"FedEx","uk_english":false,"description":[{"type":"paragraph","content":{"text":"FedEx, also known as FedEx Express, is an American company providing domestic and international delivery services. The name \"FedEx\" is a shortened version of \"Federal Express,\" the now unused name of the company's original air division founded by Fred Smith in 1971. ","spans":[{"start":236,"end":257,"type":"hyperlink","data":{"url":"https://www.thebalancesmb.com/federal-express-fedex-2221098"}}]}},{"type":"paragraph","content":{"text":"Today, FedEx is commonly known for its delivery services. Still, the company also \"has the world's largest airline in terms of freight tons flown,\" according to an article by Martin Murray. The FedEx headquarters is in Memphis, Tennessee. ","spans":[{"start":175,"end":188,"type":"hyperlink","data":{"url":"https://www.thebalancesmb.com/federal-express-fedex-2221098"}}]}},{"type":"paragraph","content":{"text":"FedEx began to form its identity as a delivery company in the 1980s. During this time, many people were looking for postal services that made fast deliveries and delivered overnight. FedEx has been competing with other American companies, such as UPS and Purolator, and has established itself as a household name throughout the years. ","spans":[]}},{"type":"paragraph","content":{"text":"FedEx uses their freight capacity to deliver packages worldwide, and FedEx can deliver to over 220 countries and territories. All you need to do is consult their international shipping services page to figure out the delivery speed you require. You can send just about anything with FedEx, and FedEx shipping lets you send packages and letters weighing up to 150 pounds, which should be enough for you to ship most items. ","spans":[{"start":95,"end":124,"type":"hyperlink","data":{"url":"https://www.fedex.com/en-ca/shipping-services/international/at-a-glance.html"}}]}},{"type":"paragraph","content":{"text":"If you’re sending or waiting for a package with FedEx and you want to know exactly where it is,try Circuit Package Tracker for free.","spans":[{"start":0,"end":48,"type":"em"},{"start":54,"end":132,"type":"em"},{"start":95,"end":131,"type":"strong"},{"start":95,"end":131,"type":"hyperlink","data":{"url":"https://getcircuit.com/package-tracker"}}]}},{"type":"heading2","content":{"text":"Frequently Asked Questions","spans":[]}},{"type":"heading3","content":{"text":"Can I track a FedEx package without a tracking number?","spans":[]}},{"type":"paragraph","content":{"text":"It is possible to track your FedEx package without the tracking number, but first, you should make sure you haven't misplaced it in your email history or you haven't received it yet because your package hasn't shipped. You can also call FedEx customer support with your reference number and ask if they can give you the tracking number again. ","spans":[]}},{"type":"paragraph","content":{"text":"It's better to have the tracking number so you can use Circuit Package Tracker for up-to-date and convenient tracking info. Worst case scenario, you can track your shipment with a reference number. However, this may be unreliable if your package has to travel internationally. ","spans":[]}},{"type":"paragraph","content":{"text":"You also have to enter in more information if you choose to track with the reference number, which can be a hassle. ","spans":[{"start":26,"end":42,"type":"hyperlink","data":{"url":"https://www.fedex.com/en-us/tracking.html"}}]}},{"type":"heading3","content":{"text":"Does Circuit offer better tracking than FedEx?","spans":[]}},{"type":"paragraph","content":{"text":"Circuit provides better tracking info than the package tracker FedEx offers. There are usually multiple people involved in the delivery process, and updates are more accurate on Circuit, especially with international tracking with FedEx. ","spans":[]}},{"type":"paragraph","content":{"text":"Tracking software such as Circuit keeps you up to speed on all updates and makes tracking FedEx packages easier. FedEx package tracker can often be unreliable for international deliveries with multiple carriers and steps involved. FedEx tracking can also fail to provide up-to-date information about delays. ","spans":[]}},{"type":"heading3","content":{"text":"How late does FedEx deliver?","spans":[]}},{"type":"paragraph","content":{"text":"Using your FedEx tracking number and Circuit Package Tracker, you should be able to see when your package is out for delivery. FedEx deliveries take place between 8 am and 8 pm, and they also deliver on Saturdays. If your notification says your package will arrive at the \"end of the day,\" this means it will arrive by 8 pm. ","spans":[{"start":163,"end":176,"type":"hyperlink","data":{"url":"https://www.fedex.com/en-us/tracking/guide-for-tracking-managing-deliveries.html"}}]}},{"type":"heading3","content":{"text":"How long does it usually take to deliver an international package with FedEx?","spans":[]}},{"type":"paragraph","content":{"text":"FedEx International Priority is the most popular FedEx solution, according to their website. If you choose this option, delivery will take 1 to 3 business days. If you select FedEx International Economy, you can expect your package to arrive within 2 to 5 business days. FedEx International Next Flight is a good option if you need to send an emergency package, and it will arrive within 24 hours. ","spans":[{"start":0,"end":28,"type":"hyperlink","data":{"url":"http://www.fedex.com/ms/services/intlpriority.html"}},{"start":175,"end":202,"type":"hyperlink","data":{"url":"https://www.fedex.com/en-ca/shipping-services/international/economy.html"}},{"start":271,"end":302,"type":"hyperlink","data":{"url":"https://www.fedex.com/en-ca/shipping-services/international/urgent-delivery.html"}}]}},{"type":"heading3","content":{"text":"How long will FedEx hold a package?","spans":[]}},{"type":"paragraph","content":{"text":"According to their website, your chosen FedEx location will hold your package for up to 7 days. You should retrieve your package as soon as possible or assign someone to pick up your package if you cannot. ","spans":[{"start":82,"end":94,"type":"hyperlink","data":{"url":"https://www.fedex.com/en-us/faq/delivery-manager.html#:~:text=How%20long%20will%20a%20location,for%20up%20to%207%20days."}}]}},{"type":"heading3","content":{"text":"How to sign for a FedEx package","spans":[]}},{"type":"paragraph","content":{"text":"You can choose to require a signature for your package to be delivered. If no one can provide one during delivery, FedEx will attempt to deliver the package again, or you can go to a FedEx location to sign for it. Three FedEx delivery scenarios involve providing a signature:","spans":[{"start":214,"end":244,"type":"hyperlink","data":{"url":"https://www.fedex.com/en-us/delivery-options/signature-services.html"}}]}},{"type":"list-item","content":{"text":"Direct signature required: This means that to deliver your package, either you or someone living in your residence needs to sign for the package.","spans":[]}},{"type":"list-item","content":{"text":"Indirect signature required: If no one at your residence is home, a neighbor, building manager, or concierge can sign for your package if you are unavailable. ","spans":[]}},{"type":"list-item","content":{"text":"Adult signature required: Someone living at your residence of legal age can sign for the package. They will need to present a government-issued ID. ","spans":[]}},{"type":"heading3","content":{"text":"How to track a FedEx package with Circuit","spans":[]}},{"type":"paragraph","content":{"text":"You can keep tabs on the entire FedEx shipping process using Circuit Package Tracker. All you have to do is enter your FedEx tracking number from your confirmation email and select \"FedEx\" as your courier. Circuit provides up-to-date information about when your package was shipped, the status of your package, if there has been a delay, and the estimated arrival time. ","spans":[]}},{"type":"heading3","content":{"text":"What do I do if I haven't received my package from FedEx?","spans":[]}},{"type":"paragraph","content":{"text":"If your package is delayed, you should follow these steps: ","spans":[]}},{"type":"o-list-item","content":{"text":"Check Circuit Package Tracker to see if there has been a delay and where the package currently is. ","spans":[]}},{"type":"o-list-item","content":{"text":"Next, you should contact FedEx customer service and tell them all of the relevant information you have. ","spans":[]}},{"type":"o-list-item","content":{"text":"If your package is lost during the shipment process, you can file a claim for a lost package. ","spans":[]}},{"type":"heading3","content":{"text":"What happens if FedEx loses my package?","spans":[]}},{"type":"paragraph","content":{"text":"First, you should try calling FedEx customer service and asking them if they can track down your package. You can also check Circuit Package Tracker or FedEx tracker for information on delays. If neither works, you can file a claim for a lost package with FedEx tracker. ","spans":[{"start":211,"end":231,"type":"hyperlink","data":{"url":"https://www.businessinsider.com/fedex-missing-package"}}]}},{"type":"paragraph","content":{"text":"After following the steps for filing a claim, you will be reimbursed by FedEx, or they will be able to find the package. You will need your FedEx tracking number to file a claim as well as your FedEx account. You can file a lost package claim for the following shipments: ","spans":[]}},{"type":"list-item","content":{"text":"US domestic shipments","spans":[]}},{"type":"list-item","content":{"text":"The US to an international location shipments","spans":[]}},{"type":"list-item","content":{"text":"Shipments from Canada to the US","spans":[]}},{"type":"heading3","content":{"text":"What happens if I miss my FedEx delivery?","spans":[]}},{"type":"paragraph","content":{"text":"Don't worry. If you miss your delivery, you can pick your package up at an assigned FedEx location. However, using Circuit Package Tracker will help you avoid missing your delivery. You will see when the package is out for delivery, and you can plan your day around it.","spans":[]}},{"type":"heading3","content":{"text":"What time will my FedEx package arrive?","spans":[]}},{"type":"paragraph","content":{"text":"To find out if your package will arrive, you should check Circuit Package Tracker with your FedEx tracking number. If Circuit says that your package is out for delivery, you should stay home if you want to enjoy it that day. It will arrive no later than 8 pm. ","spans":[]}},{"type":"heading3","content":{"text":"Where is my FedEx package?","spans":[]}},{"type":"paragraph","content":{"text":"You should use Circuit Package Tracker to figure out where your package is on any given day. It provides real-time updates such as when your package has shipped when it's crossed the border, when it's arrived at the destination country, and much more. You will also be able to see when it is out for delivery. ","spans":[]}},{"type":"heading3","content":{"text":"Where is my FedEx tracking number?","spans":[]}},{"type":"paragraph","content":{"text":"When your package has shipped, you will get an email with your FedEx tracking number. With this, you can see where your shipment is with the package tracker from FedEx, or preferably with Circuit Package Tracker. ","spans":[]}},{"type":"paragraph","content":{"text":"If you are sending a package, the tracking number is a 12-digit number found on your shipment label. It's a good idea to tell the person you're sending a package to what the tracking number is. ","spans":[{"start":55,"end":70,"type":"hyperlink","data":{"url":"http://pages.message.fedex.com/barcodescan_home/#:~:text=Your%20FedEx%20Ground%20shipper%20number,21%E2%80%9334%20of%20the%20barcode."}}]}},{"type":"heading3","content":{"text":"Why is my FedEx package not moving?","spans":[]}},{"type":"paragraph","content":{"text":"Delays can occur for several reasons, and Circuit Package Tracker will display as much information about the delay as possible. If the delay isn't resolved within a couple of days, you should call FedEx customer service. Delays can occur because of bad weather, heavy package volume, motor vehicle trouble, unclear delivery instructions, and more. ","spans":[{"start":342,"end":346,"type":"hyperlink","data":{"url":"https://shiptrackapp.com/blog/10-common-causes-of-delayed-deliveries/"}}]}},{"type":"heading3","content":{"text":"Why is my FedEx package pending?","spans":[]}},{"type":"paragraph","content":{"text":"Don't panic if your package says it is \"pending,\" it simply means it will ship within ten days! It's meant to give you time to print labels before shipment occurs. ","spans":[{"start":86,"end":94,"type":"hyperlink","data":{"url":"https://www.fedex.com/en-us/quick-help/fsm/sm_pending.html#:~:text=A%20Pending%20Shipment%20is%20a,selected%20when%20creating%20the%20shipment."}}]}},{"type":"paragraph","content":{"text":"If you’re sending or waiting for a package with FedEx and you want to know exactly where it is, try Circuit Package Tracker for free.","spans":[{"start":0,"end":48,"type":"em"},{"start":54,"end":133,"type":"em"},{"start":96,"end":132,"type":"strong"},{"start":96,"end":132,"type":"hyperlink","data":{"url":"https://getcircuit.com/package-tracker"}}]}},{"type":"paragraph","content":{"text":"","spans":[]}}],"type":"package_tracker_carriers","tags":[],"lang":"en-us","grouplang":"YNCfghEAABEKGK0w"}