{"slug":"aramex","carrier_id":"Aramex","carrier_title":"Aramex","uk_english":false,"description":[{"type":"paragraph","content":{"text":"Aramex was founded in 1982 and was the first Arab-based company to be listed on the NASDAQ stock exchange. Aramex has 5 locations in the United States with offices in New York and California. They offer shipping and logistics to businesses in e-commerce and small businesses. Aramex is committed to transparency and clarity with its customer base. Aramex is also a member of the Global Distribution Alliance. The GDA brings together over 40 leading express and logistics providers from around the globe. Aramex offers international and domestic express delivery, freight forwarding, logistics and warehousing, document management and online shopping services. ","spans":[]}},{"type":"paragraph","content":{"text":"Aramex delivers anything that is not hazardous or prohibited to ship to any destination. Please be aware that some countries have additional restrictions, prohibitions, and acceptance laws for certain commodities. Visit their FAQ page for more information about prohibited items, including a downloadable list of prohibited items that are not able to ship to International Express and their other shipping services. ","spans":[{"start":226,"end":229,"type":"hyperlink","data":{"url":"http://aramex.com/us/en/support/frequently-asked-questions"}}]}},{"type":"paragraph","content":{"text":"Aramex delivers to more than 240 countries. Aramex has over 300 offices in 58 countries and they work with the GDA to manage the quick shipping of your packages. You can also drop off your package at any FedEx location to send packages with Amarex in the US. Send packages to the UK, Germany, Australia, France Canada, Italy, and South Africa to name a few of the more international places that Aramex delivers to. As long as Amarex has an office the package can be shipped to that location anywhere in the world.","spans":[{"start":204,"end":209,"type":"hyperlink","data":{"url":"http://fedex.com"}}]}},{"type":"paragraph","content":{"text":"If you’re sending or waiting for a package with Aramex and you want to know exactly where it is, try Circuit Package Tracker for free.","spans":[{"start":0,"end":134,"type":"em"},{"start":97,"end":133,"type":"strong"},{"start":97,"end":133,"type":"hyperlink","data":{"url":"https://getcircuit.com/package-tracker"}}]}},{"type":"heading2","content":{"text":"Frequently asked questions","spans":[]}},{"type":"heading3","content":{"text":"Can I track an Aramex package without a tracking number?","spans":[]}},{"type":"paragraph","content":{"text":"Aramex offers tracking with a tracking number or a unique reference number provided by the shipper. Unfortunately, if you lose the tracking number or reference number you cannot track your order through Aramex or circuit package tracker. If this happens, contact the shipper for the correct tracking number or unique reference number and make sure to keep it in a secure location.","spans":[]}},{"type":"heading3","content":{"text":"Does Circuit package tracker offer better tracking than Amarex?","spans":[]}},{"type":"paragraph","content":{"text":"Aramex offers tracking on their site that helps you track your shipments from Aramex.","spans":[]}},{"type":"paragraph","content":{"text":"Circuit package tracker offers better tracking than Aramex because you are not limited to which shipping company you use and search all available shipments on one page. Circuit package tracker is a one-stop-shop for all your deliveries regardless of who the shipper used to deliver your packages. So, instead of juggling different websites for multiple deliveries, you can just use the Circuit package tracker to streamline your process.\t","spans":[]}},{"type":"heading3","content":{"text":"How late does Aramex deliver?","spans":[]}},{"type":"paragraph","content":{"text":"The time that Aramex delivers your package depends on which kind of shipping service was used and what the country of destination is. It can be as little as 24 hours to 4-10 days depending on where the package is collected and shipped to. Use the circuit package tracker to keep track of your Aramex deliveries with your tracking number.","spans":[]}},{"type":"heading3","content":{"text":"How long does it usually take to deliver an international package with Amarex?","spans":[]}},{"type":"paragraph","content":{"text":"The amount of time it takes for Aramex to deliver your packages depends on its country of origin and the shipping methods used. It can take anywhere from 4-10 days to receive your package from Aramex. Make sure to keep track of your package with the circuit package tracker. It’s simple, just enter your tracking number, press enters and you should have the location of your package in seconds.","spans":[]}},{"type":"heading3","content":{"text":"How long will Amarex hold a package?","spans":[]}},{"type":"paragraph","content":{"text":"Amarex can hold a packet for 48 hours in one of their convenient drop boxes once you have been notified about the arrival of your package. If the package is sent to an Aramex location you have 5 business days to collect your shipment before it is sent back to the shipper. Keep track of your package all along the way with the circuit package tracker with zero to no hassle so that you can be ready to receive your delivery when it’s available. Or if you see that your package is being delivered at an inconvenient time you can log into the Aramex website and update the shipping location or change shipping times.","spans":[]}},{"type":"heading3","content":{"text":"How to sign for an Amarex package?","spans":[]}},{"type":"paragraph","content":{"text":"There are several options from which to sign from your package. You can use the QR code that Aramex sends you if you are having a package stored at one of their boxes or you can also have the package left at your door if no signature is needed. If a signature is needed and you are not home, the package will be sent to an Aramex location and you will have to show proof of identity for pickup.","spans":[]}},{"type":"heading3","content":{"text":"How to track an Amarex package with Circuit package tracker?","spans":[]}},{"type":"paragraph","content":{"text":"To track an Amarex package using Circuit package tracker just enter the tracking number in the field provided and you will have a response within seconds. If you receive an error message or have other issues with tracking your Aramex package contact them at Amarex.com. Aramex has its own shipment tracking system that can help you further if the circuit package tracker fails.","spans":[]}},{"type":"heading3","content":{"text":"What do I do if I haven’t received my package from Amarex?","spans":[]}},{"type":"paragraph","content":{"text":"First, make sure you track your package using the circuit package tracker to get any information that is available about your package. Then, contact Aramex and check with their tracking system to make sure it has shipped and has been scanned in at least one location. If, you still cannot find the package contact the shipper to make sure everything went smoothly at the pickup of your package.","spans":[]}},{"type":"heading3","content":{"text":"What happens if Amarex loses my package? ","spans":[]}},{"type":"paragraph","content":{"text":"If Aramex loses your package and you purchased their Shield Service protection you have to file a claim and you will only be compensated for the declared value of the shipment as long as the claim is valid. Shield Service is only available to purchase when the package has not yet been given to Aramex and before loss or damage occurs. Please keep in mind that Shield Service is not available for shipments without an invoice because they are not able to determine the value of the shipment without it. The cost of Shield Service is determined by the value of the goods being shipped.","spans":[]}},{"type":"heading3","content":{"text":"What happens if I miss my Amarex delivery?","spans":[]}},{"type":"paragraph","content":{"text":"If you miss an Aramex delivery just go to their website and follow their instructions to reschedule delivery or go to their office location map here to find an Aramex location near you.","spans":[{"start":144,"end":148,"type":"hyperlink","data":{"url":"http://aramex.com/us/en/support/find-office"}}]}},{"type":"heading3","content":{"text":"What time will my Amarex package arrive?","spans":[]}},{"type":"paragraph","content":{"text":"The time that takes for your Amarex package to arrive depends on the shipping method used and where in the world the package is going to be delivered to. Aramex offers door to door package shipment depending on which option you choose for delivery in certain parts of the world. Aramex also operates domestic drop boxes in some locations where the package is delivered by 10:30 am the next day. ","spans":[]}},{"type":"heading3","content":{"text":"Where is my Aramex package?","spans":[]}},{"type":"paragraph","content":{"text":"Aramex delivery depends on which country the package was shipped from and the mode of shipping used through Aramex. To track the location of your Amarex package simply find your tracking number or reference number and input the information on the Aramex tracking page or you can enter the tracking number into the circuit package tracker and have an answer in seconds.","spans":[{"start":254,"end":262,"type":"hyperlink","data":{"url":"http://aramex.com/us/en/track/shipments"}}]}},{"type":"heading3","content":{"text":"Where is your Aramex tracking number?","spans":[]}},{"type":"paragraph","content":{"text":"You should have received a tracking number from the retailer that you purchased your items. If you shipped the package the tracking number should be on the receipt or email from Aramex. Aramex can also use a specific reference number provided by the shipper to track your package. Contact your shipper to clarify which number you should use to track on the Aramex website. If you find the tracking number and would like an easy way to track your package use Circuit package tracker for all your tracking needs.","spans":[]}},{"type":"heading3","content":{"text":"Why Is my Aramex package not moving?","spans":[]}},{"type":"paragraph","content":{"text":"Your Aramex package could show that its not moving for a variety of reasons. Your package can be between scans from one location to another. It could be inspected at customs or your package is lost. Contact Aramex for more information about why your shipment is not moving or any questions you may have about your packages.","spans":[{"start":199,"end":206,"type":"hyperlink","data":{"url":"http://aramex.com"}}]}},{"type":"heading3","content":{"text":"Why is my Aramex package pending?","spans":[]}},{"type":"paragraph","content":{"text":"Your Aramex package could be pending for a variety of reasons. It could be pending because of a problem with payment, an invalid address, a problem in customs, or the package could just be waiting to be scanned and updated by Aramex. Contact your shipper to make sure the shipment was made and no problems occurred during packaging or shipping.","spans":[]}},{"type":"paragraph","content":{"text":"If you’re sending or waiting for a package with Aramex and you want to know exactly where it is, try Circuit Package Tracker for free.","spans":[{"start":0,"end":134,"type":"em"},{"start":97,"end":133,"type":"strong"},{"start":97,"end":133,"type":"hyperlink","data":{"url":"https://getcircuit.com/package-tracker"}}]}}],"type":"package_tracker_carriers","tags":[],"lang":"en-us","grouplang":"YNDk6BEAABEKGeVU"}