{"slug":"royal-mail","carrier_id":"RoyalMail","carrier_title":"Royal Mail","uk_english":false,"description":[{"type":"paragraph","content":{"text":"Trouble tracking your Royal Mail package? Find your solution in the top frequently asked questions about Royal Mail.","spans":[]}},{"type":"paragraph","content":{"text":"Royal Mail is the original post service established in 1516 as part of the English government under King Henry VIII for delivering postage across the kingdom. Since then, Royal Mail has grown into a multinational post company delivering to over 230 countries across the globe, delivering everything from letters to supplies to personal packages.","spans":[]}},{"type":"heading2","content":{"text":"Frequently Asked Questions","spans":[]}},{"type":"heading3","content":{"text":"Can I Track a Royal Mail Package Without a Tracking Number?","spans":[]}},{"type":"paragraph","content":{"text":"Unfortunately, it is not possible to track your Royal Mail package without a tracking number. Fortunately, the merchant or online retailer will have your tracking number, contact the merchant for your tracking number. If you purchased from an online storefront or online merchant, check your email. Merchants and online storefronts will often send the tracking number in your confirmation email. In some cases, merchants and online storefronts send the confirmation message containing the tracking number as an SMS.","spans":[]}},{"type":"heading3","content":{"text":"Does Circuit Offer Better Tracking Than Royal Mail?","spans":[]}},{"type":"paragraph","content":{"text":"Within just a few seconds, you can track your Royal Mail package anywhere in the world at any time from start to finish with Circuit. This works even after Royal Mail has handed off your package to your local courier to be delivered directly to you. This is especially easy with the Circuit Package Tracker app available in your app store on your mobile device. With just a click of a button, you can track your packages from anywhere in the world at any time. By being able to track your package across the globe, you can have peace of mind that your package is safe and on its way to you.","spans":[]}},{"type":"heading3","content":{"text":"How Late Does Royal Mail Deliver?","spans":[]}},{"type":"paragraph","content":{"text":"Royal Mail workers start their delivery day at 7 AM local time and end it at 3 PM. However, in rural areas, they will deliver as late as 4 PM. Typically packages arrive before 2 PM, but your package is guaranteed to arrive before 1 PM if you paid the fee for the express or special delivery option for your package. However, for international packages, Royal Mail only takes responsibility for getting your package to its destination country. Once your package makes it through customs, it is up to your local postal organization to deliver the package to you personally.","spans":[]}},{"type":"heading3","content":{"text":"How Long Does It Usually Take to Deliver an International Package with Royal Mail?","spans":[]}},{"type":"paragraph","content":{"text":"To Europe, packages with Royal Mail may take 3 to 5 business days to arrive. For other international packages, it may take 5 to 7 business days for your package to arrive. However, Royal Mail only takes responsibility for your package reaching its destination country. Once your package is through customs, your local postal organization takes over. By entering your tracking number into the Circuit Package Tracker, you can track your package even once it switches couriers.","spans":[]}},{"type":"heading3","content":{"text":"How Long Will Royal Mail Hold a Package?","spans":[]}},{"type":"paragraph","content":{"text":"Royal Mail will hold domestic packages for 18 days before returning the package to the sender. For international packages, they will hold the package for 15 days before returning the package to the sender. However, this only applies to packages they receive in Britain, as once your package reaches its destination country, they pass it off to a local courier. You will receive an email confirmation or SMS confirmation once your package passes off to your local courier and you can contact them for more information on how long they hold packages.","spans":[]}},{"type":"heading3","content":{"text":"How Do I Sign for a Royal Mail Package?","spans":[]}},{"type":"paragraph","content":{"text":"Royal Mail offers a Royal Mail Signed For service for an extra fee, meaning your package can only be released from the courier with a signature. Signatures are also sometimes required for packages containing high value items, sensitive information, or carry extra insurance against loss or theft. If your package requires a signature, the courier at your door will inform you and ask that you sign electronically on a device. If you are not home and your package requires a signature, Royal Post will leave you a note informing you.","spans":[]}},{"type":"heading3","content":{"text":"How Do I Track a Royal Mail Package with Circuit?","spans":[]}},{"type":"paragraph","content":{"text":"To track your Royal Mail package with Circuit, enter your Royal Mail tracking number into the Circuit Package Tracker. Circuit will then find the location of your package, even if you have not entered the courier’s name. This process is made even easier using the Circuit Package Tracker app available in your app store on your mobile phone. With the Circuit app, you can track your package all across the globe at any time.","spans":[{"start":94,"end":118,"type":"hyperlink","data":{"url":"https://getcircuit.com/package-tracker"}}]}},{"type":"heading3","content":{"text":"What Do I Do If I Have Not Received My Package from Royal Mail?","spans":[]}},{"type":"paragraph","content":{"text":"If you have not received your package within a few days of the expected delivery date, use your tracking number to track where your package was last with Circuit. If your package was last outside of your destination country, contact the Royal Mail customer service for further instructions, as it was still under their jurisdiction. However, if your package was last in your destination country, check to see what courier the package was transferred to for further instructions. Also, check to see if there have been shipping delays that may have affected your package’s arrival date.","spans":[{"start":237,"end":264,"type":"hyperlink","data":{"url":"https://personal.help.royalmail.com/app/contact"}}]}},{"type":"heading3","content":{"text":"What Happens if Royal Mail Loses My Package?","spans":[]}},{"type":"paragraph","content":{"text":"If Royal Mail loses or damages your package, you can contact them either by telephone or by using their customer service concerns or complaints form to report damage or loss. You have 80 calendar days to report your package as lost or damaged before Royal Mail is no longer legally liable for the package. For packages with proof of value, you will receive a postage refund, the value of the package’s contents, and 20 British Pounds. For packages with their Royal Mail Signed For service, you will receive 50 British Pounds instead of 20 British Pounds. It is always good to wait a few days after the expected arrival date or check your package’s location on Circuit Package Tracker before filing a complaint.","spans":[{"start":133,"end":148,"type":"hyperlink","data":{"url":"https://personal.help.royalmail.com/app/contact"}},{"start":660,"end":683,"type":"hyperlink","data":{"url":"https://getcircuit.com/package-tracker"}}]}},{"type":"paragraph","content":{"text":"If your package has reached its destination country and had already been passed off to your local courier before it was lost, the liability falls to your local courier. Contact your local courier for more information on how to report lost or damaged packages.","spans":[]}},{"type":"heading3","content":{"text":"What Happens if I Miss My Royal Mail Package Delivery?","spans":[]}},{"type":"paragraph","content":{"text":"If you miss your Royal Mail package delivery, they will leave it on your doorstep. In the case of more valuable items or items requiring a signature upon delivery, Royal Mail will leave you a card on your door informing you that they missed you attempting to deliver your package. If you wish to pick up your package from the nearest Royal Mail post office, you must wait at least 24 hours before picking it up at the post office. You must bring proof of identity to pick up your package.","spans":[]}},{"type":"heading3","content":{"text":"What Time Will My Royal Mail Package Arrive?","spans":[]}},{"type":"paragraph","content":{"text":"Domestically, in Britain, Royal Mail deliveries begin at 7 AM and run until 3 PM, meaning your package could arrive any time after 7 AM but before 3 PM. For rural delivery addresses, Royal Mail delivers an extra hour, until 4 PM. However, if you chose the express delivery option, your Royal Mail package is guaranteed to arrive before 1 PM. Internationally, Royal Mail delivers to your local carrier, so check with them for local delivery times.","spans":[]}},{"type":"heading3","content":{"text":"Where Is My Royal Mail Package?","spans":[]}},{"type":"paragraph","content":{"text":"By entering your tracking information into the Circuit Package Tracker, you can track the location of your Royal Mail package within seconds. If your package appears as pending, it means the package has yet to be sent by the merchant or online retailer. After the package has been sent, you can track your package day by day using the Circuit Package Tracker. There may be times that your package appears to not be moving since some couriers only use milestones when shipping internationally.","spans":[{"start":47,"end":70,"type":"hyperlink","data":{"url":"https://getcircuit.com/package-tracker"}}]}},{"type":"heading3","content":{"text":"Where Is My Royal Mail Tracking Number?","spans":[]}},{"type":"paragraph","content":{"text":"Your Royal Mail tracking number typically appears in an email confirmation of your order sent by the merchant or online storefront when ordering. Sometimes, merchants or online retailers will send an SMS to your mobile phone containing the tracking number instead. If you cannot find your tracking number in either an email or an SMS, contact the merchant or online retailer you ordered from for more information.","spans":[]}},{"type":"heading3","content":{"text":"Why Is My Royal Mail Package Not Moving?","spans":[]}},{"type":"paragraph","content":{"text":"Most shipments only have milestone tracking, meaning your shipment may be moving across an ocean or country towards you, but not appear to be moving at all. For international shipments, it may take longer for the package to reach its destination depending on the service chosen, such as Royal Mail’s express service, and country of origin. Shipments can also be delayed by operational backlogs, weather events, or customs.","spans":[]}},{"type":"heading3","content":{"text":"Why Is My Royal Mail Package Pending?","spans":[]}},{"type":"paragraph","content":{"text":"When your package appears as pending in the Circuit Package Tracker, it just means your merchant or online retailer has not shipped your package yet. If your package has not been sent within a reasonable amount of time, contact the merchant or online storefront for more information. If you ordered on a national holiday in the country of origin, on a weekend, or during a large sale event thrown by the retailer, keep in mind there may be delays in shipping your package.","spans":[]}},{"type":"paragraph","content":{"text":"If you’re sending or waiting for a package with the Royal Mail and you want to know exactly where it is, try Circuit Package Tracker for free.","spans":[{"start":0,"end":142,"type":"em"},{"start":105,"end":141,"type":"strong"},{"start":105,"end":141,"type":"hyperlink","data":{"url":"https://getcircuit.com/package-tracker"}}]}}],"type":"package_tracker_carriers","tags":[],"lang":"en-us","grouplang":"YNDk7hEAACMAGeWG"}