{"slug":"yodel","carrier_id":"Yodel","carrier_title":"Yodel","uk_english":false,"description":[{"type":"paragraph","content":{"text":"Yodel is a leading package courier that mainly operates out of the United Kingdom. Through their service, they are able to ship a range of items across mainland U.K. While Yodel does not directly ship packages abroad, they have partnered with other great collection services such as DPD and DHL to ensure that Yodel shipments can now be sent to up to 180 countries.  ","spans":[]}},{"type":"heading2","content":{"text":"Frequently Asked Questions","spans":[{"start":0,"end":26,"type":"strong"}]}},{"type":"heading3","content":{"text":"Can I track a Yodel package without a tracking number?","spans":[{"start":0,"end":54,"type":"strong"}]}},{"type":"paragraph","content":{"text":"To track any parcel that Yodel is delivering, you will need your tracking number, so be sure to have this ready. Additionally, to confirm that you are tracking the correct parcel, Yodel will also request the delivery postcode for your item. If you do did not receive a tracking number, you must contact Yodel immediately. ","spans":[]}},{"type":"heading3","content":{"text":"Does Circuit offer better tracking than Yodel?","spans":[{"start":0,"end":46,"type":"strong"}]}},{"type":"paragraph","content":{"text":"Parcel tracking can always be difficult sometimes, and the information that you are presented with can be confusing. At Circuit, we believe that you should never have to hassle over where your parcel is at any time. So, unlike the Yodel tracking service, we do not require a postcode to track your package. ","spans":[]}},{"type":"paragraph","content":{"text":"By simply using your tracking number, we can reduce any worries of not knowing where your parcel is. Once you have received your tracking number from Yodel, simply use our Circuit Package Tracker and push the “Track My Parcel” button. This will allow you to see the exact status of your parcel at any given time, right from the pre-transit stage to when you have it in your hands. ","spans":[]}},{"type":"heading3","content":{"text":"How late does Yodel deliver?","spans":[{"start":0,"end":28,"type":"strong"}]}},{"type":"paragraph","content":{"text":"In mainland United Kingdom, you can expect Yodel to keep delivering parcels up till 9PM. However, this does not include Sundays, as Yodel does not usually make deliveries on this day.  ","spans":[]}},{"type":"heading3","content":{"text":"How long does it usually take to deliver an international package with Yodel?","spans":[{"start":0,"end":77,"type":"strong"}]}},{"type":"paragraph","content":{"text":"With Yodel, you can send parcels abroad. Naturally, this will take longer than sending packages within the United Kingdom. If you are shipping a parcel within the European Union, then you should expect Yodel to deliver your item within three to five days. However, if you are sending a package to the rest of the world i.e., North America, Asia, Africa, etc., then it may take six to ten days before they are delivered. To know what part of the world your parcel currently is in, you can use the Circuit Package Tracker. ","spans":[{"start":163,"end":177,"type":"hyperlink","data":{"url":"https://www.yodel.co.uk/yodel-services/international"}}]}},{"type":"heading3","content":{"text":"How long will Yodel hold a package?","spans":[{"start":0,"end":35,"type":"strong"}]}},{"type":"paragraph","content":{"text":"Yodel operates a Collect+ service whereby parcels are delivered to certain stores for pickup. If you choose this service, then you must pick up your item as soon as possible. The reason for this is that Yodel will only hold packages for up to ten calendar days. If you do not pick up your parcel during this time, then Yodel will ship your item back to the sender.","spans":[{"start":17,"end":25,"type":"hyperlink","data":{"url":"https://www.collectplus.yodel.co.uk/about-us"}}]}},{"type":"paragraph","content":{"text":"While Yodel will not hold parcels longer than ten days, they will provide two additional reminders to your phone. So, even if you have missed the first notification, you should still expect some more prompts so do not be bothered. However, depending on these notifications can be a risk and it is still possible that you miss it. Be sure to still use our Package Tracker to make sure that Yodel does not ship back your parcel.  ","spans":[]}},{"type":"heading3","content":{"text":"How to sign for a Yodel package?","spans":[{"start":0,"end":32,"type":"strong"}]}},{"type":"paragraph","content":{"text":"This will depend on the delivery option that you have chosen. Some Yodel parcels do not require any delivery, so their drivers will attempt to leave them in a safe space. However, if your item has been shipped with proof of delivery as signature, then your parcel will have to be signed for. ","spans":[]}},{"type":"paragraph","content":{"text":"If you are in when your Yodel driver arrives, then you will have to sign for the parcel directly. This will act as evidence that the parcel has been delivered in good condition. However, if you are not home when Yodel tries to deliver your parcel, they may also leave it with a neighbor, who will have to sign for it themselves.  ","spans":[]}},{"type":"paragraph","content":{"text":"In some cases, Yodel will not be able to deliver your parcel to you or your neighbor. This can cause a panic if you were expecting an important parcel that never came. In these instances, a calling card should have been left in your post box by Yodel. This should allow you to call them for redelivery. Even if you do not place a call, they will still attempt to redeliver your item the next day.","spans":[]}},{"type":"heading3","content":{"text":"How to track a Yodel package with Circuit?","spans":[{"start":0,"end":42,"type":"strong"}]}},{"type":"paragraph","content":{"text":"To track a Yodel parcel with our Circuit Package Tracker simply push the “Track My Package” button. This will allow you to see exactly where your parcel is at any time. This should help reduce the well-known anxiety of waiting for a parcel to arrive or the fear of it being lost. ","spans":[]}},{"type":"paragraph","content":{"text":"While you may receive some updates from Yodel, our Package Tracker puts you first. This will allow you to follow your parcel straight from pre-transit to delivery by always showing you where your package is at any time no matter where in the world. This will also include what depot or facility your item is, as well as the exact time that your parcel arrives. ","spans":[]}},{"type":"heading3","content":{"text":"What do I do if I haven't received my package from Yodel?","spans":[{"start":0,"end":57,"type":"strong"}]}},{"type":"paragraph","content":{"text":"It can be a highly frustrating experience when you expect a package to arrive, but it fails to do so. It can even be worse if you plan your day around signing for it personally, but it never comes. If you have not received your parcel, then our first suggestion is that you use our Circuit Package Tracker. As some parcels can be late, our service will allow you to always check the status of your parcel. ","spans":[]}},{"type":"paragraph","content":{"text":"If you find that you track your parcel and it has a delivered status, then your delivery driver could have dropped your parcel off elsewhere. It may be that your neighbor has signed for your item or that it has been left in a safe location for you. In either case, Yodel will have left a card telling you where you can find your parcel. If you cannot find this card, then you must contact Yodel immediately. ","spans":[]}},{"type":"heading3","content":{"text":"What happens if Yodel loses my package?","spans":[{"start":0,"end":39,"type":"strong"}]}},{"type":"paragraph","content":{"text":"Unfortunately, packages get lost all the time by delivery services. If you have been expecting your parcel for a substantial period, but Yodel has not yet delivered it, then it could have been misplaced through the delivery process. If you find yourself in this situation, then you must contact Yodel as soon as possible. ","spans":[]}},{"type":"paragraph","content":{"text":"Yodel also gives you the ability to file a claim for lost parcels. This includes a £50 cover for all parcels, though you can pay an additional fee for increased cover up to £300. However, Yodel states that they will not provide insurance for third-party shippers, so you will have to discuss with such retailers directly.  ","spans":[]}},{"type":"heading3","content":{"text":"What happens if I miss my Yodel delivery?","spans":[{"start":0,"end":41,"type":"strong"}]}},{"type":"paragraph","content":{"text":"Missing deliveries is more common than you might think, so if you are in this boat, you must stay calm. As some Yodel deliveries require you to sign personally, your driver will be unable to safely leave your item or give it to a neighbor. This means that you must arrange redelivery if you have missed your item. ","spans":[{"start":0,"end":18,"type":"hyperlink","data":{"url":"https://www.yodel.co.uk/help-centre/missed-delivery"}}]}},{"type":"paragraph","content":{"text":"Fortunately, Yodel makes this process simple by providing calling cards if your driver is unable to reach you. Simply follow the information on these cards to rearrange your delivery. If you cannot find this calling card, then you should contact Yodel directly.  ","spans":[]}},{"type":"heading3","content":{"text":"What time will my Yodel package arrive?","spans":[{"start":0,"end":39,"type":"strong"}]}},{"type":"paragraph","content":{"text":"While Yodel does not provide an exact time that your parcel will be delivered, the primary delivery times for Yodel packages are between 7 AM and 9 PM. If you would like to know when your item is out for delivery or has reached its final sorting station, then you can use our Circuit Package Tracker. Our service allows you to journey with your package from pre-transit to delivery, making sure you are always aware of the status of your parcel.  ","spans":[]}},{"type":"paragraph","content":{"text":"","spans":[]}},{"type":"heading3","content":{"text":"Where is my Yodel package?","spans":[{"start":0,"end":26,"type":"strong"}]}},{"type":"paragraph","content":{"text":"To find out where your Yodel parcel currently is, you can make use of the Circuit Package Tracker. Our service provides you the status of your parcel from pre-transit to delivery. This includes the location of your item and the current carrier.  ","spans":[{"start":155,"end":178,"type":"hyperlink","data":{"url":"https://en.wikipedia.org/wiki/Package_delivery"}}]}},{"type":"heading3","content":{"text":"Where is my Yodel’s tracking number?","spans":[{"start":0,"end":36,"type":"strong"}]}},{"type":"paragraph","content":{"text":"When your package has been shipped through Yodel, you should have received an email from Yodel. So, quickly look through your inbox for your tracking number. Alternatively, if your item is being shipped through a retailer, then they have received the tracking number instead. So, you must contact them instead.  ","spans":[]}},{"type":"paragraph","content":{"text":"If you cannot find your tracking number, you must contact Yodel immediately, as you will not be able to trace your package without this. ","spans":[]}},{"type":"heading3","content":{"text":"Why is my Yodel package not moving?","spans":[{"start":0,"end":35,"type":"strong"}]}},{"type":"paragraph","content":{"text":"Delays can be frustrating when receiving parcels but sometimes they occur. If you find that you have been tracking your parcel for several days without any change, then there are likely complications with your delivery. In this case, you must contact Yodel immediately.  ","spans":[]}},{"type":"heading3","content":{"text":"Why is my Yodel package pending?","spans":[{"start":0,"end":32,"type":"strong"}]}},{"type":"paragraph","content":{"text":"If your parcel is pending, then it may be that it is still in the pre-delivery stage. However, if you continue to track your parcel and it has this status for several days, then you must contact Yodel to find out if you need to provide any additional information about your package.","spans":[{"start":114,"end":131,"type":"hyperlink","data":{"url":"https://en.wikipedia.org/wiki/Package_tracking"}}]}},{"type":"paragraph","content":{"text":"If you’re sending or waiting for a package with Yodel and you want to know exactly where it is, try Circuit Package Tracker for free.","spans":[{"start":0,"end":133,"type":"em"},{"start":96,"end":132,"type":"strong"},{"start":96,"end":132,"type":"hyperlink","data":{"url":"https://getcircuit.com/package-tracker"}}]}}],"type":"package_tracker_carriers","tags":[],"lang":"en-us","grouplang":"YNDk6xEAACMAGeVv"}