{"slug":"laser-ship","carrier_id":"LaserShip","carrier_title":"LaserShip","uk_english":false,"description":[{"type":"paragraph","content":{"text":"In 1986, LaserShip was founded as a document shipping company, before expanding in 1999 to partner with Barnes and Noble to same day deliver books in New York City. Over the years, LaserShip has slowly expanded its reach and customer base from just document delivery to everything from organs for transplants to commercial to personal packages. LaserShip also has expanded to delivering a wide variety of goods throughout the Eastern and Midwestern United States and select international destinations.","spans":[{"start":9,"end":18,"type":"hyperlink","data":{"url":"https://lasership.com/"}}]}},{"type":"heading2","content":{"text":"Frequently Asked Questions","spans":[]}},{"type":"heading3","content":{"text":"Can I Track Lasership Packages Without a Tracking Number?","spans":[]}},{"type":"paragraph","content":{"text":"Unfortunately, without a tracking number, you will not be able to track your LaserShip package’s location without the tracking number associated with it. Luckily, most merchants or online storefronts send an email confirmation with the package’s tracking information inside, other times they may send the confirmation through an SMS with the tracking information. If you ordered online and you have an online account with the merchant or storefront, check your recent purchase history for the tracking number.","spans":[]}},{"type":"heading3","content":{"text":"Does Circuit Offer Better Tracking Than LaserShip?","spans":[]}},{"type":"paragraph","content":{"text":"Circuit understands how important your package is to you and strives to make tracking your package’s whereabouts as easy as possible. With the Circuit Package Tracker, all you need to do is enter your tracking number in and within seconds, you will know exactly where your package is. If you are on the go, you can use our Circuit Package Tracker app available in your mobile device’s app store. You do not even need to know who your courier is, Circuit will find your package no matter where your package is in the world.","spans":[{"start":143,"end":166,"type":"hyperlink","data":{"url":"https://getcircuit.com/package-tracker"}}]}},{"type":"heading3","content":{"text":"How Late Does LaserShip Deliver?","spans":[]}},{"type":"paragraph","content":{"text":"During the week, LaserShip delivers starting at 8 AM local time and ends deliveries to residential addresses at 9 PM local time, with commercial address deliveries ending at 5 PM local time. In some locations, LaserShip offers special delivery services to residential addresses at the same times on Saturdays and Sundays for an extra fee. If there is a national holiday during the week or weekend, LaserShip will not deliver at all either.","spans":[]}},{"type":"heading3","content":{"text":"How Long Does It Usually Take to Deliver a Package Internationally with LaserShip?","spans":[]}},{"type":"paragraph","content":{"text":"LaserShip delivery times from international addresses vary on the destination country’s proximity to the destination country but typically does not take longer than 14 business days. However, these times can be affected by customs, weather events, operational backlogs, and national holidays either in the country of origin or the destination country. Some countries do not move packages or fulfil orders on weekends or national holidays, which can slow down delivery times.","spans":[]}},{"type":"heading3","content":{"text":"How Long Will LaserShip Hold a Package?","spans":[]}},{"type":"paragraph","content":{"text":"Typically, LaserShip prefers not to hold packages, they would rather attempt delivery twice on separate days. After the two failed deliveries, LaserShip will contact you or the merchant you ordered from to try to either correct the address or find another address to send your package to. However, if you call LaserShip, they will allow you to pick up your package at one of their local delivery facilities. The hold time will depend on the type and size of the package and if they have enough room to hold your package for you.","spans":[]}},{"type":"heading3","content":{"text":"How Do I Sign for a LaserShip Package?","spans":[]}},{"type":"paragraph","content":{"text":"Many packages that carry high-value items or contain sensitive information require a signature before being released to the recipient. Other times, a signed for service is requested for an extra fee no matter the contents. If you need to sign for your package, your courier’s delivery driver will typically carry a tablet for you to sign with a tablet pen. Sometimes the courier will require a physical pen and paper signature, this paperwork will also be supplied by the courier.","spans":[]}},{"type":"heading3","content":{"text":"How Do I Track a LaserShip Package with Circuit?","spans":[]}},{"type":"paragraph","content":{"text":"To track your package with Circuit, all you need is your package tracking number from LaserShip. Once you have entered in your tracking number, Circuit does the rest of the work for you no matter what courier your package is with. To make it even easier, Circuit offers the Circuit Package Tracker as an app found in your mobile device’s app store. This way, you can track your package from anywhere in the world at any time, even if you have multiple packages arriving from different couriers.","spans":[]}},{"type":"heading3","content":{"text":"What Do I Do if I Have Not Received My Package from LaserShip?","spans":[]}},{"type":"paragraph","content":{"text":"If your expected arrival date has passed, use the Circuit Package Tracker to track where your package was last. It may be that your package was delayed by weather, holidays, operational backlogs, or other events outside of the courier’s control. If your package says it has been delivered or has been “travelling” for longer than necessary, contact LaserShip to fill out their loss or damage forms. Accidents happen, so they may simply be able to find your package and get it back on track towards you.","spans":[]}},{"type":"heading3","content":{"text":"What Happens If LaserShip Loses My Package?","spans":[]}},{"type":"paragraph","content":{"text":"If your package has not arrived yet and it is past the expected arrival time, check to see where your package was last with the Circuit Package Tracker. If your package was outside of the Midwest or the Eastern United States, it may be that another courier was carrying your package at the time and the liability falls with them. However, once your package reaches the Midwest or the East Coast, you will have to contact LaserShip.","spans":[]}},{"type":"paragraph","content":{"text":"If your package tracker states your package has been delivered, but your package is nowhere to be seen, contact LaserShip online or by phone. They ask that you give them at least 48 hours to do a proper internal investigation regarding your package since they attempt to find the package before reimbursing or replacing your package. The procedure is the same if your package arrives damaged, you will still have to contact them online or by phone and allow them 48 hours to investigate.","spans":[{"start":112,"end":140,"type":"hyperlink","data":{"url":"https://lasership.com/track.php"}}]}},{"type":"heading3","content":{"text":"What Happens If I Miss My LaserShip Package Delivery?","spans":[]}},{"type":"paragraph","content":{"text":"If you are not home when LaserShip attempts to deliver your package, they will simply leave it at your door for when you do arrive home. If you are not home and they either cannot reach your door for whatever reason or your package requires a signature before being released to you, LaserShip will return your package to one of their local delivery centers. The next day, LaserShip will attempt delivery for a second time. If they cannot deliver your package the second time, LaserShip will contact either you or the merchant you ordered from to fix the address or select an alternative address to receive the package from. If you would prefer, they hold your package for pick up at one of the local delivery centers, you can call them and request a hold service.","spans":[]}},{"type":"heading3","content":{"text":"What Time Will My LaserShip Package Arrive?","spans":[]}},{"type":"paragraph","content":{"text":"The time your LaserShip package will arrive will depend on where you sit on your delivery driver’s route and your address type. If you have a commercial address, your package will arrive before 5 PM local time, as that is when LaserShip ends deliveries for the day to commercial addresses. For residential addresses such as apartments or houses, drivers may deliver packages as late as 9 PM local time.","spans":[{"start":378,"end":401,"type":"hyperlink","data":{"url":"https://lasership.com/faq.php"}}]}},{"type":"heading3","content":{"text":"Where Is My LaserShip Package?","spans":[]}},{"type":"paragraph","content":{"text":"By entering your tracking number into the Circuit Package Tracker, you can know exactly where your package is while it is making its journey to you. If your package still is not delivered and it is past the expected arrival date, your package may have been delayed by circumstances outside of LaserShip’s control, such as national holidays or weather events. If your package appears as pending, it just means your package has not been properly shipped yet, whether it is waiting to be picked up by LaserShip or is waiting to be scanned onto the ship, plane, or truck taking it to you.","spans":[]}},{"type":"heading3","content":{"text":"Why Is My LaserShip Package Not Moving?","spans":[]}},{"type":"paragraph","content":{"text":"Weather events, operational backlogs, customs, national holidays, and weekends can all cause your package to stop moving for some time. Other times, it may be that the courier is using milestone tracking. Milestone tracking is when the package is only tracked by major events in the shipping procedure, such as when it is out for delivery or reaches a major city. This can make it seem like your package is not moving, even if it is making its way towards you.","spans":[]}},{"type":"heading3","content":{"text":"Why Is My LaserShip Package Pending?","spans":[]}},{"type":"paragraph","content":{"text":"Do not be concerned if your package appears to be pending at first, this just means your package is not shipped yet. This can be because your package is out for pick up by LaserShip or because LaserShip has not scanned it onto the ship, plane, or truck carrying the package to you. If your package appears as pending for a longer than normal period, call the merchant or online storefront you ordered from to see if your package has been picked up by LaserShip. If your package has been picked up, check with LaserShip to see where in the shipping process your package is.","spans":[{"start":498,"end":518,"type":"hyperlink","data":{"url":"https://lasership.com/track.php"}}]}},{"type":"paragraph","content":{"text":"If you’re sending or waiting for a package with LaserShip and you want to know exactly where it is, try Circuit Package Tracker for free.","spans":[{"start":0,"end":48,"type":"em"},{"start":57,"end":137,"type":"em"},{"start":100,"end":136,"type":"strong"},{"start":100,"end":136,"type":"hyperlink","data":{"url":"https://getcircuit.com/package-tracker"}}]}}],"type":"package_tracker_carriers","tags":[],"lang":"en-us","grouplang":"YNDk6REAAJMfGeVd"}