{"slug":"star-track","carrier_id":"StarTrack","carrier_title":"StarTrack","uk_english":false,"description":[{"type":"paragraph","content":{"text":"StarTrack was originally founded in Dee Why, Sydney, Australia in 1974 as a freight company, and in 2003 was acquired by Australia Post. Now, StarTrack has expanded to transport everything from personal to commercial packages both domestically and internationally to over 200 countries worldwide.","spans":[{"start":0,"end":9,"type":"hyperlink","data":{"url":"https://startrack.com.au/"}}]}},{"type":"heading2","content":{"text":"Frequently Asked Questions","spans":[]}},{"type":"heading3","content":{"text":"Can I Track a StarTrack Package Without a Tracking Number?","spans":[]}},{"type":"paragraph","content":{"text":"Your StarTrack tracking number is needed to track packages with Circuit. Luckily, if you do not know your tracking number, there are a few places you can find your tracking information. If you ordered online from a merchant or online storefront, typically they will send you an email confirmation of your order with your tracking information inside. Other times they may prefer to send the tracking number in a confirmation SMS to your mobile device. If you did not order online and ordered in a physical storefront, they may have put the tracking information on your receipt.","spans":[{"start":64,"end":71,"type":"hyperlink","data":{"url":"https://getcircuit.com/package-tracker"}}]}},{"type":"heading3","content":{"text":"Does Circuit Offer Better Tracking Than StarTrack?","spans":[]}},{"type":"paragraph","content":{"text":"Circuit understands how important your package’s safety is to you, that is why we make it as easy as possible to track your package’s location. Not only do we offer online tracking in your web browser, but we also offer package tracking through our Circuit Package Tracker app available in your mobile device’s app store. There is no need to even know what courier is carrying your package, Circuit finds your package no matter what just using the tracking number you provide.","spans":[]}},{"type":"heading3","content":{"text":"How Late Does StarTrack Deliver?","spans":[]}},{"type":"paragraph","content":{"text":"In Australia, StarTrack delivers from 8 AM local time to 6 PM local time. They also offer after-hours, weekend, and holiday deliveries for an extra fee upon request. However, this only applies domestically, internationally StarTrack only sees your package through customs before handing it off to your local courier. For delivery times at that point, you will have to contact your local courier for more information.","spans":[]}},{"type":"heading3","content":{"text":"How Long Does It Usually Take to Deliver a Package Internationally with StarTrack?","spans":[]}},{"type":"paragraph","content":{"text":"International shipping times vary on the service you choose and the destination country’s proximity to Australia, where StarTrack is based. Typically, shipping internationally does not take longer than 14 business days, but that time frame can be delayed by weather events, national holidays, and operational backlogs. Once you have shipped your package, you can track your estimated arrival time with the Circuit Package Tracker for more accurate time frames.","spans":[]}},{"type":"heading3","content":{"text":"How Long Will StarTrack Hold a Package?","spans":[]}},{"type":"paragraph","content":{"text":"If StarTrack is unable to deliver your package, whether because your package required a signature and you were not home or because they were unable to reach your door, StarTrack will attempt to contact you regarding your package. If you choose to put a hold on your package for pick up, they will only hold your package for 10 business days. After 10 business days, they will ship the package back to the original sender.","spans":[]}},{"type":"heading3","content":{"text":"How Do I Sign for a StarTrack Package?","spans":[]}},{"type":"paragraph","content":{"text":"If your package requires a signature, your delivery driver will have everything you need to sign for your package. Most of the time, they will just have you sign electronically on a tablet they will provide, but there will be times couriers require you to sign with a pen and paper, also provided. A package that is high in value or contains sensitive information will usually require a signature before being released by the courier. Other times, it may be that you or the merchant requested a signed for service with StarTrack.","spans":[]}},{"type":"heading3","content":{"text":"How Do I Track a StarTrack Package with Circuit?","spans":[]}},{"type":"paragraph","content":{"text":"To track your package with Circuit, all you need to know is your package’s tracking number. Once you are on the Circuit Package Tracker page, enter your tracking number into the white box and let us get to work. Within seconds we will know the location of your package and begin tracking its journey to you. You can also download the Circuit Package Tracker app available in your mobile device’s app store for easy tracking on the go, even if you are half a world away from where your package is heading.","spans":[]}},{"type":"heading3","content":{"text":"What Do I Do If I Have Not Received My Package from StarTrack?","spans":[]}},{"type":"paragraph","content":{"text":"If it is past your package’s expected arrival time, enter your tracking number into the Circuit Package Tracker to see where your package was last. In many cases, packages have simply been delayed by weather or backlogs and will just arrive a few days late. However, if your package is well past the expected arrival date or says it was delivered but you did not receive your package, contact StarTrack’s customer support to find out your next steps.","spans":[{"start":393,"end":421,"type":"hyperlink","data":{"url":"https://startrack.com.au/support"}}]}},{"type":"heading3","content":{"text":"What Happens if StarTrack Loses My Package?","spans":[]}},{"type":"paragraph","content":{"text":"If your package does not arrive, check on the Circuit Package Tracker to see where your package was last. If your package was in Australia or outside of the destination country, the liability will fall with StarTrack and you will need to call or email StarTrack to report your package missing and describe the contents of the package. From there, StarTrack will attempt to locate your package before reimbursing you if they cannot find it.","spans":[{"start":238,"end":261,"type":"hyperlink","data":{"url":"https://startrack.com.au/support"}}]}},{"type":"heading3","content":{"text":"What Happens if I Miss My StarTrack Package Delivery?","spans":[]}},{"type":"paragraph","content":{"text":"If you miss your StarTrack delivery, your StarTrack delivery driver will leave the package at your door. In the case of expensive packages, sensitive documents, or packages with a signed for service requested, StarTrack will leave a note in your mailbox or on your door informing you to pick up your package at one of the nearest StarTrack post offices. At that point, you have 10 business days to pick up your package before they return it to the original sender.","spans":[]}},{"type":"heading3","content":{"text":"What Time Will My StarTrack Package Arrive?","spans":[]}},{"type":"paragraph","content":{"text":"StarTrack delivers packages in Australia from 8 AM local time to 6 PM local time but offers after-hours, weekend, and holiday services for an extra fee upon request. However, if your package is shipping internationally, StarTrack only sees your package through customs. After your package has made it through customs, StarTrack will pass it off to your local courier to finish the delivery to your address.","spans":[{"start":92,"end":134,"type":"hyperlink","data":{"url":"https://startrack.com.au/logistics-and-freight"}}]}},{"type":"heading3","content":{"text":"Where Is My StarTrack Package?","spans":[]}},{"type":"paragraph","content":{"text":"By entering your tracking number into Circuit Package Tracker, you can find out exactly where your package is. If it is past the expected arrival date, keep in mind that packages may be delayed by everything from weather to operational backlogs to national holidays. If your package appears as pending, it means StarTrack has either yet to pick up the package for shipping or has not scanned your package onto the plane, truck, or ship taking it towards you. If your package sits for longer than normal in pending or it is several days past the expected arrival date, contact StarTrack to locate your package’s exact location.","spans":[]}},{"type":"heading3","content":{"text":"Where Is My StarTrack Package Tracking Number?","spans":[]}},{"type":"paragraph","content":{"text":"There are a few places you might find your StarTrack package tracking information. If you ordered physically in a store, your tracking information may have been generated on the spot and your tracking number may be on the receipt of the purchase they handed you. If you ordered from an online merchant or storefront, your tracking information likely arrived as an email confirmation of order or SMS confirmation of the order on your mobile device. You may also find your tracking information in your recent purchase history if you have an online account with the merchant.","spans":[]}},{"type":"paragraph","content":{"text":"If your tracking information is in none of these locations, contact the merchant or online storefront you ordered from for the tracking number.","spans":[]}},{"type":"heading3","content":{"text":"Is My StarTrack Package Not Moving? ","spans":[]}},{"type":"paragraph","content":{"text":"Since many couriers choose to use milestone tracking, especially if shipping internationally, it may appear as if your package is not moving. It is not that your package is standing still or has been lost, it just means your courier is only showing you the major shipping events. Your package may look like it is in one city and has been for days, but your package may be traveling across the whole state or country on its way to the next milestone.","spans":[]}},{"type":"paragraph","content":{"text":"Other times, your package may be standing still. This is usually due to national holidays, weekends, operational backlogs, customs, or major weather events in the country or states your package is traveling through.","spans":[]}},{"type":"heading3","content":{"text":"Why Is My StarTrack Package Pending?","spans":[]}},{"type":"paragraph","content":{"text":"When StarTrack packages are out for pick up or are waiting to be scanned onto the ship, plane, or truck delivering them to you, they may appear as pending. Pending just means that there is no tracking information to be found yet. If your package appears as pending for an extended period, you may have ordered on a weekend, during a major sale event, or during a national holiday in the country, you ordered from. Contact your merchant or online storefront first if your package appears as pending for longer than necessary and ask if StarTrack has picked up the package yet. If StarTrack has picked up your package, called StarTrack to see if they can manually update you on where in the process your package is.","spans":[]}},{"type":"paragraph","content":{"text":"If you’re sending or waiting for a package with StarTrack and you want to know exactly where it is, try Circuit Package Tracker for free.","spans":[{"start":0,"end":137,"type":"em"},{"start":100,"end":136,"type":"strong"},{"start":100,"end":136,"type":"hyperlink","data":{"url":"https://getcircuit.com/package-tracker"}}]}}],"type":"package_tracker_carriers","tags":[],"lang":"en-us","grouplang":"YNDk5REAAO0mGeU4"}