{"slug":"australia-post","carrier_id":"AustraliaPost","carrier_title":"Australia Post","uk_english":false,"description":[{"type":"paragraph","content":{"text":"Australia Post has seen a few incarnations throughout Australian history. At one point all post was controlled by the Postmaster-General’s Department to replace the old colonial structure of the post. However, in 1975, the Postmaster-General’s Department was abolished and replaced with the Australian Postal Commission. Australia Post in its current incarnation and structure was established in 1989, though its official founding year is 1975. Since then, Australia Post has grown into a courier that ships everything from personal packages to medical supplies to over 230 countries worldwide.","spans":[{"start":0,"end":14,"type":"hyperlink","data":{"url":"https://auspost.com.au/"}}]}},{"type":"heading2","content":{"text":"Frequently Asked Questions","spans":[]}},{"type":"heading3","content":{"text":"Can I Track an Australia Post Package Without a Tracking Number?","spans":[]}},{"type":"paragraph","content":{"text":"You will need your tracking number to track your package with Circuit Package Tracker. Luckily, merchants and online storefronts nowadays typically send an email confirming your order that will contain the tracking number. Other times, they will send the confirmation information through an SMS on your mobile device. If you have not received your tracking number by one of these two ways, or have not received it in another form, contact the merchant or the online retailer.","spans":[{"start":62,"end":85,"type":"hyperlink","data":{"url":"https://getcircuit.com/package-tracker"}}]}},{"type":"heading3","content":{"text":"Does Circuit Offer Better Tracking Than Australia Post?","spans":[]}},{"type":"paragraph","content":{"text":"With Circuit, you can track your package across the globe no matter where it is just by entering your tracking number. Even if you do not know the courier carrying your package, we can find it for you with your tracking number. With the Circuit Package Tracker app available in your mobile phone’s app store, you can track all your packages anywhere at any time. Circuit knows how important your package is to you and we strive to help you know where your package is at all times, so you can know your package is safe.","spans":[]}},{"type":"heading3","content":{"text":"How Late Does Australia Post Deliver?","spans":[]}},{"type":"paragraph","content":{"text":"Domestically, Australia Post begins rounds for delivery at 7 AM local time and ends the delivery day at 5 PM local time. They also deliver on Saturdays for an extra fee, but Saturday deliveries end at 1 PM local time. However, when shipping internationally, Australia Post will hand your package off to your local courier to complete the journey. For more information on delivery times, contact your local courier. Delivery times may also vary on your address, depending on whether or not your address is residential, rural, or commercial.","spans":[]}},{"type":"heading3","content":{"text":"How Long Does It Usually Take to Ship a Package Internationally with Australia Post?","spans":[]}},{"type":"paragraph","content":{"text":"Australia Post has four tiers you can choose for your package that will affect the speed at which your package ships internationally. For the lowest tier, their Economy Sea Package, packages may take 2 to 3 months to arrive that their destination country. The next tier is their Standard Package, which may take 10 to 15 business days for your package to arrive at its destination. If you would like your package to arrive a little bit speedier, their Express Package takes 7 to 12 business days for your package to arrive. If you need your package within the week, their most expensive, but by far their quickest package, is the Courier Package. With the Courier Package, your package will arrive within 2 to 4 business days.","spans":[{"start":0,"end":29,"type":"hyperlink","data":{"url":"https://auspost.com.au/parcels-mail/calculate-postage-delivery-times/#/option/international/AU/US?fromPostcode=3002"}}]}},{"type":"heading3","content":{"text":"How Long Will Australia Post Hold a Package?","spans":[]}},{"type":"paragraph","content":{"text":"If Australia Post is unable to deliver your package, whether they cannot reach your door or it requires a signature and you were not home, they will bring it to an Australia Post locker. From there, you have 48 hours to pick up your package before they will send it to the nearest Australia Post Postal Office. Once your package has reached an Australia Post Postal Office, your package will be held anywhere from 1 week to 12 months depending on the type of package. Once the time has passed, your package will be returned to the sender.","spans":[]}},{"type":"paragraph","content":{"text":"However, if receiving a package internationally, Australia Post hands off your package to a local courier once it has made its way through customs. If your local courier is unable to deliver your package, they will have their own hold times and you will need to contact them for more information.","spans":[]}},{"type":"heading3","content":{"text":"How Do I Sign for an Australia Post Package?","spans":[]}},{"type":"paragraph","content":{"text":"For an additional fee, you can pay for your package to have a signature required at delivery. If you choose this route, your courier will have you sign electronically on their device with a tablet pen before releasing the package to you.","spans":[]}},{"type":"heading3","content":{"text":"How Do I Track an Australia Post Package with Circuit?","spans":[]}},{"type":"paragraph","content":{"text":"To track an Australia Post package with Circuit, find the tracking number you received from the merchant or online storefront and enter it into the Circuit Package Tracker. From there, Circuit will find your package and you can stay updated on your package’s movements on its way to you. The Circuit Package Tracker app works the same way, only this way you can track your package even while on the go.","spans":[{"start":148,"end":171,"type":"hyperlink","data":{"url":"https://getcircuit.com/package-tracker"}}]}},{"type":"heading3","content":{"text":"What Do I Do If I Have Not Received My Package from Australia Post?","spans":[]}},{"type":"paragraph","content":{"text":"If you have not received your package from Australia Post, check your package’s last location using the Circuit Package Tracker. If your package was last outside of its destination country, it falls under Australia Post’s responsibility and you will have to contact them for more information. If your package was last in your destination country, contact your local courier for more information.","spans":[{"start":104,"end":127,"type":"hyperlink","data":{"url":"https://getcircuit.com/package-tracker"}}]}},{"type":"paragraph","content":{"text":"Oftentimes, however, it may simply be that your package is experiencing delays due to weather events, customs, or operational issues. It may also be that your package required a signature and they were unable to reach you to deliver your package.","spans":[]}},{"type":"heading3","content":{"text":"What Happens if Australia Post Loses My Package?","spans":[]}},{"type":"paragraph","content":{"text":"Australia Post will reimburse you for up to 100 Australian Dollars without having purchased the extra package insurance they offer. However, if your package was valued over that amount and you purchased Australia Post insurance, they will reimburse you up to 5,000 Australian Dollars. If your package was last in your destination country, however, you will have to contact your local courier for more information.","spans":[{"start":203,"end":227,"type":"hyperlink","data":{"url":"https://auspost.com.au/receiving/delayed-lost-or-damaged-items/compensation"}}]}},{"type":"heading3","content":{"text":"What Happens if I Miss My Australia Post Package Delivery?","spans":[]}},{"type":"paragraph","content":{"text":"If you are not home when Australia Post comes to deliver your package, they will leave it on your doorstep. However, if your package requires a signature or they are unable to reach your door for delivery, they will transfer your package to an Australia Post locker where you will have 48 hours to pick it up. If your package was already in your destination country, you will have to contact your local courier for more information.","spans":[]}},{"type":"heading3","content":{"text":"What Time Will My Australia Post Package Arrive?","spans":[]}},{"type":"paragraph","content":{"text":"The arrival time of your Australia Post package, domestically, will range from 7 AM local time to 5 PM local time depending on where you are on your driver’s delivery route. With the Australia Post Express option, your package is guaranteed to arrive before 1 PM local time. If your package is being shipped internationally, the arrival time will depend on your local courier’s delivery times and where you are on your delivery driver’s route.","spans":[]}},{"type":"heading3","content":{"text":"Where is My Australia Post Package?","spans":[]}},{"type":"paragraph","content":{"text":"By entering your tracking number into the Circuit Package Tracker or the Circuit Package Tracker app on your mobile device, you can track your package across the globe and know its exact location. If your package appears as pending, it only means the merchant or online storefront has yet to ship your package. If your package appears as arrived on the Circuit Package Tracker but you have not received it, contact your local courier for more information regarding the location of your package.","spans":[]}},{"type":"heading3","content":{"text":"Where is My Australia Post Tracking Number?","spans":[]}},{"type":"paragraph","content":{"text":"You can find your Australia Post tracking number either in your confirmation email send by the merchant or online storefront or by a confirmation SMS sent by the merchant or online storefront. If your tracking number is not in either of these locations, you can contact your merchant or online storefront for more information on how to track your package. In some cases, if you have an account with the merchant or online storefront, you can find your tracking information in your purchase history.","spans":[]}},{"type":"heading3","content":{"text":"Why is My Australia Post Package Not Moving?","spans":[]}},{"type":"paragraph","content":{"text":"Some couriers only use milestone tracking, especially when shipping internationally. This means your package may be traveling across the ocean or another country on its way to you but may appear as standing still in that location. On weekends and national holidays in the country, your package is in, some services come to a standstill, meaning your package may not move on those days.","spans":[]}},{"type":"heading3","content":{"text":"Why is My Australia Post Package Pending?","spans":[]}},{"type":"paragraph","content":{"text":"Pending packages simply mean your package has yet to be sent by the merchant or online storefront, so Australia Post may not have all its information. If you ordered your package on a weekend, national holiday in the country of origin, or during a large sale event, you may not see your package ship towards you for a few days. This may also mean your package is out for pick up, meaning Australia Post is on its way to pick up the package from the merchant or online storefront.","spans":[]}},{"type":"paragraph","content":{"text":"If you’re sending or waiting for a package with Australia Post and you want to know exactly where it is,try Circuit Package Tracker for free.","spans":[{"start":0,"end":141,"type":"em"},{"start":104,"end":140,"type":"strong"},{"start":104,"end":140,"type":"hyperlink","data":{"url":"https://getcircuit.com/package-tracker"}}]}}],"type":"package_tracker_carriers","tags":[],"lang":"en-us","grouplang":"YNDk6BEAABEKGeVW"}