{"slug":"dpd","carrier_id":"DPD","carrier_title":"DPD","uk_english":false,"description":[{"type":"heading2","content":{"text":"Trust DPD Package Tracking to Deliver With Excellence","spans":[]}},{"type":"paragraph","content":{"text":"While today's package delivery services offer a high level of convenience, they can also cause a lot of stress. This is especially true if you aren't sure whether your package will arrive on time. You may also have other concerns, like your package getting lost in transit or even just missing the delivery driver.","spans":[]}},{"type":"paragraph","content":{"text":"You won't have to worry about these things when you use Circuit to track your DPD packages. Circuit Package Tracker gives you the opportunity to track every step of your item's shipment journey from beginning to end.","spans":[]}},{"type":"heading3","content":{"text":"A Trusted Courier","spans":[]}},{"type":"paragraph","content":{"text":"DPD is among the most trusted couriers in the world.","spans":[]}},{"type":"paragraph","content":{"text":"DPDgroup is a business owned by La Poste and is the umbrella company for the brands Seur, Chronopost, and BRT. In 2020, the group delivered nearly two billion packages globally, with an average daily delivery of over three million packages.","spans":[{"start":32,"end":40,"type":"hyperlink","data":{"preview":{"title":"https://getcircuit.com/package-tracker/la-poste"},"url":"https://getcircuit.com/package-tracker/la-poste"}}]}},{"type":"heading3","content":{"text":"A Strong Track Record","spans":[]}},{"type":"paragraph","content":{"text":"DPD delivers to the following European countries:","spans":[]}},{"type":"list-item","content":{"text":"United Kingdom","spans":[]}},{"type":"list-item","content":{"text":"Romania","spans":[]}},{"type":"list-item","content":{"text":"Netherlands","spans":[]}},{"type":"list-item","content":{"text":"Czech Republic","spans":[]}},{"type":"list-item","content":{"text":"Slovenia","spans":[]}},{"type":"list-item","content":{"text":"Switzerland","spans":[]}},{"type":"list-item","content":{"text":"Poland","spans":[]}},{"type":"list-item","content":{"text":"Luxembourg","spans":[]}},{"type":"list-item","content":{"text":"Lithuania","spans":[]}},{"type":"list-item","content":{"text":"Ireland","spans":[]}},{"type":"list-item","content":{"text":"Germany","spans":[]}},{"type":"list-item","content":{"text":"Hungary","spans":[]}},{"type":"list-item","content":{"text":"Kazakhstan","spans":[]}},{"type":"list-item","content":{"text":"Portugal","spans":[]}},{"type":"list-item","content":{"text":"Estonia","spans":[]}},{"type":"list-item","content":{"text":"France","spans":[]}},{"type":"list-item","content":{"text":"Belgium","spans":[]}},{"type":"list-item","content":{"text":"Belarus","spans":[]}},{"type":"list-item","content":{"text":"Austria","spans":[]}},{"type":"paragraph","content":{"text":"The DPDgroup delivers outside Europe through their affiliate companies. Some of the countries include:","spans":[]}},{"type":"list-item","content":{"text":"South Africa","spans":[]}},{"type":"list-item","content":{"text":"Egypt","spans":[]}},{"type":"list-item","content":{"text":"Morocco","spans":[]}},{"type":"list-item","content":{"text":"Turkey","spans":[]}},{"type":"list-item","content":{"text":"Russia","spans":[]}},{"type":"list-item","content":{"text":"Brazil","spans":[]}},{"type":"list-item","content":{"text":"India","spans":[]}},{"type":"list-item","content":{"text":"South-East Asia (Indonesia, Myanmar, Malaysia, Philippines, Singapore, Thailand, and Vietnam through Ninja Van)","spans":[]}},{"type":"paragraph","content":{"text":"DPD delivers a large range of items. They cater to the needs of both individuals and businesses. That said, there are restrictions to what they can ship. DPD doesn't deliver jewellery, livestock, furniture, and white goods. You also can't ship tickets, perishable goods, and tobacco with them.","spans":[]}},{"type":"heading2","content":{"text":"Track with Circuit","spans":[]}},{"type":"paragraph","content":{"text":"Circuit Package Tracker will show you the exact location of your goods in just a few clicks. This includes a timeline of where your package has been so that tracking your DPD package is easy. You'll also see when it leaves a certain location and if it is in transit.","spans":[]}},{"type":"paragraph","content":{"text":"The search results will also give you an estimated date and time for the delivery so that you are less likely to miss it.","spans":[]}},{"type":"heading2","content":{"text":"Circuit Tracking Globally","spans":[]}},{"type":"paragraph","content":{"text":"Circuit Package Tracker works the same way with both DPD local tracking and DPD international tracking with updates in real-time. Find out what route your package takes and when – anywhere in the world.","spans":[]}},{"type":"paragraph","content":{"text":"If you’re sending or waiting for a package with  DPD and you want to know exactly where it is, try Circuit Package Tracker for free now.","spans":[{"start":0,"end":136,"type":"em"},{"start":99,"end":135,"type":"hyperlink","data":{"preview":{"title":"https://getcircuit.com/package-tracker"},"url":"https://getcircuit.com/package-tracker"}}]}},{"type":"heading2","content":{"text":"Frequently asked questions","spans":[]}},{"type":"heading3","content":{"text":"Can I track a DPD package without a tracking number?","spans":[]}},{"type":"paragraph","content":{"text":"It’s not possible to track your DPD package without a tracking number. If you don’t have one or have lost it, please seek further help from DPD.","spans":[{"start":122,"end":143,"type":"hyperlink","data":{"preview":{"title":"https://www.dpd.co.uk/content/how-can-we-help/index.jsp"},"url":"https://www.dpd.co.uk/content/how-can-we-help/index.jsp"}}]}},{"type":"paragraph","content":{"text":"Did you buy from an online shop? You can also contact the shop directly. The sender is responsible for giving you the tracking number which is a 14-digit code usually sent by SMS or email.","spans":[]}},{"type":"heading3","content":{"text":"Does Circuit offer better tracking than DPD?","spans":[]}},{"type":"paragraph","content":{"text":"While both are reliable, Circuit Package Tracker offers more. This is because you can easily view updates at a glance.","spans":[{"start":25,"end":48,"type":"hyperlink","data":{"preview":{"title":"https://getcircuit.com/package-tracker"},"url":"https://getcircuit.com/package-tracker"}}]}},{"type":"paragraph","content":{"text":"When should you expect your package to arrive?","spans":[]}},{"type":"paragraph","content":{"text":"This varies depending on where you live. Your package should arrive between Monday to Saturday. Generally, deliveries will arrive between 7:30 am and 7:30 pm. The courier will inform you by text message when the delivery will be made within the hour.","spans":[]}},{"type":"paragraph","content":{"text":"You can change your delivery times if they are not convenient for you.","spans":[]}},{"type":"paragraph","content":{"text":"If you’re not home when they call, your courier can hand it over to your neighbour or leave it at a Pickup package shop in your area.","spans":[]}},{"type":"heading3","content":{"text":"How long does it usually take to deliver an international package with DPD?","spans":[]}},{"type":"paragraph","content":{"text":"DPD works hard to give everyone the same experience. Still, the delivery will vary depending on a lot of factors. Current restrictions caused by COVID-19 are the biggest reason you may have a delay right now. It also matters how far the package must travel to reach you.","spans":[]}},{"type":"paragraph","content":{"text":"DPD has a delivery time calculator you can use to give you an estimated date. All you need to do is enter the dispatch country and the destination country.","spans":[{"start":10,"end":34,"type":"hyperlink","data":{"preview":{"title":"https://www.dpd.com/hu/en/support/delivery-times-girth-calculator/"},"url":"https://www.dpd.com/hu/en/support/delivery-times-girth-calculator/"}}]}},{"type":"heading3","content":{"text":"How long will DPD hold a package?","spans":[]}},{"type":"paragraph","content":{"text":"DPD will hold your package in their Parcel Shop for eight calendar days. The countdown starts once the package arrives at the shop. It's important that you are able to collect it within this time.","spans":[]}},{"type":"heading3","content":{"text":"How to sign for a DPD package","spans":[]}},{"type":"paragraph","content":{"text":"Due to the COVID-19 pandemic, DPD has adjusted their delivery process. This includes removing the need for couriers to sign on the scanner. There are two ways that the proof of delivery will be confirmed instead:","spans":[]}},{"type":"paragraph","content":{"text":"The first is through a 4-digit PIN that you will get on your cell phone. You will need to share this code when the courier arrives. The courier will then enter the PIN code on their scanner. and place your package two meters away from you to pick it up.","spans":[]}},{"type":"paragraph","content":{"text":"If you have not been sent a pin code, the courier will ask to see a valid ID. They will enter the last five digits of your ID for their device, and this will serve as proof of delivery.","spans":[]}},{"type":"paragraph","content":{"text":"You will not be handed your package if you cannot produce proof of ID and the courier will return it to the sender instead.","spans":[]}},{"type":"paragraph","content":{"text":"If the package is for a business, the courier will take pictures of the premises. The proof of delivery will be photographs of the package within the shop, the office, or wherever your company is located.","spans":[]}},{"type":"heading3","content":{"text":"How to track a DPD package with Circuit","spans":[]}},{"type":"paragraph","content":{"text":"All you need to track your package with Circuit is your tracking number. Just enter this number into the search box and click the button that says 'Track my package'. We will show you as much detail as the courier allows. You can use this for DPD UK tracking, DPD Ireland tracking, and just about anywhere DPD delivers.","spans":[{"start":243,"end":258,"type":"hyperlink","data":{"preview":{"title":"https://www.dpd.co.uk/"},"url":"https://www.dpd.co.uk/"}}]}},{"type":"paragraph","content":{"text":"The results will display a timeline, regardless of when you use Circuit. Let's say the shipment started two days ago, then DPD tracking package with Circuit will show its journey from the very start.","spans":[]}},{"type":"heading3","content":{"text":"What do I do if I haven't got my package from DPD?","spans":[]}},{"type":"paragraph","content":{"text":"DPD does its best to prevent delays. They understand that it gets frustrating for you when you don't get packages on time. This is why they encourage you to contact them at once if this happens.","spans":[]}},{"type":"paragraph","content":{"text":"Just give them your 14-digit tracking number and they will resolve it.","spans":[]}},{"type":"heading3","content":{"text":"What happens if DPD loses my package?","spans":[]}},{"type":"paragraph","content":{"text":"You can make a claim anytime DPD loses or damages your package. They will reimburse you for the declared value of your goods. That said, you have to make the claim within a certain time period. It is important that you log it no later than 14 days of the dispatch date. You can make the formal claim within 28 days.","spans":[]}},{"type":"paragraph","content":{"text":"You can get your claim form from DPD. This form has a reference number specific to your case. Save this number and coordinate with them.","spans":[]}},{"type":"paragraph","content":{"text":"Take note that DPD will not take responsibility for lost or damaged items that you don’t report. It’s best to track your package with Circuit so that you can take fast action.","spans":[]}},{"type":"heading3","content":{"text":"What happens if I miss my DPD delivery?","spans":[]}},{"type":"paragraph","content":{"text":"Your courier will find the nearest Pickup Package Shop after the first failed attempt. The driver will send you a message to let you know. Make sure to check your phone for a ‘Not at home’ message. You can get more details from DPD about the Package Shop until you can collect your item.","spans":[]}},{"type":"heading3","content":{"text":"What time will my DPD package arrive?","spans":[]}},{"type":"paragraph","content":{"text":"You will know the exact time of delivery once your courier calls you. You can also check this through Circuit Package Tracker. When you use DPD tracking UK, you will get an estimated time of arrival. This is typically between 7:30 in the morning and 7:30 in the evening.","spans":[]}},{"type":"paragraph","content":{"text":"Once you see the delivery date on Circuit, keep an eye on your phone to make sure that you’re in to collect it.","spans":[]}},{"type":"heading3","content":{"text":"Where is my DPD package?","spans":[]}},{"type":"paragraph","content":{"text":"You can use Circuit at any time to find your package while it is in transit. Circuit Package Tracker will show you where it is in its journey. It will also give estimated delivery times so that you know when to expect it.","spans":[]}},{"type":"heading3","content":{"text":"Where is my DPD tracking number?","spans":[]}},{"type":"paragraph","content":{"text":"You can find your tracking number in your booking confirmation email. If you do not have this, you can use your DPD Local Online account. Simply log in to this account and click the ‘My Orders’ tab. You will find your DPD tracking number next to your order.","spans":[]}},{"type":"heading3","content":{"text":"Why is my DPD package not moving?","spans":[]}},{"type":"paragraph","content":{"text":"Don’t panic. If you notice no progress in the tracker, there could be a slight delay in the delivery. It could also be that Circuit is experiencing delays in registering its progress.","spans":[]}},{"type":"paragraph","content":{"text":"Consider contacting DPD if there is no progress at all for an entire day or two.","spans":[]}},{"type":"heading3","content":{"text":"Why is my DPD package pending?","spans":[]}},{"type":"paragraph","content":{"text":"DPD labels packages as ‘pending’ when they store your goods in their facilities. They do this when you are not at home to take the package, or the address is incorrect. It can also happen if you refuse the package or a problem has happened at customs.","spans":[]}},{"type":"paragraph","content":{"text":"Using Circuit to track your DPD package makes sure that you are aware of its location at any given time. It'll also allow you to take necessary actions based on its status so that you'll feel more in control of your package's delivery and receipt every step of the way. Circuit Package Tracker offers a comprehensive delivery solution for personal and business deliveries.","spans":[]}},{"type":"paragraph","content":{"text":"If you’re sending or waiting for a package with DPD and you want to know exactly where it is, try Circuit Package Tracker for free now.","spans":[{"start":0,"end":135,"type":"em"}]}}],"type":"package_tracker_carriers","tags":[],"lang":"en-us","grouplang":"YNDk6xEAABEKGeV2"}