{"slug":"colis-prive","carrier_id":"ColisPrive","carrier_title":"Colis Privé","uk_english":false,"description":[{"type":"paragraph","content":{"text":"Colis Privé was founded in 2003 and since then has grown to do over 65 million deliveries across France and Belgium. Colis Privé specializes in sending packages to individuals, usually from online storefronts or small businesses to their customers. Speed and efficiency are important to Colis Privé, with many of their deliveries happening within 24 to 48 hours of ordering.","spans":[{"start":0,"end":11,"type":"hyperlink","data":{"url":"https://www.colisprive.fr/"}}]}},{"type":"heading2","content":{"text":"Frequently Asked Questions","spans":[]}},{"type":"heading3","content":{"text":"Can I Track a Colis Privé Package Without a Tracking Number?","spans":[]}},{"type":"paragraph","content":{"text":"Unfortunately, you will need your package tracking number from Colis Privé to track the whereabouts of your package. Luckily, there are a few places your tracking number might be. In many cases, merchants or online storefronts will send you an order confirmation email with your tracking information in it, in other cases, they may send it in the form of SMS to your mobile device. If your tracking number is not in either of these locations, check your recent purchase history with the merchant online. ","spans":[]}},{"type":"heading3","content":{"text":"Does Circuit Offer Better Tracking Than Colis Privé?","spans":[]}},{"type":"paragraph","content":{"text":"Your package’s safety is important to you, Circuit knows that and strives to make sure you can know your package is safe as quickly as possible. By entering your tracking number into the Circuit Package Tracker, you will know your package’s location within seconds. To make tracking even easier, you can download the Circuit Package Tracker available in your mobile device’s app store. This way, you can track your package’s location from anywhere in the world at any time, even if you are a world away from your package’s destination location.","spans":[{"start":187,"end":210,"type":"hyperlink","data":{"url":"https://getcircuit.com/package-tracker"}}]}},{"type":"heading3","content":{"text":"How Late Does Colis Privé Deliver?","spans":[]}},{"type":"paragraph","content":{"text":"Colis Privé delivery times depend on the service chosen and whether or not you are delivering to France or Belgium. Typically, however, Colis Privé delivers packages within 24 to 48 hours from ordering, with delivery drivers running deliveries from 8 AM local time to 7 PM local time Tuesday through Saturday. If Colis Privé is unable to deliver your package, though, you will have to pick your package up from one of their post lockers, which are available 6 days a week.","spans":[]}},{"type":"heading3","content":{"text":"How Long Does It Usually Take to Deliver an International Package with Colis Privé?","spans":[]}},{"type":"paragraph","content":{"text":"If you are shipping a package internationally with Colis Privé, they typically hand the package off to another courier, unless you are shipping to Belgium. They will hand your package off within 24 to 48 hours of ordering. Once your package is handed off, it depends on the courier transporting your package, but international packages from Europe usually take about 14 business days to arrive. All these times, however, may be delayed by weather events, national holidays, weekends, and operational backlogs.","spans":[]}},{"type":"heading3","content":{"text":"How Long Will Colis Privé Hold a Package?","spans":[]}},{"type":"paragraph","content":{"text":"Sometimes, packages are too large for your mailbox or require a signature and Colis Privé was unable to reach you for delivery. In these cases, Colis Privé drivers will take your package to a “relay” point, which is a secure locker where your package will be held. These lockers are available to access 6 days a week, many are even open on Sundays. You have 10 business days to pick up your package before they will return the package to the sender.","spans":[{"start":191,"end":205,"type":"hyperlink","data":{"url":"https://www.colisprive.fr/une-question/"}}]}},{"type":"heading3","content":{"text":"How Do I Sign for a Colis Privé Package?","spans":[]}},{"type":"paragraph","content":{"text":"Sometimes, packages that are high in value, have a signature for service requested, or contain sensitive information require a signature before being released by the courier. In the case your package does require a signature, your Colis Privé delivery driver will have a tablet for you to electronically sign on with a tablet pen. It is rare, but they may have you sign on a physical paper with a pen in some cases, both of which will be provided.","spans":[]}},{"type":"heading3","content":{"text":"How Do I Track Colis Privé with Circuit?","spans":[]}},{"type":"paragraph","content":{"text":"To track your package with Circuit, all you need is your Colis Privé tracking number. Once you have your tracking number, you will enter it into the Circuit Package Tracker and let us do the work from there. Within seconds, we will have your package located and begin tracking its progress towards you, even if you did not originally know who your package’s courier was. You can also track your package with the Circuit Package Tracker app available in your mobile device’s app store for easy tracking while on the go.","spans":[]}},{"type":"heading3","content":{"text":"What Do I Do If I Have Not Received My Colis Privé Package?","spans":[]}},{"type":"paragraph","content":{"text":"Despite Colis Privé’s promise to deliver packages within 24 to 48 hours, accidents do happen. In some cases, they may not have been able to reach your door. In others, you may not have been home and your package was too large for your mailbox or required a signature upon delivery. In either case, your package would have been taken to a “relay” location, where it stays in a secure locker for pick up for up to 10 business days. If your package says it has arrived but has not, please submit a complaint or reach out to Colis Privé on Twitter.","spans":[]}},{"type":"heading3","content":{"text":"What Happens If Colis Privé Loses My Package?","spans":[]}},{"type":"paragraph","content":{"text":"If your package has been lost, use the Circuit Package Tracker to see where it last was. If it was still in France or Belgium, contact Colis Privé to submit a complaint or contact them on their Twitter page. They will ask you for your package tracking information and for you to describe the contents of the package to them. From there, they will attempt to either find your package or reimburse you for the package’s contents. Usually, packages are just delayed by weather or operational backlogs, so fixing the situation should not take long.","spans":[{"start":127,"end":146,"type":"hyperlink","data":{"url":"https://www.colisprive.fr/une-question/"}}]}},{"type":"heading3","content":{"text":"What Happens If I Miss My Colis Privé Package Delivery?","spans":[]}},{"type":"paragraph","content":{"text":"If you miss your Colis Privé delivery and your package was small enough to fit in your mailbox, your package was likely left in your mailbox. However, for packages too large to fit in a mailbox, they will leave the package with your neighbor if you are not home with a note on your door informing you. If your neighbor is unavailable or your package requires a signature upon delivery, your Colis Privé driver will return your package to a “relay” locker. Once your package is in one of these lockers, you have 10 business days to pick it up before it is returned to the sender. Luckily, these lockers are available for access 6 days a week, many are even open on Sundays.","spans":[]}},{"type":"paragraph","content":{"text":"If needed, you can reschedule your delivery to another day or time that works for you.","spans":[{"start":19,"end":43,"type":"hyperlink","data":{"url":"https://www.colisprive.fr/reprogrammer-une-livraison/"}}]}},{"type":"heading3","content":{"text":"What Time Will My Colis Privé Package Arrive?","spans":[]}},{"type":"paragraph","content":{"text":"Colis Privé delivery drivers start their day at 8 AM local time and end deliveries at 7 PM local time. These deliveries run Tuesday through Saturday, letting them deliver as many packages as possible. Colis Privé delivers packages within 24 to 48 hours after delivery, meaning your package could arrive any time after 8 AM local time, possibly even the same day you ordered it.","spans":[]}},{"type":"heading3","content":{"text":"Where Is My Colis Privé Package?","spans":[]}},{"type":"paragraph","content":{"text":"You can track your package’s progress instantly with the Circuit Package Tracker and find out exactly where your package is. However, if your package has not arrived by the expected arrival date, it may be that it was delayed by operational backlogs, weather events, and more. If it has been several days past the package’s expected arrival date, contact Colis Privé to see if they can either locate your package or explain the delay. If your package appears as pending, it likely is that the package has not been picked up from the merchant or online storefront you ordered from.","spans":[]}},{"type":"heading3","content":{"text":"Where Is My Colis Privé Package Tracking Number?","spans":[]}},{"type":"paragraph","content":{"text":"There are a few places the merchant or online storefront you ordered from may have put the tracking information for your package. Most of the time, they send the tracking information through a confirmation of order email, but they may send the confirmation in the form of SMS. If you have an online account with the merchant or online storefront, check your recent purchase history because the tracking number may be in the order there. However, in the case you ordered physically in the store, the merchant may have generated the tracking information then and there and put it on your receipt for you.","spans":[]}},{"type":"heading3","content":{"text":"Why Is My Colis Privé Package Not Moving?","spans":[]}},{"type":"paragraph","content":{"text":"When shipping over large tracts of land or internationally, some couriers use milestone tracking. Milestone tracking can make it seem like your package is not moving even when it is because it will only show the important shipping events your packages experiences. Other times, it may be because something delayed your package’s progress. This might be weather events, national holidays in the country it is in, weekends, or the courier experiencing operational backlogs.","spans":[]}},{"type":"heading3","content":{"text":"Why Is My Colis Privé Pending?","spans":[]}},{"type":"paragraph","content":{"text":"When a package is pending, it may be that your package is out for pick up by the courier’s driver. Other times, it just means they have not scanned your package onto the train, ship, or truck transporting it to you. If your package appears as pending for longer than normal, contact your merchant or online storefront you ordered from to see if Colis Privé has picked up your package yet. If they have, contact them by email or by phone to see where your package is in the shipping process.","spans":[]}},{"type":"paragraph","content":{"text":"If you’re sending or waiting for a package with the Colis Privé and you want to know exactly where it is, try Circuit Package Tracker for free.","spans":[{"start":0,"end":52,"type":"em"},{"start":64,"end":143,"type":"em"},{"start":106,"end":142,"type":"strong"},{"start":106,"end":142,"type":"hyperlink","data":{"url":"https://getcircuit.com/package-tracker"}}]}}],"type":"package_tracker_carriers","tags":[],"lang":"en-us","grouplang":"YNDk5xEAAO0mGeVO"}