{"slug":"on-trac","carrier_id":"OnTrac","carrier_title":"OnTrac","uk_english":false,"description":[{"type":"paragraph","content":{"text":"OnTrac is a fast and affordable small-parcel shipping company servicing the Western United States. OnTrac specializes in parcel logistics utilizing expedited ground services without the added cost of express shipping. Founded in California in 1991 under the name California Overnight, a division of Express Messenger Systems, Inc. Originally, California Overnight was founded to provide affordable next-day service from LA to San Francisco. But in 2008, California Overnight changed its name to OnTrac to match its proprietary shipping software. OnTrac now offers its courier services to over 65 million customers in Washington, Oregon, Idaho, Nevada, California, Utah, Arizona, and Colorado. OnTrac also offers DirectPost (a USPS Package Consolidation Service), is a SmartWay Transport Partner, a USPS Workshare Partner, and integrates with 30+ multi-solution software providers. OnTrac also offers an “On-Time for Less” money-back guarantee.","spans":[]}},{"type":"paragraph","content":{"text":" OnTrac is a parcel courier located in Western America. They’ve been in business for over 30 years. They offer quality parcel services with lower fees and surcharges than many national providers. They also offer:","spans":[]}},{"type":"list-item","content":{"text":"Faster ground delivery than other providers","spans":[]}},{"type":"list-item","content":{"text":"Rates up to 40% less than national carriers for select services","spans":[]}},{"type":"list-item","content":{"text":"Delivery to over 65 million customers in all of California, and the major metro areas of Arizona, Oregon, Nevada, Utah, Washington, Colorado, and Idaho","spans":[]}},{"type":"list-item","content":{"text":"Fast and reliable international shipping","spans":[]}},{"type":"list-item","content":{"text":"Money-Back Service Guarantee.","spans":[]}},{"type":"list-item","content":{"text":"Pickup and delivery services","spans":[]}},{"type":"list-item","content":{"text":"Excellent customer service","spans":[]}},{"type":"list-item","content":{"text":"Newly updated tracking experience with more frequent scans, status updates, easy-to-read descriptions, and online tracking assistance","spans":[]}},{"type":"list-item","content":{"text":"Fewer fees than national couriers","spans":[]}},{"type":"paragraph","content":{"text":"OnTrac delivers most packages but reserves the right to decline specific prohibited items including but not limited to, illegal goods, cash, negotiable instruments, stamps, coins, jewelry, precious metals, original artwork, antiques, one-of-a-kind items, furs, live animals, alcohol, fuel, tobacco, hazardous goods, bodily fluids, medical marijuana, and/or fragile items. Their full Terms and Conditions have more information.","spans":[]}},{"type":"paragraph","content":{"text":"OnTrac delivers to all of California and the major metropolitan areas of Arizona, Nevada, Oregon, Washington, Utah, Colorado, and Idaho. They also offer a Zip Code Lookup feature on their website to make sure your package can be delivered to the desired service area.","spans":[{"start":164,"end":170,"type":"hyperlink","data":{"preview":{"title":"https://www.ontrac.com/servicesareas.asp"},"url":"https://www.ontrac.com/servicesareas.asp"}}]}},{"type":"paragraph","content":{"text":"If you’re sending or waiting for a package with  OnTrac and you want to know exactly where it is,try Circuit Package Tracker for free.","spans":[{"start":0,"end":49,"type":"em"},{"start":55,"end":134,"type":"em"},{"start":97,"end":133,"type":"strong"},{"start":97,"end":133,"type":"hyperlink","data":{"url":"https://getcircuit.com/package-tracker"}}]}},{"type":"heading2","content":{"text":"Frequently Asked Questions","spans":[]}},{"type":"paragraph","content":{"text":"We’ve compiled a list of the most frequently asked questions regarding OnTrac Shipping and Circuit Package Tracker for your convenience. Should you have any additional questions about OnTrac Shipping, please contact their customer service department at 800.334.5000.","spans":[]}},{"type":"heading3","content":{"text":"Can I track an OnTrac package without a tracking number?","spans":[]}},{"type":"paragraph","content":{"text":"To track your package, you need a tracking number. Please contact OnTrac’s customer service department at 800.334.5000 or the merchant/shipper to obtain your tracking number. Once you’ve obtained your tracking number, simply enter it into our package tracker and select ‘track my package’ to start receiving updates on your parcel.","spans":[]}},{"type":"heading3","content":{"text":"Does Circuit offer better tracking than OnTrac?","spans":[]}},{"type":"paragraph","content":{"text":"Circuit offers the same level of tracking as OnTrac but with the simplicity of one simple search. Just enter your tracking number and select ‘track my package’ for instant peace of mind.","spans":[]}},{"type":"heading3","content":{"text":"How late does OnTrac deliver?","spans":[]}},{"type":"paragraph","content":{"text":"The latest OnTrac will deliver is by the end of the business day.","spans":[]}},{"type":"heading3","content":{"text":"How long does it usually take to deliver an international package with OnTrac?","spans":[]}},{"type":"paragraph","content":{"text":"International delivery estimates vary greatly by country. Most international packages are delivered in 2-14 business days. OnTrac has an international’s website with more detailed information.","spans":[{"start":137,"end":160,"type":"hyperlink","data":{"preview":{"title":"https://www.ontracinternational.com/home/services"},"url":"https://www.ontracinternational.com/home/services"}}]}},{"type":"heading3","content":{"text":"How long will OnTrac hold a package?","spans":[]}},{"type":"paragraph","content":{"text":"OnTrac will hold the package until it is considered non-deliverable. To meet this criterion, three delivery attempts must be made, the package must be refused, the consignee must have moved, or the C.O.D. must be uncollectable. OnTrac will contact the shipper for instructions if your package is deemed non-deliverable. Additional fees may apply for re-deliveries and returns.","spans":[]}},{"type":"heading3","content":{"text":"How to sign for an OnTrac package?","spans":[]}},{"type":"paragraph","content":{"text":"Sign your legal name on the courier’s electronic device to accept your package.","spans":[]}},{"type":"heading3","content":{"text":"How to track an OnTrac package with Circuit?","spans":[]}},{"type":"paragraph","content":{"text":"Just simply enter your tracking number into our package tracker and select ‘track my package’.","spans":[{"start":48,"end":63,"type":"hyperlink","data":{"preview":{"title":"https://getcircuit.com/package-tracker"},"url":"https://getcircuit.com/package-tracker"}}]}},{"type":"heading3","content":{"text":"What do I do if I haven't received my package from OnTrac?","spans":[]}},{"type":"paragraph","content":{"text":"First, check for a status update using our package tracker. If there isn’t a recent update explaining the delay, contact OnTrac’s customer service at 800.334.5000.","spans":[]}},{"type":"heading3","content":{"text":"What happens if OnTrac loses my package?","spans":[]}},{"type":"paragraph","content":{"text":"If you suspect your package has been lost, immediately contact OnTrac’s customer service department at 800.334.5000 to see if they can locate your parcel. If OnTrac did lose your package, contact their claims department within 30 days to make a claim. Claims@OnTrac.com","spans":[]}},{"type":"heading3","content":{"text":"What happens if I miss my OnTrac delivery?","spans":[]}},{"type":"paragraph","content":{"text":"Not to worry, OnTrac will automatically reattempt delivery on the next business day. If you are unavailable to accept your package the next day please contact OnTrac’s customer service department at 800.334.5000 and let them know when you will be available.","spans":[]}},{"type":"heading3","content":{"text":"What time will my OnTrac package arrive?","spans":[]}},{"type":"paragraph","content":{"text":"The time of day your package will arrive at will depend on which OnTrac service level it was shipped with. Sunrise is their mid-day service with delivery by noon or 2 pm on Saturday. All other service levels have variable delivery times. Check your tracking status for a more accurate delivery estimate.","spans":[]}},{"type":"heading3","content":{"text":"Where is my OnTrac package?","spans":[]}},{"type":"paragraph","content":{"text":"Enter your tracking number into our package tracker and select ‘track my package’ for an update.","spans":[]}},{"type":"heading3","content":{"text":"Where is my OnTrac tracking number?","spans":[]}},{"type":"paragraph","content":{"text":"You can find your OnTrac tracking number on your receipt or in your email. If you can’t locate your tracking number, contact the sender/merchant or OnTrac for assistance.","spans":[]}},{"type":"heading3","content":{"text":"Why is my OnTrac package not moving?","spans":[]}},{"type":"paragraph","content":{"text":"Your local delivery provider may have been delayed or your package is in transit. Contact OnTrac’s customer service at 800.334.5000 for any concerns. If your shipment arrives late you have 15 days from the invoice date to submit a refund request. Please email a spreadsheet file to GSRequest@OnTrac.com with your account number, invoice number, tracking number, and any transportation charges.","spans":[]}},{"type":"heading3","content":{"text":"Why is my OnTrac package pending?","spans":[]}},{"type":"paragraph","content":{"text":"Your package is pending because it is waiting on an update from the sender or courier. Additional parcel updates will appear if additional tracking events occur. If your package has been pending longer than expected, please feel free to contact OnTrac’s customer service department at 800.334.5000.","spans":[]}},{"type":"paragraph","content":{"text":"If you’re sending or waiting for a package with OnTrac and you want to know exactly where it is, try Circuit Package Tracker for free.","spans":[{"start":0,"end":48,"type":"em"},{"start":54,"end":134,"type":"em"},{"start":97,"end":133,"type":"strong"},{"start":97,"end":133,"type":"hyperlink","data":{"url":"https://getcircuit.com/package-tracker"}}]}}],"type":"package_tracker_carriers","tags":[],"lang":"en-us","grouplang":"YNDk7BEAAO0mGeV6"}