{"slug":"uds","carrier_id":"UDS","carrier_title":"UDS","uk_english":false,"description":[{"type":"heading1","content":{"text":"United Delivery Service (UDS) Package Tracking","spans":[]}},{"type":"paragraph","content":{"text":"For over 40 years, United Delivery Service specializes in delivering goods for businesses, ranging from florists to small businesses to the ever-growing drop shipping industry. However, they still deliver to residential addresses, typically from a business. United Delivery Service delivers almost exclusively to the United States Midwest, allowing for extra speed of service, something they strive to perfect. They do this by making use of the latest technology in tracking, transporting, and protecting your packages.","spans":[{"start":19,"end":42,"type":"hyperlink","data":{"url":"http://www.uniteddeliveryservice.com/"}},{"start":79,"end":89,"type":"hyperlink","data":{"url":"http://www.uniteddeliveryservice.com/United-Delivery-Service-Ecommerce-Shipping-Solutions.html"}}]}},{"type":"paragraph","content":{"text":"If you’re sending or waiting for a package with the UDS and you want to know exactly where it is,try Circuit Package Tracker for free.","spans":[{"start":0,"end":134,"type":"em"},{"start":97,"end":133,"type":"strong"},{"start":97,"end":133,"type":"hyperlink","data":{"url":"https://getcircuit.com/package-tracker"}}]}},{"type":"heading2","content":{"text":"Frequently Asked Questions","spans":[]}},{"type":"paragraph","content":{"text":"Can I Track a UDS Package Without a Tracking Number?","spans":[]}},{"type":"paragraph","content":{"text":"Unfortunately, without the tracking number, you are not able to track your package. However, you should be able to find your tracking number pretty easily. Most merchants or online storefronts will send you a confirmation of order email with the tracking number inside. They may also send you an SMS on your mobile device if you gave them your phone number. If you have an online account with the merchant or online storefront you purchased from, your tracking number may be in your recent purchase history. If you cannot find your tracking number in these locations, contact your merchant or online storefront for more information.","spans":[]}},{"type":"heading3","content":{"text":"Does Circuit Offer Better Tracking Than UDS Package Tracking?","spans":[]}},{"type":"paragraph","content":{"text":"Circuit understands the peace of mind that comes with knowing exactly where your package is, that is why we focus on making sure it is as easy as possible to track your package. Not only do we offer the Circuit Package Tracker in your web browser, but we also have the Circuit Package Tracker app available in your mobile device’s app store. We want to make sure you can track your package no matter where you are, whenever you need to.","spans":[{"start":203,"end":226,"type":"hyperlink","data":{"url":"https://getcircuit.com/package-tracker"}}]}},{"type":"heading3","content":{"text":"How Late Does UDS Deliver?","spans":[]}},{"type":"paragraph","content":{"text":"United Delivery Service delivers as early as 10 AM local time and as late as 8 PM local time seven days a week throughout the United States Midwest for their next day service and same day service. Most business deliveries are conducted when the business is open by 6 PM local time. These times vary often, as United Delivery Service tailors their delivery times to the customer’s needs, delivering earlier or later as needed.","spans":[{"start":158,"end":174,"type":"hyperlink","data":{"url":"http://www.uniteddeliveryservice.com/United-Delivery-Service-Next-Day-Shipping-Solutions.html"}},{"start":179,"end":195,"type":"hyperlink","data":{"url":"http://www.uniteddeliveryservice.com/United-Delivery-Service-Same-Day-Shipping-Solutions.html"}}]}},{"type":"heading3","content":{"text":"How Long Does It Usually Take to Deliver a Package Internationally with UDS?","spans":[]}},{"type":"paragraph","content":{"text":"United Delivery Service does not deliver internationally, they operate primarily in the United States Midwest. Any international shipping is outsourced to another courier after it leaves the Midwest, meaning delivery times will vary and you may have to check with United Delivery Service for who they outsource to for your destination country.","spans":[]}},{"type":"heading3","content":{"text":"How Long Will UDS Hold a Package?","spans":[]}},{"type":"paragraph","content":{"text":"The length United Delivery Service will hold your package or if they will hold your package depends on the package type. You can contact United Delivery Service either by phone, email, or online on one of their social media pages","spans":[]}},{"type":"heading3","content":{"text":"How Do I Sign for a UDS Package?","spans":[]}},{"type":"paragraph","content":{"text":"Sometimes, packages require a signature before being released by the courier. This can mean you paid for extra insurance, a signature service, or the package contains valuable items or sensitive information. If your package does require a signature, your courier’s delivery driver will have a tablet for you to electronically sign on with a tablet pen. This is true if you are receiving a package internationally and domestically. If you are not home when your UDS driver attempts delivery, they will hold the package for you at a UDS facility to pick up.","spans":[]}},{"type":"heading3","content":{"text":"How Do I Track a UDS Package with Circuit?","spans":[]}},{"type":"paragraph","content":{"text":"To track a UDS package with Circuit, you only need to enter your tracking number into the Circuit Package Tracker. From there, we do the rest of the work. No need to even know your courier’s name, we will still be able to find your package for you. This is especially easy with the Circuit Package Tracker app available in your mobile device’s app store, allowing for easy tracking on the go no matter where you are or where your package is. Circuit understands your fears regarding the location and safety of your package and we strive to alleviate them by helping you track your package as easy as possible, with just a click of a button.","spans":[]}},{"type":"heading3","content":{"text":"What Do I Do If I Have Not Received My Package From UDS?","spans":[]}},{"type":"paragraph","content":{"text":"Sometimes packages get delayed past the expected delivery date, even if you scheduled delivery for a specific time of day. Weather events or traffic may delay your driver, which is why United Delivery Service requires a number to contact you to inform you. In the case, delivery was attempted but you were unable to answer the phone at the time, contact United Delivery Service’s 24 hours a day, 7 days a week customer service online or by telephone to schedule another delivery.","spans":[]}},{"type":"heading3","content":{"text":"What Happens if UDS Loses My Package?","spans":[]}},{"type":"paragraph","content":{"text":"United Delivery Service has a wide range of security measures put in place to protect your packages and supplies, but accidents do happen and sometimes packages are lost or damaged while in transport. Because United Delivery Service provides photo proof of delivery, if your delivery says it was delivered and is not on your doorstep, you may need to file a report with the authorities. If your package was lost on route to you, United Delivery Service has customer service representatives available 24 hours a day, 7 days a week by telephone or email.","spans":[]}},{"type":"heading3","content":{"text":"What Happens if I Miss My UDS Package Delivery?","spans":[]}},{"type":"paragraph","content":{"text":"If your package required a signature before being released to the recipient, United Delivery Service will attempt to contact you by telephone to alert you and schedule another delivery time. ","spans":[]}},{"type":"paragraph","content":{"text":"If your package did not require a signature, United Delivery Service will leave your package at your door.","spans":[]}},{"type":"heading3","content":{"text":"What Time Will My UDS Package Arrive?","spans":[]}},{"type":"paragraph","content":{"text":"United Delivery Service tailors their delivery times to the needs of their customers, whether they are a small business, corporation, or residential address. This means the time your package will arrive is entirely up to you. If you chose the next day option, your package can arrive as early as 10 AM local time the next day and as late as 8 PM local time. For business addresses, packages arrive by 6 PM local time while the store is open, giving the business time to process the order being received before closing time.","spans":[]}},{"type":"heading3","content":{"text":"Where Is My UDS Package?","spans":[]}},{"type":"paragraph","content":{"text":"To track your package’s location, you can enter your tracking number in the Circuit Package Tracker or in the Circuit Package Tracker app. Even if your package does not appear to be moving, it likely is as most packages only have milestone tracking on them. If you cannot find your package yet, it simply means the merchant or online storefront has yet to send your package. Other times, you may see your package as pending, this just means it has been picked up by UDS, but not scanned onto a ship, plane, or truck to start its journey.","spans":[]}},{"type":"heading3","content":{"text":"Where Is My UDS Tracking Number?","spans":[]}},{"type":"paragraph","content":{"text":"Most merchants and online storefronts these days send an automated confirmation of order email with your tracking information inside, other times they will send you an SMS to your mobile device if you provided your email. If your tracking number is not in either of these places, check your purchase history online account with the merchant or online storefront, because your tracking number may be there. If you ordered in-store, your tracking number or other tracking information may be on the receipt you received from your merchant.","spans":[]}},{"type":"paragraph","content":{"text":"If you cannot find your tracking number one of these ways, contact your merchant or online storefront for more information.","spans":[]}},{"type":"heading3","content":{"text":"Why Is My UDS Package Not Moving?","spans":[]}},{"type":"paragraph","content":{"text":"There are a few reasons your United Delivery Service package may not be moving. Packages may come to a standstill on national holidays or weekends because workers are off on those days, which is important to keep in mind when choosing a delivery date. Other things that may be out of the courier’s control are operational backlogs, busy delivery seasons like wintertime, and weather events that prevent couriers from moving. Packages may also only have milestone tracking, meaning it will not appear to move while out for delivery or in a certain town, even though your package is still moving towards you.","spans":[]}},{"type":"heading3","content":{"text":"Why Is My UDS Package Pending?","spans":[]}},{"type":"paragraph","content":{"text":"Packages that are pending are usually because the tracking number has been generated, but the package has not been picked up or received by United Delivery Service. It may have also already been picked up, but is either on its way to a sorting facility or is about to be loaded onto the truck or plane that will bring it to you. If your package appears to be pending for an unusual amount of time, check with your merchant or online storefront to make sure the package was picked up by United Delivery Service. If it was, contact United Delivery Service’s 24/7 phone customer service to find out more information on your package.","spans":[]}},{"type":"paragraph","content":{"text":"If you’re sending or waiting for a package with the UDS and you want to know exactly where it is,try Circuit Package Tracker for free.","spans":[{"start":0,"end":134,"type":"em"},{"start":97,"end":133,"type":"strong"},{"start":97,"end":133,"type":"hyperlink","data":{"url":"https://getcircuit.com/package-tracker"}}]}}],"type":"package_tracker_carriers","tags":[],"lang":"en-us","grouplang":"YNDk5xEAAJMfGeVQ"}