{"slug":"usps","carrier_id":"USPS","carrier_title":"USPS","uk_english":false,"description":[{"type":"paragraph","content":{"text":"The United States Postal Service (USPS) is an independent agency of the executive branch of the American government. The USPS supplies postal services to people and businesses throughout the country.","spans":[]}},{"type":"paragraph","content":{"text":"The Postal Service's roots go back to 1775. The operation was introduced in the Second Continental Congress as a group devoted to monitoring mail services in the American colonies. It became the Post Office Department in 1792 following the introduction of the Postal Service Act, and it became an independent agency in 1971.","spans":[]}},{"type":"paragraph","content":{"text":"The United States Postal Service consists of nearly half a million career employees working to provide mail service to all Americans regardless of the price, location, or other factors. The USPS has nearly 35,000 post offices throughout the country and its many territories.","spans":[]}},{"type":"heading2","content":{"text":"What and where do the USPS deliver?","spans":[]}},{"type":"paragraph","content":{"text":"The USPS delivers everything from letters and postcards to packages from various businesses or retailers. Customers can use USPS' various fast delivery options to send their items faster, including the Priority Mail and First-Class Mail choices.","spans":[]}},{"type":"paragraph","content":{"text":"The USPS delivers mail and packages to not only people throughout the United States but also to more than 190 countries worldwide. The USPS prides itself in delivering its mail to many places, even if it means using its Mule Train.","spans":[{"start":210,"end":230,"type":"hyperlink","data":{"preview":{"title":"https://facts.usps.com/8-mile-mule-train-delivery/"},"url":"https://facts.usps.com/8-mile-mule-train-delivery/"}}]}},{"type":"paragraph","content":{"text":"If you’re sending or waiting for a package with the USPS and you want to know exactly where it is, try Circuit Package Tracker for free.","spans":[{"start":0,"end":136,"type":"em"},{"start":99,"end":135,"type":"hyperlink","data":{"preview":{"title":"https://getcircuit.com/package-tracker"},"url":"https://getcircuit.com/package-tracker"}}]}},{"type":"heading2","content":{"text":"Frequently asked questions","spans":[]}},{"type":"heading3","content":{"text":"Can I track a USPS package without a tracking number?","spans":[]}},{"type":"paragraph","content":{"text":"You must keep your retail receipt after ordering a shipment through the USPS to make sure you can track whatever you want to review. You won't be able to track your package without a suitable USPS tracking number. Your USPS tracking data will feature 22 digits and will be sent to you after you pay postage on a qualifying shipping product.","spans":[{"start":192,"end":212,"type":"hyperlink","data":{"preview":{"title":"https://faq.usps.com/s/article/USPS-Tracking-The-Basics"},"url":"https://faq.usps.com/s/article/USPS-Tracking-The-Basics"}}]}},{"type":"heading3","content":{"text":"Does Circuit offer better tracking than USPS?","spans":[]}},{"type":"paragraph","content":{"text":"Yes! You might be worried about whether your USPS package is moving and if it'll get to its target destination. Circuit Package Tracker will help you with this. You can enter your USPS tracking number into Circuit to get real-time info on your package and confirm your package is moving.","spans":[]}},{"type":"paragraph","content":{"text":"Circuit Package Tracker will give you instant USPS tracking reports on any package so long as you have your tracking number.","spans":[]}},{"type":"paragraph","content":{"text":"Circuit Package Tracker also offers tracking services for all major international post offices and shipping services, including the USPS, UPS, FedEx, DHL, Royal Mail, and Canada Post. You'll only need to enter your tracking number and then select the carrier. Circuit Package Tracker can even auto-detect your shipping provider if necessary.","spans":[]}},{"type":"heading3","content":{"text":"How late does the USPS deliver?","spans":[]}},{"type":"paragraph","content":{"text":"The USPS will complete its daily deliveries by 5 pm. local time, Mondays to Saturdays. Your package may be delivered in the morning if it's ready after 5 pm. in your area. If your USPS package tracking data shows your package is in your destined place after 5 pm., it likely won't be delivered until the next morning.","spans":[]}},{"type":"paragraph","content":{"text":"Sometimes a USPS carrier may deliver something beyond 5 pm., but they do not guarantee that you will get your package in the evening.","spans":[]}},{"type":"heading3","content":{"text":"How long does it usually take to deliver an international package with USPS?","spans":[]}},{"type":"paragraph","content":{"text":"The USPS proudly ships mail to more than 190 countries worldwide. The timeframe for when they'll deliver an international package will vary surrounding the service you order and its destination. For example:","spans":[{"start":41,"end":64,"type":"hyperlink","data":{"preview":{"title":"https://www.usps.com/international/"},"url":"https://www.usps.com/international/"}}]}},{"type":"list-item","content":{"text":"Global Express Guaranteed offers shipping from one to three days in various major markets.","spans":[]}},{"type":"list-item","content":{"text":"Priority Mail Express offers deliveries in three to five days.","spans":[]}},{"type":"list-item","content":{"text":"Standard Priority Mail takes six to ten days to deliver.","spans":[]}},{"type":"list-item","content":{"text":"First-Class shipments do not have any specific timeframes for when your items will be delivered. You'd also have to spend extra on a USPS tracking number for First-Class mail.","spans":[]}},{"type":"paragraph","content":{"text":"The timeframe for international delivery may also vary surrounding:","spans":[]}},{"type":"list-item","content":{"text":"How remote the location for delivery is","spans":[]}},{"type":"list-item","content":{"text":"Whether there are rules or limitations on what someone is trying to ship","spans":[]}},{"type":"list-item","content":{"text":"Customs and security standards in different countries; USPS can suspend its delivery guarantees on shipments to some countries as necessary","spans":[]}},{"type":"heading3","content":{"text":"How long will USPS hold a package?","spans":[]}},{"type":"paragraph","content":{"text":"The USPS offers a Package Intercept feature where you can ask that they hold the package. Your package will be held at a post office near you to pick up when you like. The USPS will hold your package for up to seven business days.","spans":[{"start":18,"end":35,"type":"hyperlink","data":{"preview":{"title":"https://faq.usps.com/s/article/USPS-Package-Intercept-The-Basics"},"url":"https://faq.usps.com/s/article/USPS-Package-Intercept-The-Basics"}}]}},{"type":"heading2","content":{"text":"How do you sign for a USPS package?","spans":[]}},{"type":"paragraph","content":{"text":"You might need to sign for a USPS package if the sender has paid for it. You can sign for a package when the courier brings it to you.","spans":[]}},{"type":"paragraph","content":{"text":"For cases where you're not there when a courier tries to deliver a package for you to sign, you'll get a notice. The courier will return you to your local post office. Check the message for instructions on how you can pick it up. You could call to have it redelivered, but you'll also have the choice to visit your local post office to pick it up and sign for it yourself.","spans":[]}},{"type":"paragraph","content":{"text":"You'll have to sign for a USPS package if the shipment meets any of these criteria:","spans":[{"start":61,"end":82,"type":"hyperlink","data":{"preview":{"title":"https://pe.usps.com/text/dmm100/sending-receiving.htm"},"url":"https://pe.usps.com/text/dmm100/sending-receiving.htm"}}]}},{"type":"list-item","content":{"text":"Is a Priority Mail Express package","spans":[]}},{"type":"list-item","content":{"text":"Is Certified Mail","spans":[]}},{"type":"list-item","content":{"text":"Has an insurance policy of at least $500","spans":[]}},{"type":"list-item","content":{"text":"Includes collect on delivery rules","spans":[]}},{"type":"list-item","content":{"text":"Features a return receipt","spans":[]}},{"type":"list-item","content":{"text":"Has anything that requires an adult to pick up and sign for","spans":[]}},{"type":"heading3","content":{"text":"How do you track a USPS package with Circuit?","spans":[]}},{"type":"paragraph","content":{"text":"You can track any USPS package with Circuit as long as you have the necessary USPS tracking number. You can use these steps:","spans":[{"start":8,"end":43,"type":"hyperlink","data":{"preview":{"title":"https://getcircuit.com/package-tracker"},"url":"https://getcircuit.com/package-tracker"}}]}},{"type":"o-list-item","content":{"text":"Look for the USPS tracking data for a package. The USPS tracking package number features 22 numbers scattered with five sets of four-digit numbers and one two-digit number at the end.","spans":[]}},{"type":"o-list-item","content":{"text":"Enter the tracking number into the box.","spans":[]}},{"type":"o-list-item","content":{"text":"Select the USPS option when choosing a carrier. Circuit Package Tracker can also automatically detect when you have a USPS tracking number.","spans":[]}},{"type":"o-list-item","content":{"text":"Click the Track My Package button. You'll get details on where your package is and when that data was last updated.","spans":[]}},{"type":"heading3","content":{"text":"What do I do if I haven't received my package from USPS?","spans":[]}},{"type":"paragraph","content":{"text":"The USPS will mark your package as missing if it hasn't been delivered before the expected date. You can check Circuit to see where your package is in real-time if you have your USPS package tracking number.","spans":[]}},{"type":"paragraph","content":{"text":"You can contact a USPS customer service representative a few days from when your package was sent if it is still missing. Make sure you give the tracking number to help the USPS find your package.","spans":[{"start":8,"end":54,"type":"hyperlink","data":{"preview":{"title":"https://faq.usps.com/s/article/Delayed-Mail-and-Packages"},"url":"https://faq.usps.com/s/article/Delayed-Mail-and-Packages"}}]}},{"type":"heading3","content":{"text":"What happens if the USPS loses my package?","spans":[]}},{"type":"paragraph","content":{"text":"Your package may be deemed lost if you haven't received it within enough time. Check your USPS shipping data with Circuit to see where your package is and report this data to the USPS through a Missing Mail search request. You'll need the following things to do this:","spans":[{"start":20,"end":31,"type":"hyperlink","data":{"preview":{"title":"https://faq.usps.com/s/article/Missing-Mail-The-Basics"},"url":"https://faq.usps.com/s/article/Missing-Mail-The-Basics"}}]}},{"type":"list-item","content":{"text":"The addresses of both who are sending the package and who's receiving it","spans":[]}},{"type":"list-item","content":{"text":"The mailing date","spans":[]}},{"type":"list-item","content":{"text":"The tracking number and the last known reported location of the package","spans":[]}},{"type":"list-item","content":{"text":"Details surrounding the shipment, including its contents and the appearance of the package","spans":[]}},{"type":"paragraph","content":{"text":"The USPS encourages you to file a Missing Mail request as soon as possible so that it is easier to find your packages.","spans":[]}},{"type":"heading3","content":{"text":"What happens if I miss my USPS delivery?","spans":[]}},{"type":"paragraph","content":{"text":"You'll get a Redelivery Notice in your mailbox or at your front door specifying that a mail carrier tried to deliver something to you but couldn't do so. The Redelivery Notice may include details on why the delivery couldn't be made. Some of these reasons include the shipment needing a signature or postage fee, an item not fitting a mailbox, or concerns about whether the item can stay in a secure place.","spans":[{"start":13,"end":30,"type":"hyperlink","data":{"preview":{"title":"https://faq.usps.com/s/article/PS-Form-3849-Redelivery-Notice"},"url":"https://faq.usps.com/s/article/PS-Form-3849-Redelivery-Notice"}}]}},{"type":"paragraph","content":{"text":"Check the instructions on your Redelivery Notice for info on how to pick up your package. You might be able to get it from a designated post office. An authorized person can also personally pick up your package if you can't be there, although that new person would have to give it.","spans":[]}},{"type":"paragraph","content":{"text":"You can also schedule redelivery at your property. The notice will feature a QR code you can scan or a web address with a tracking number you can enter.","spans":[]}},{"type":"heading3","content":{"text":"What time will my USPS package arrive?","spans":[]}},{"type":"paragraph","content":{"text":"The answer here will vary surrounding the shipping option. The USPS features an assortment of shipping choices that you or you or the sender can select. You'll get your package in fewer than seven days in some cases, although the timing will vary surrounding your location, the size and type of shipment, and the service used here. You can check Circuit for updates on where your package is before it arrives.","spans":[{"start":80,"end":110,"type":"hyperlink","data":{"preview":{"title":"https://www.usps.com/ship/mail-shipping-services.htm"},"url":"https://www.usps.com/ship/mail-shipping-services.htm"}}]}},{"type":"heading3","content":{"text":"Where is my USPS package?","spans":[]}},{"type":"paragraph","content":{"text":"Circuit will tell you where your USPS package is before it arrives at your property. It may be a shipping centre or other space for holding as it gets on its way to your home.","spans":[]}},{"type":"paragraph","content":{"text":"Sometimes your package might be near your property, but the USPS couldn't deliver it for some reason. They can redeliver your package the next day, or you can visit a post office where your package is being held.","spans":[]}},{"type":"paragraph","content":{"text":"There are also cases where your USPS package was delivered, but it was in another location where the courier thought it was safe from poor weather, theft, or other issues. Your packages may come separately from the rest of your USPS mail, so check all possible delivery locations.","spans":[]}},{"type":"heading3","content":{"text":"Where is my USPS tracking number?","spans":[]}},{"type":"paragraph","content":{"text":"Check one of these features to find your USPS tracking number:","spans":[{"start":0,"end":27,"type":"hyperlink","data":{"preview":{"title":"https://tools.usps.com/go/TrackConfirmAction_input"},"url":"https://tools.usps.com/go/TrackConfirmAction_input"}}]}},{"type":"list-item","content":{"text":"A shipping receipt you got from your local post office","spans":[]}},{"type":"list-item","content":{"text":"A sales receipt for postal insurance you bought at your post office","spans":[]}},{"type":"list-item","content":{"text":"Email confirmation if you shipped something through USPS.com","spans":[]}},{"type":"list-item","content":{"text":"A shopping confirmation email from a retailer","spans":[]}},{"type":"list-item","content":{"text":"The bottom part of a USPS Tracking label","spans":[]}},{"type":"paragraph","content":{"text":"The number is 22 digits long in the US and shorter for international shipments.","spans":[]}},{"type":"heading3","content":{"text":"Why is my USPS package not moving?","spans":[]}},{"type":"paragraph","content":{"text":"You might be frustrated if your USPS package isn't moving as fast you want. You might have checked your package data on Circuit a few times, but you noticed the data isn't changing. There are many reasons why your package is struggling to move:","spans":[]}},{"type":"list-item","content":{"text":"The address for a shipment is either incomplete or wrong.","spans":[]}},{"type":"list-item","content":{"text":"Someone missorted your package at a facility. The USPS handles thousands of packages each day, so there's a chance there could have been an error.","spans":[]}},{"type":"list-item","content":{"text":"Weather-related issues could be a factor, especially during serious rain or snowstorms. Tropical systems, earthquakes, tornados, and other severe weather emergencies can also be a risk in some places.","spans":[]}},{"type":"list-item","content":{"text":"The packaging for something may not be suitable for your order. A courier can stop delivering something if it appears the package is too dangerous or unstable. The packaging could have come apart, or the contents are too dangerous for the current package.","spans":[]}},{"type":"paragraph","content":{"text":"Don't hesitate if your USPS package isn't moving. It can take up to 48 hours for the tracking data to be updated.","spans":[]}},{"type":"heading3","content":{"text":"Why is my USPS package pending?","spans":[]}},{"type":"paragraph","content":{"text":"You'll see before someone ships out your USPS package that it is \"pending.\" The term means that a USPS clerk accepted the package, but it has not reached the first USPS sorting facility.","spans":[]}},{"type":"paragraph","content":{"text":"Your package may be pending due to the item being in an extended queue for processing. Your order will be processed after the earlier ones are finalized.","spans":[]}},{"type":"paragraph","content":{"text":"Sometimes your package is pending because whoever sends it does so as part of a more massive shipment. Many retailers might package a couple of dozen items together out of convenience and to simplify the shipping process. A USPS station still has to individually scan each item to make sure the shipment is moving","spans":[]}},{"type":"paragraph","content":{"text":"If you’re sending or waiting for a package with the USPS and you want to know exactly where it is, try Circuit Package Tracker for free.","spans":[{"start":0,"end":136,"type":"em"},{"start":99,"end":135,"type":"hyperlink","data":{"preview":{"title":"https://getcircuit.com/package-tracker"},"url":"https://getcircuit.com/package-tracker"}}]}}],"type":"package_tracker_carriers","tags":[],"lang":"en-us","grouplang":"YNDk5REAACMAGeU-"}