{"slug":"apc-overnight","carrier_id":"APC","carrier_title":"APC Overnight","uk_english":false,"description":[{"type":"paragraph","content":{"text":"Founded by older, experienced delivery companies in 1993, APC Overnight has grown to become the United Kingdom’s largest independent delivery network. Specializing in overnight package delivery, APC Overnight delivers to both individuals and companies. Not only does APC Overnight delivery all over English, Wales, Northern Ireland, and Scotland, but also to over 200 countries worldwide.","spans":[]}},{"type":"heading2","content":{"text":"Frequently Asked Questions","spans":[]}},{"type":"heading3","content":{"text":"Can I Track an APC Overnight Package Without a Tracking Number?","spans":[]}},{"type":"paragraph","content":{"text":"Without your APC Overnight tracking number, you will not be able to track your package. However, there are a few places your tracking number may be. Most merchants and online storefronts prefer to send the tracking information in your confirmation of order email, other times they will send it in the confirmation of order SMS to your mobile device. If you cannot find it in your email or SMS inbox, check your online account with the merchant or online storefront, as it may be in your order details in your order history.","spans":[]}},{"type":"paragraph","content":{"text":"Lastly, if you ordered with a physical merchant, they may have generated the tracking information and put it on your receipt of purchase.","spans":[]}},{"type":"heading3","content":{"text":"Does Circuit Offer Better Tracking Than APC Overnight?","spans":[]}},{"type":"paragraph","content":{"text":"Circuit takes pride in helping others find their packages as quickly as possible because we know how important your package’s safety and whereabouts are to you. With the Circuit Package Tracker, all you need to do is enter in your tracking number for your package and let us do the rest, no need to even know who your courier is. Once we have your tracking number, we will find and track your package’s location as it makes its journey. We also offer the Circuit Package Tracker app available in your mobile device’s app store for easy tracking on the go, even if you are half a world away from your package’s destination.","spans":[]}},{"type":"heading3","content":{"text":"How Late Does APC Overnight Deliver?","spans":[]}},{"type":"paragraph","content":{"text":"Delivery times vary because APC Overnight tailors delivery to your needs. The sender will select either 9 AM, 10 AM, 12 AM-noon, or 4 PM local time and your package will be delivered between 8 AM local time and the selected time on the next business day. APC Overnight delivers on Mondays through Fridays, with Saturday deliveries available for an extra fee upon request.","spans":[]}},{"type":"paragraph","content":{"text":"However, this only applies to domestic deliveries within the United Kingdom. If receiving a package internationally, your package’s arrival time will depend on your local courier because APC Overnight only sees your package through customs in its destination country before handing it off to your local courier.","spans":[]}},{"type":"heading3","content":{"text":"How Long Does It Usually Take to Deliver an International Package with APC Overnight?","spans":[]}},{"type":"paragraph","content":{"text":"Delivery times to international countries vary on the service chosen and the destination country’s proximity to the United Kingdom. Typically, international shipping from the United Kingdom takes no longer than 14 business days. These times may be delayed by weather events, national holidays in the country of origin, weekends, and operational backlogs. If your package has arrived in its destination country but seems to be stuck in one spot, it may be that customs is still inspecting your package before allowing it entry into the country.","spans":[]}},{"type":"heading3","content":{"text":"How Long Will APC Overnight Hold a Package?","spans":[]}},{"type":"paragraph","content":{"text":"In some cases, APC Overnight may not be able to complete a delivery, either because your package required a signature and you were unavailable or because they could not reach your address. In these cases, APC Overnight will hold your package for up to 5 working days before returning the package to the sender. Luckily, you can reschedule your delivery as long as it is within the 5 working days. If you would prefer to pick up your package, the rules remain the same, and you have until 7 PM local time to pick up your package from the nearest APC Overnight center.","spans":[]}},{"type":"paragraph","content":{"text":"However, this only applies to domestic packages in the United Kingdom. If you are shipping your package internationally, you will have to contact your local courier for hold time information. In some cases, couriers will hold international packages for a reduced amount of time.","spans":[]}},{"type":"heading3","content":{"text":"How Do I Sign for an APC Overnight Package?","spans":[]}},{"type":"paragraph","content":{"text":"If a package is high in value, contains sensitive information, or has a signed for service requested, you may have to sign before your package will be released to you. In some cases, the delivery driver will have you sign electronically on a tablet they will provide with a tablet pen. Sometimes, however, they will ask that you sign with a pen and paper they will provide. In both cases, you will typically receive a copy of the document you signed saying you received your package.","spans":[]}},{"type":"heading3","content":{"text":"How Do I Track an APC Overnight Package with Circuit?","spans":[]}},{"type":"paragraph","content":{"text":"To track your APC Overnight package with Circuit, all you need is your tracking number from the merchant or online storefront you ordered from. Once you have your tracking number, enter it into the Circuit Package Tracker and let us take it from there. Without even knowing the courier carrying your package, we will find your package within a matter of seconds. We know how important it is to know your package is safe and sound. That is why we also offer the Circuit Package Tracker app available in your mobile device’s app store for easy tracking on the go, no matter where you or your package is.","spans":[]}},{"type":"heading3","content":{"text":"What Do I Do If I Haven't Received My Package from APC Overnight?","spans":[]}},{"type":"paragraph","content":{"text":"In the case you have not received your package from APC Overnight, check your package’s last location with the Circuit Package Tracker. It may be that your package has simply been delayed by anything from a weather event to operational backlogs to the weekend arriving. However, if your package says it has been delivered or it is well past the expected arrival date and your package was last in the United Kingdom, contact APC Overnight for more information.","spans":[]}},{"type":"paragraph","content":{"text":"In case your package was shipping internationally and has already reached its destination country, contact your local courier to see if they have received your package yet or if it is being held up by customs.","spans":[]}},{"type":"heading3","content":{"text":"What Happens if APC Overnight Loses My Package?","spans":[]}},{"type":"paragraph","content":{"text":"Before filing a lost or damaged package report, use the Circuit Package Tracker to see your package’s last location. It may still be out for delivery. However, if your package is not out for delivery still, contact APC Overnight customer support. From there, they will ask you for your tracking information and for you to describe the contents of your package to see if they can either locate your package or reimburse you for the contents. ","spans":[]}},{"type":"paragraph","content":{"text":"If your package was shipping internationally and it was last in its destination country, you should contact your local courier instead. The procedure will be similar, they will still ask for your information to see what step they need to take next.","spans":[]}},{"type":"heading3","content":{"text":"What Happens If I Miss My APC Overnight Delivery?","spans":[]}},{"type":"paragraph","content":{"text":"If you happen to miss your APC Overnight delivery, whether because you were not home or they could not reach your door, your package will be taken back to an APC Overnight facility. Once your package arrives at the facility, you cannot pick it up in person until the next day. If you choose to pick up your package instead of delivery, you have 5 working days to pick up your package before it is returned to the original sender. If you would still prefer to have your package delivered, you can reschedule your delivery, but still must do so within the same 5 working days. APC Overnight centers are open until 7 PM local time.","spans":[]}},{"type":"heading3","content":{"text":"What Time Will My APC Overnight Package Arrive?","spans":[]}},{"type":"paragraph","content":{"text":"APC Overnight delivery times are largely dependent on the customer, as the sender selects a preferred delivery time when shipping. The times available are 9 AM, 10 AM, 12 AM-noon, and 4 PM local time, but deliveries may arrive anywhere from 8 AM local time to the selected delivery time.","spans":[]}},{"type":"heading3","content":{"text":"Where is My APC Overnight Package?","spans":[]}},{"type":"paragraph","content":{"text":"By using the Circuit Package Tracker, you can find your package’s location no matter where it is. If your package appears as pending, it just means APC Overnight is either picking it up or loading it onto the truck that will deliver it. If it is past your package’s expected arrival date or time, there may have been a delay, such as the weather or operational backlogs.","spans":[]}},{"type":"heading3","content":{"text":"Where is My APC Overnight Package Tracking Number?","spans":[]}},{"type":"paragraph","content":{"text":"There are a few places you might find your package’s tracking information. Most merchants and online storefronts prefer to use a confirmation of order email to send you your tracking information, others may use an SMS to your mobile device. If your tracking number is not sent to you by email or SMS and you have an account with the merchant or online storefront, check your recent purchase history. If you ordered in a physical storefront, your tracking number may have been generated on your receipt","spans":[]}},{"type":"paragraph","content":{"text":"If your tracking number is not in any of these locations, try contacting the merchant or storefront you ordered from for the tracking number.","spans":[]}},{"type":"heading3","content":{"text":"Why is My APC Overnight Package Not Moving?","spans":[]}},{"type":"paragraph","content":{"text":"When shipping packages over large tracts of land or internationally, many couriers elect to use milestone tracking, which may make it seem like your package is not moving. Milestone tracking is simply when couriers update package location only when your package hits an important milestone in the shipping process, such as reaching a certain country.","spans":[]}},{"type":"heading3","content":{"text":"Why is My APC Overnight Package Pending?","spans":[]}},{"type":"paragraph","content":{"text":"Usually, when a package is pending, it just means your package is out for pick up from the merchant or online storefront you ordered from. Other times it may mean that your package has yet to be scanned onto the ship, plane, or train delivering your package to you.","spans":[]}},{"type":"paragraph","content":{"text":"If you’re sending or waiting for a package with APC Overnight and you want to know exactly where it is, try Circuit Package Tracker for free.","spans":[{"start":0,"end":141,"type":"em"},{"start":104,"end":140,"type":"strong"},{"start":104,"end":140,"type":"hyperlink","data":{"url":"https://getcircuit.com/package-tracker"}}]}}],"type":"package_tracker_carriers","tags":[],"lang":"en-us","grouplang":"YNDk6hEAACMAGeVs"}