{"slug":"canpar-express","carrier_id":"Canpar","carrier_title":"Canpar","uk_english":false,"description":[{"type":"heading3","content":{"text":"What is Canpar Express?","spans":[]}},{"type":"paragraph","content":{"text":"Canpar Express is one of Canada’s leading small package delivery companies. Canpar Express has over 55 terminals all over Canada and features 800 SMARTSpot locations. If a customer is unable to have a package delivered to them they can select a SMARTSpot location to pick up their package. ","spans":[]}},{"type":"heading3","content":{"text":"What do they deliver?","spans":[]}},{"type":"paragraph","content":{"text":"Canpar Express is an express shipping service for small packages that need a short delivery time.","spans":[]}},{"type":"paragraph","content":{"text":"Where in the world do they deliver?","spans":[]}},{"type":"paragraph","content":{"text":"Canpar Express only delivers locally in Canada. They do not ship outside of Canada. ","spans":[]}},{"type":"heading2","content":{"text":"Frequently Asked Questions","spans":[]}},{"type":"heading3","content":{"text":"Can I track a Canpar Express package without a tracking number?","spans":[]}},{"type":"paragraph","content":{"text":"No, you can not. You will need the tracking number given to you so that you can track the package. ","spans":[]}},{"type":"heading3","content":{"text":"Does Circuit offer better tracking than Canpar Express?","spans":[]}},{"type":"paragraph","content":{"text":"The Circuit Package Tracker connects with a variety of different systems to give accurate tracking from as wide a range of services as possible. On the other hand, Canpar Express’s tracker is limited to their packages and tied to the functionality of their website.","spans":[]}},{"type":"heading3","content":{"text":"How late does Canpar Express deliver?","spans":[]}},{"type":"paragraph","content":{"text":"Business deliveries are done between the hours of 9 am to 5 pm. Residential deliveries are done as late as 7 pm.","spans":[]}},{"type":"paragraph","content":{"text":"How long does it usually take to deliver an international package with Canpar Express?","spans":[]}},{"type":"paragraph","content":{"text":"Canpar Express does not deliver internationally. However, local packages are usually delivered between 1 to 2 days. ","spans":[]}},{"type":"heading3","content":{"text":"How long will Canpar Express hold a package?","spans":[]}},{"type":"paragraph","content":{"text":"If you miss the delivery of your package, packages are available for pickup after 12 pm on the following business day and will be held for a maximum of 5 business days.","spans":[]}},{"type":"heading3","content":{"text":"How to sign for a Canpar Express package?","spans":[]}},{"type":"paragraph","content":{"text":"If you are unable to sign for a package when it is delivered and would like to have it left somewhere on the property, you will need to leave a note for the driver indicating where you would like your package left. This note will need to be signed and placed on the outside of your front door for the driver to collect it. ","spans":[]}},{"type":"paragraph","content":{"text":"Please note that some packages require a signature in person and you will not be able to leave a signed note. ","spans":[]}},{"type":"heading3","content":{"text":"How to track a Canpar Express package with Circuit?","spans":[]}},{"type":"paragraph","content":{"text":"There are different types of numbers you may receive that you can use to track the status of your package by entering them into the Circuit Package Tracker tool.","spans":[]}},{"type":"paragraph","content":{"text":"The tracking number is given to you by the shipper. This number begins with a D, S, L, K, C, U, Z, or X and is followed by 8 – 20 numeric digits.","spans":[]}},{"type":"paragraph","content":{"text":"The return tag number on your return label starts with an R and is followed by 8 numeric digits.","spans":[]}},{"type":"paragraph","content":{"text":"The Pick-Up Tag number starts with a P and is followed by 9 numeric digits.","spans":[]}},{"type":"paragraph","content":{"text":"The delivery notice number is located under the barcode on your delivery notice. This number begins with a W and is followed by 8 or 9 numeric digits.","spans":[]}},{"type":"heading3","content":{"text":"What do I do if I haven't received my package from Canpar Express?","spans":[]}},{"type":"paragraph","content":{"text":"You should track your package by using the tracking number to determine its location. If there is no update available you can contact the company via their contact page. Providing them with the tracking number would be helpful. ","spans":[]}},{"type":"paragraph","content":{"text":"If there was an unsuccessful delivery attempt the package is placed on hold for customer pick up at a convenient location in your area. You will be informed of this location","spans":[]}},{"type":"heading3","content":{"text":"What happens if Canpar Express loses my package?","spans":[]}},{"type":"paragraph","content":{"text":"You must contact Canpar to let them know if your package is lost so that you can get help. ","spans":[{"start":9,"end":23,"type":"hyperlink","data":{"preview":{"title":"https://www.canpar.com/en/contact/contact_us.htm"},"url":"https://www.canpar.com/en/contact/contact_us.htm"}}]}},{"type":"heading3","content":{"text":"What happens if I miss my Canpar Express delivery?","spans":[]}},{"type":"paragraph","content":{"text":"If you miss your delivery and a notice was left. You can find information on the pickup time for the package from their website. Packages are available for pickup after 12 pm on the following business day and will be held at a SMARTSpot for a maximum of 5 business days. ","spans":[{"start":57,"end":127,"type":"hyperlink","data":{"preview":{"title":"https://www.canpar.com/en/support/faqs.htm"},"url":"https://www.canpar.com/en/support/faqs.htm"}}]}},{"type":"paragraph","content":{"text":"You will be informed of the SMARTSpot's address once the package has been dropped off at the location.","spans":[]}},{"type":"paragraph","content":{"text":"Residential deliveries only include one delivery attempt; however, alternate arrangements can be made by contacting Canpar's customer service team.","spans":[]}},{"type":"heading3","content":{"text":"What time will my Canpar Express package arrive?","spans":[]}},{"type":"paragraph","content":{"text":"You can view the estimated delivery date by entering the tracking number into Circuit’s tracker tool. If there is a “with carrier” status on the package, the delivery will be attempted between the hours of 9 am to 6 pm on that day.","spans":[]}},{"type":"heading3","content":{"text":"Where is my Canpar Express package?","spans":[]}},{"type":"paragraph","content":{"text":"To view the location of your package enter the tracking number into the \"track my package\" box on the Circuit website.","spans":[]}},{"type":"heading3","content":{"text":"Where is my Canpar Express tracking number?","spans":[]}},{"type":"paragraph","content":{"text":"You can find your tracking number in the link given in your order by your shipper. This number begins with a D, S, L, K, C, U, Z, or X and is followed by 8 – 20 numeric digits.","spans":[]}},{"type":"heading3","content":{"text":"Why is my Canpar Express package not moving?","spans":[]}},{"type":"paragraph","content":{"text":"Your package may appear to be not moving because it is in transit. When a package is travelling from the origin terminal to the destination terminal, it is considered to be \"in transit\" and no additional scanning can take place; however, as soon as it arrives at the destination terminal, tracking is updated with an arrival scan. Transit time varies based on the origin and destination; however, the estimated delivery date is available through the Circuit Package Tracker tool.","spans":[]}},{"type":"paragraph","content":{"text":"If your package has not been moving for more than a day and you believe there is an issue with your package you should contact Canpar Express.","spans":[]}},{"type":"heading3","content":{"text":"Why is my Canpar Express package pending?","spans":[]}},{"type":"paragraph","content":{"text":"When your package is labelled as \"pending\", this means the packages are scheduled to be processed later, or the shipper has created a label but has not yet given the item to Canpar Express for transport. When your package is pending you can continue to check on its status via Circuit. Once it has been processed the status will be updated, and you can then track the location of your package. If tracking results are still not available within 24 hours of receiving your tracking number, reach out to the shipper for further assistance.","spans":[]}},{"type":"paragraph","content":{"text":"If you’re sending or waiting for a package with Canpar Express and you want to know exactly where it is, try Circuit Package Tracker for free.","spans":[{"start":0,"end":142,"type":"em"},{"start":105,"end":141,"type":"strong"},{"start":105,"end":141,"type":"hyperlink","data":{"url":"https://getcircuit.com/package-tracker"}}]}}],"type":"package_tracker_carriers","tags":[],"lang":"en-us","grouplang":"YNDk6REAABEKGeVf"}