{"slug":"posten","carrier_id":"Posten","carrier_title":"Posten","uk_english":false,"description":[{"type":"paragraph","content":{"text":"Posten is a Norwegian mail and small package delivery service that offers same-day delivery in certain urban areas of Norway. Posten operates a self-service parcel pickup that lets you decide when to pick up your packages and offers delivery at your door or in your home, assist you with address changes and any other mail-related services in Norway. Visit posten.no for more information about Posten.","spans":[{"start":357,"end":366,"type":"hyperlink","data":{"url":"http://posten.no"}}]}},{"type":"paragraph","content":{"text":" Posten delivers mail and small packages as well as pick up returns from your mailbox as long as the postage is prepaid and the parcel fits their requirements. If the parcel is too large, please go to any Posten location for assistance. Posten also delivers online purchases in as little as two hours in certain areas. Please visit posten.no/en/sending/packages for more information.","spans":[{"start":332,"end":361,"type":"hyperlink","data":{"url":"http://posten.no/en/sending/packages"}}]}},{"type":"paragraph","content":{"text":"Posten is a postal system servicing Norway. They mostly deliver in the consumer market of Norway but they offer international shipping all over the world,  as long as all of the customs documents are included and nothing hazardous is shipped. Visit posten.no/sending/packages/overseas/send-packages-overseas for more information about customs and prohibited items.","spans":[{"start":249,"end":307,"type":"hyperlink","data":{"url":"http://posten.no/sending/packages/oversea"}}]}},{"type":"paragraph","content":{"text":"If you’re sending or waiting for a package with Posten and you want to know exactly where it is, try Circuit Package Tracker for free.","spans":[{"start":0,"end":134,"type":"em"},{"start":97,"end":133,"type":"strong"},{"start":97,"end":133,"type":"hyperlink","data":{"url":"https://getcircuit.com/package-tracker"}}]}},{"type":"heading2","content":{"text":"Frequently Asked Questions","spans":[]}},{"type":"heading3","content":{"text":"Can I track a Posten package without a tracking number?","spans":[]}},{"type":"paragraph","content":{"text":"Posten needs to have a tracking number sent via SMS or email or you will get notified by Norway Post. Posten also has a chatbot that could help answer your questions. If you do not receive a tracking number, please contact the sender of the package to answer questions about your tracking number.  For any further questions about tracking visit posten.no/en/tracking-help-page.","spans":[{"start":345,"end":376,"type":"hyperlink","data":{"url":"http://posten.no/en/tracking-help-page"}}]}},{"type":"heading3","content":{"text":"Does Circuit offer better tracking than Posten?","spans":[]}},{"type":"paragraph","content":{"text":"Circuit package tracker tracks by tracking number like with the Posten tracking system, the advantage though has to go to Circuit package tracker. Not only can you track a package from Posten, with Circuit package tracker, but you can also see packages from other shipping companies. We show you where your package has been through every step of the way and show you its location. Posten has four different tracking sites for different types of packages, while Circuit package tracker can track all types of packages on just on site. Visit the Postens tracking help page to check which way is best to track your shipment.","spans":[{"start":544,"end":551,"type":"hyperlink","data":{"url":"http://posten.no/en/tracking-help-page"}}]}},{"type":"heading3","content":{"text":"How late does Posten deliver?","spans":[]}},{"type":"paragraph","content":{"text":"Posten delivers normally between 8 am and 5 pm but pickup at one of their red mailboxes is available 24/7. Visit posten.no/en/receive/home-delivery for more information on shipping times and evening shipping arrangements with Posten. Use the Circuit package tracker to see where your package is at in the delivery process to make sure you are available to accept the package when it is being delivered instead of not knowing where your package is at and missing the delivery.","spans":[{"start":113,"end":147,"type":"hyperlink","data":{"url":"http://posten.no/en/receive/home-delivery"}}]}},{"type":"heading3","content":{"text":"How long does it usually take to deliver an international package with Posten?","spans":[]}},{"type":"paragraph","content":{"text":"Sending a package or a letter internationally with Posten is easy! Delivery times vary according to where in the world the package is being shipped. If the package or letter is under 2kg (approx. 4.4lbs.), the item is considered a letter and has different regulations than packages bigger than 2g. When shipping an item internationally make sure to have all of the necessary customs paperwork to avoid any unnecessary delays. Below is the shipping chart per country.","spans":[]}},{"type":"list-item","content":{"text":"Nordic Countries 0-4 days","spans":[]}},{"type":"list-item","content":{"text":"Europe: 4-14 days ","spans":[]}},{"type":"list-item","content":{"text":"United States: 9-27 days","spans":[]}},{"type":"list-item","content":{"text":"Rest of the world: 7- 20 days","spans":[]}},{"type":"paragraph","content":{"text":"Keep in mind, that Posten can’t guarantee a stated delivery time. Here are Posten's international shipping times, regulations, and price chart for letters. For packages larger than 2kg (4.4 lbs), go here For information about shipping regulations and costs.","spans":[{"start":75,"end":154,"type":"hyperlink","data":{"preview":{"title":"http://posten.no/en/sending/letters/international"},"url":"http://posten.no/en/sending/letters/international"}},{"start":199,"end":203,"type":"hyperlink","data":{"url":"http://posten.no/en/sending/packages/overseas/send-packages-overseas"}}]}},{"type":"heading3","content":{"text":"How long will Posten hold a package?","spans":[]}},{"type":"paragraph","content":{"text":"The Posten post office can only hold packages for 14 days. If you need additional time, Posten can safeguard your packages and provides storage for your packages for 15 days for NOK 165. If you need additional time to pick up your package Posten will charge an additional NOK 27. Visit posten.no/en/address-services/safekeeping for information on having your packages held by Posten and rates for holding packages. ","spans":[{"start":286,"end":327,"type":"hyperlink","data":{"url":"http://posten.no/en/address-services"}}]}},{"type":"heading3","content":{"text":"How to sign for a Posten package?","spans":[]}},{"type":"paragraph","content":{"text":"You will receive an SMS or notification by Posten through their app when your package is ready. You must have an ID to receive a registered letter or a shipment of value. You also need to show ID when picking up a package at a Posten location. When picking up a parcel at one of the many red parcel boxes, download the Posten app and sign up for notifications and retrieval codes to make your package pickup easy and secure.","spans":[]}},{"type":"paragraph","content":{"text":"If you have to pick up a package at a Posten location, you must have on hand one of these forms of ID to pick up a package:","spans":[{"start":38,"end":44,"type":"hyperlink","data":{"url":"http://posten.no/en/map"}}]}},{"type":"list-item","content":{"text":"Norwegian Bank Card","spans":[]}},{"type":"list-item","content":{"text":"Norwegian DL issued after 1998.","spans":[]}},{"type":"list-item","content":{"text":"Norwegian Passport","spans":[]}},{"type":"list-item","content":{"text":"Norwegian immigration passport and travel document","spans":[]}},{"type":"list-item","content":{"text":"Foreign passports","spans":[]}},{"type":"list-item","content":{"text":"National ID cards","spans":[]}},{"type":"list-item","content":{"text":"European Identity cards","spans":[]}},{"type":"paragraph","content":{"text":"Visit posten.no/en/receive/pick-up-yourself for more pick up instructions and ID requirements.","spans":[{"start":6,"end":43,"type":"hyperlink","data":{"url":"http://posten.no/en/receive/pick-up-yourself"}}]}},{"type":"heading3","content":{"text":"How to track a Posten package with Circuit package tracker?","spans":[]}},{"type":"paragraph","content":{"text":"To track a Posten package with Circuit package tracker just enter the tracking number that was issued by SMS or email and Circuit package tracker will show you where it is anywhere in the world in seconds. Circuit package tracker is a service available to you for no charge. Circuit package tracker also shows you what stage your package is at as well as the location of your package. ","spans":[]}},{"type":"heading3","content":{"text":"What to do if I haven’t received the package from Posten?","spans":[]}},{"type":"paragraph","content":{"text":"If you haven’t received the package from Posten, contact them directly with your tracking number and/or details of your package. If you need help with tracking your package visit posten.no/en/tracking-help-page for help with a missing Posten delivery.","spans":[{"start":179,"end":210,"type":"hyperlink","data":{"url":"http://posten.no/en/tracking-help-page"}}]}},{"type":"heading3","content":{"text":"What happens if Posten loses my package?","spans":[]}},{"type":"paragraph","content":{"text":"Posten is liable for damages to any registered item that is lost or damaged. Unfortunately, if the package is not registered with Posten, they hold no liability for damages or loss. Click here to go to the Posten general terms and conditions of delivery for postal services.","spans":[{"start":188,"end":192,"type":"hyperlink","data":{"url":"http://posten.no/en/terms-and-conditions/general-terms-of-delivery"}}]}},{"type":"heading3","content":{"text":"What happens if I miss my Posten delivery?","spans":[]}},{"type":"paragraph","content":{"text":"No worries! Posten has lots of different delivery methods to suit your needs. Some online deliveries can be made in two hours in certain urban areas. You can also have your package redirected to a Posten location near you. Posten also has red mailboxes throughout Norway for your package pickup needs. You can choose where and when you can have your package delivered or contact Posten to have your delivery redirected. ","spans":[]}},{"type":"heading3","content":{"text":"What time will my Posten package arrive?","spans":[]}},{"type":"paragraph","content":{"text":"Posten delivers between 8 am and 5 pm. Posten also offers delivery for redirected packages from 5 pm-9 pm. To check delivery times and procedures for delivery visit posten.no/en/receive/home-delivery for more detailed directions.","spans":[]}},{"type":"heading3","content":{"text":"Where is my Posten package?","spans":[]}},{"type":"paragraph","content":{"text":"First, make sure that the package was sent through Posten and which method it was shipped. If you still cannot find information on your package visit posten.no/en/tracking-help-page for help tracking your Posten package. If the package was shipped through Posten, remember that Posten only updates their shipping when a package reaches one of their terminals which can take 1-4 days depending on where the packages were sent from.","spans":[{"start":150,"end":181,"type":"hyperlink","data":{"url":"http://posten.no/en/tracking-help-page"}}]}},{"type":"heading3","content":{"text":"Where is my Posten tracking number?","spans":[]}},{"type":"paragraph","content":{"text":"You will receive the tracking number for your Posten package from the supplier or sender of your package through SMS or email. Your tracking number may consist of 13 characters and the entire number or characters must be inputted to track the shipment. If you have not received a tracking number, please contact the sender for a tracking number and if it was sent through Posten or a different shipping company. ","spans":[]}},{"type":"heading3","content":{"text":"Why is my Posten package not moving?","spans":[]}},{"type":"paragraph","content":{"text":"Posten does not scan packages between terminals so there is no tracking available and some distances take 1-4 days depending on the way it is shipped. The tracking is updated as soon as the package arrives at the next terminal on its journey with Posten. Visit posten.no/en/tracking-help-page for answers to any questions or concerns you might have about your package and why it has not been updated. Circuit package tracker can offer you peace of mind by being with you through the shipping process every step of the way and keeping you updated with the latest on your shipments all on one page or on our app.","spans":[{"start":261,"end":292,"type":"hyperlink","data":{"url":"http://posten.no/en/tracking-help-page"}}]}},{"type":"heading3","content":{"text":"Why is my Posten package pending?","spans":[]}},{"type":"paragraph","content":{"text":"Packages by Posten are not tracked in between terminals. If the package is shipped internationally it has to be cleared by customs first before it can be shipping can be completed. This is can take anywhere from 1-4 days depending on where the items were shipped or if it has problems clearing customs. Rest assured that Circuit package tracker will keep you up to date on the latest progress in shipping and receiving your packages.","spans":[]}},{"type":"paragraph","content":{"text":"If you’re sending or waiting for a package with Posten and you want to know exactly where it is,try Circuit Package Tracker for free.","spans":[{"start":0,"end":133,"type":"em"},{"start":96,"end":132,"type":"strong"},{"start":96,"end":132,"type":"hyperlink","data":{"url":"https://getcircuit.com/package-tracker"}}]}}],"type":"package_tracker_carriers","tags":[],"lang":"en-us","grouplang":"YNDk5REAABEKGeVB"}