{"slug":"ukrposhta","carrier_id":"Ukrposhta","carrier_title":"Ukrposhta","uk_english":false,"description":[{"type":"paragraph","content":{"text":"Ukraine became a member of the Universal Postal Union and Soviet Post in 1947, making the official founding year of Ukraine’s postal service the same year. However, Ukraine did not have a postal service separate from the rest of the Soviet Union until 1991 and Ukrposhta did not exist in its current form until 1994. Since the fall of the Soviet Union, Ukrposhta has grown to handle all of Ukraine’s postal needs and ship to over 200 countries. They ship everything from personal packages to commercial packages both domestically and internationally.","spans":[{"start":261,"end":270,"type":"hyperlink","data":{"url":"https://www.ukrposhta.ua/en"}}]}},{"type":"heading2","content":{"text":"Frequently Asked Questions","spans":[]}},{"type":"heading3","content":{"text":"Can I Track a Ukrposhta Package Without a Tracking Number?","spans":[]}},{"type":"paragraph","content":{"text":"You do need a tracking number to track your Ukrposhta package, however, there are a few places your tracking number may be. Most merchants or online storefronts send an order confirmation email containing the tracking information, other times they will send an SMS to your mobile device with your tracking information. If you have an online account with the merchant or online storefront you ordered from, your tracking information may be in your recent purchase history.","spans":[]}},{"type":"paragraph","content":{"text":"If you cannot find your tracking information in any of these areas, contact your merchant or online storefront for more information regarding your package.","spans":[]}},{"type":"heading3","content":{"text":"Does Circuit Offer Better Tracking Than Ukrposhta?","spans":[]}},{"type":"paragraph","content":{"text":"Circuit understands how important knowing your package is safe is and knowing your package’s whereabouts is a big part of that. That is why we make it as easy as possible for you to track your package just using your tracking number and the Circuit Package Tracker, no need to even know the courier transporting your package. We also offer an app for your mobile device you can find in your app store, called the Circuit Package Tracker, so you can track your package on the go from anywhere at any time.","spans":[{"start":241,"end":264,"type":"hyperlink","data":{"url":"https://getcircuit.com/package-tracker"}}]}},{"type":"heading3","content":{"text":"How Late Does Ukrposhta Deliver?","spans":[]}},{"type":"paragraph","content":{"text":"Ukrposhta delivery times in Ukraine vary by region and whether or not you live in a village versus living in the city. Outside of Ukraine, delivery times depend on your local courier as Ukrposhta only sees your package through customs before passing it off to your local postal service.","spans":[]}},{"type":"heading3","content":{"text":"How Long Does It Usually Take to Deliver an International Package with Ukrposhta?","spans":[]}},{"type":"paragraph","content":{"text":"International shipping times from Ukraine depend on the mode of transport being used to transport your package. For packages traveling by air, packages may take between 14 to 20 working days before arriving. Packages traveling by ship or road may take 25 to 30 working days to arrive. Working days are defined by Ukrposhta are weekdays that do not fall on a national holiday, but times may also be delayed by weather conditions, operational backlogs, or customs.","spans":[]}},{"type":"heading3","content":{"text":"How Long Will Ukrposhta Hold a Package?","spans":[]}},{"type":"paragraph","content":{"text":"The amount of time Ukrposhta will hold your package will depend on the type of package and the amount of space available in the post office for holding, so it is best to call your local Ukrposhta post office for more information. They do charge a fee to ship the package back to the sender if you are unable to pick the package up or they are unable to deliver the package. If you are shipping the package internationally, holding times and return to sender fees will depend on your local courier.","spans":[]}},{"type":"heading3","content":{"text":"How Do I Sign for a Ukrposhta Package?","spans":[]}},{"type":"paragraph","content":{"text":"Packages that are high value, contain sensitive information, or have extra insurance may require a signature before being released by the courier. Signatures add an extra layer of security on packages and keep track of who received the package, in case of a loss or damage report. In the case your package requires a signature, your courier’s delivery driver will have a tablet for you to sign electronically on with a tablet pen.","spans":[]}},{"type":"heading3","content":{"text":"How Do I Track a Package with Circuit?","spans":[]}},{"type":"paragraph","content":{"text":"To track your package with Circuit, you only need your tracking information from the merchant or online storefront. You do not even need to know the exact courier carrying your package, Circuit will still be able to find your package anywhere in the world at any time. Enter your tracking number in the white box on the Circuit Package Tracker page and let Circuit do the rest for you. You can do the same on the Circuit Package Tracker app available in your mobile device’s app store for easy on-the-go tracking.","spans":[]}},{"type":"heading3","content":{"text":"What Do I Do If I Have Not Received My Package from Ukrposhta?","spans":[]}},{"type":"paragraph","content":{"text":"If your package has not arrived by the estimated arrival date, enter your tracking number into Circuit Package Tracker to see if your package is still traveling or shows as delivered. If your package is still traveling towards you, it may have been delayed by anything from national holidays in its current location to weather events to operational backlogs. However, if your order appears as still traveling for longer than expected, you can contact Ukrposhta for specific answers.","spans":[{"start":443,"end":460,"type":"hyperlink","data":{"url":"https://www.ukrposhta.ua/en/kontakt-tsentr"}}]}},{"type":"paragraph","content":{"text":"If your package appears as arrived, but you have not received your package, check to see if it had a sign for service requested. It may be that your package was brought to your nearest local courier’s postal office for pick up.","spans":[]}},{"type":"heading3","content":{"text":"What Happens if Ukrposhta Loses My Package?","spans":[]}},{"type":"paragraph","content":{"text":"If your package does not arrive, use the Circuit Package Tracker to see where your package was last reported. If it was outside the country when it was last seen, your package falls under Ukrposhta’s liability and you will have to file an online loss or damage claim with Ukrposhta to see how to move forward or if they can simply find your package for you. If your package was last in its destination country, the liability falls on your local courier, as Ukrposhta only sees your package through customs once it reaches its destination country.","spans":[{"start":239,"end":266,"type":"hyperlink","data":{"url":"https://www.ukrposhta.ua/en/rozshuk-mrpv"}}]}},{"type":"heading3","content":{"text":"What Happens if I Miss My Ukrposhta Delivery?","spans":[]}},{"type":"paragraph","content":{"text":"If you are not home when Ukrposhta delivers your package, they will simply leave it on your door stoop. If your package required a signature before being released, Ukrposhta will return your package to their nearest post office for you to pick up. However, this only applies to domestic mail in Ukraine, if shipping your package internationally, what happens to your package if you miss the delivery time depends on the local courier your area uses.","spans":[]}},{"type":"paragraph","content":{"text":"What Time Will My Ukrposhta Package Arrive?","spans":[]}},{"type":"paragraph","content":{"text":"Domestically, delivery times vary by region and where your address is located, such as living in a city versus living in a rural village. Internationally, the time your package arrives depends on where you are on your local courier’s delivery driver’s route. Delivery times can be delayed by weather, traffic, or other causes outside of your delivery driver’s control.","spans":[]}},{"type":"heading3","content":{"text":"Where Is My Ukrposhta Package?","spans":[]}},{"type":"paragraph","content":{"text":"You can find your Ukrposhta package by entering your tracking number into the Circuit Package Tracker or by using the Circuit Package Tracker app in your mobile phone’s app store. If your package is pending, it likely just has not been picked up for shipment by Ukrposhta from the merchant or online storefront. If your package says it is still shipping and it is past the expected arrival date, your package was likely delayed by weather, national holidays, operational backlogs, or customs as it was entering the destination country.","spans":[]}},{"type":"heading3","content":{"text":"Where Is My Ukrposhta Package Tracking Number?","spans":[]}},{"type":"paragraph","content":{"text":"Your Ukrposhta package tracking number might be in a few different places. In some cases, if you ordered inside a physical storefront, the tracking information might be on your receipt from the purchase. Nowadays, however, most merchants and online storefronts prefer to send you a confirmation email with the tracking information or an SMS on your mobile device. If you had an online account with the merchant or online storefront, check your recent purchase history for your tracking information.","spans":[]}},{"type":"heading3","content":{"text":"Why Is My Ukrposhta Package Not Moving?","spans":[]}},{"type":"paragraph","content":{"text":"Many couriers use milestone tracking for packages shipping internationally or over long distances. This means your package may appear as still being over the ocean or in one country for a long period, even if your package is actively moving towards you. Packages can also be delayed by national holidays in their current location, weekends, weather delays, operational backlogs, and customs. If your package appears to be stuck in one location in Ukraine or outside of its destination country for a long period you can contact Ukrposhta for more information. However, if your package had reached its destination country you will have to contact your local courier to find your package.","spans":[]}},{"type":"heading3","content":{"text":"Why Is My Ukrposhta Package Pending?","spans":[]}},{"type":"paragraph","content":{"text":"Packages that appear as pending are waiting to either be picked up by Ukrposhta or are waiting to be scanned onto the ship, plane, or truck, that will take your package to you. Pending times may be longer if you ordered on a weekend, national holiday in the country of origin, or during a busy shipping season like the winter holidays. If your package appears as pending for longer than necessary, contact your merchant or online storefront to see if your package had been picked up by Ukrposhta. If it had, contact Ukrposhta to locate the whereabouts of your package.","spans":[{"start":508,"end":525,"type":"hyperlink","data":{"url":"https://www.ukrposhta.ua/en/kontakt-tsentr"}}]}},{"type":"paragraph","content":{"text":"If you’re sending or waiting for a package with Ukrposhta and you want to know exactly where it is, try Circuit Package Tracker for free.","spans":[{"start":0,"end":48,"type":"em"},{"start":57,"end":137,"type":"em"},{"start":100,"end":136,"type":"strong"},{"start":100,"end":136,"type":"hyperlink","data":{"url":"https://getcircuit.com/package-tracker"}}]}}],"type":"package_tracker_carriers","tags":[],"lang":"en-us","grouplang":"YNDk5xEAABEKGeVN"}