{"slug":"estes","carrier_id":"Estes","carrier_title":"Estes","uk_english":false,"description":[{"type":"heading1","content":{"text":"Estes Package Tracking","spans":[]}},{"type":"paragraph","content":{"text":"Use Circuit Package Tracker to locate your delivery with Estes. Know when your packages are arriving.","spans":[]}},{"type":"paragraph","content":{"text":"Estes has a mission statement of providing responsive freight solutions in the transport and delivery industry. The company was founded by W.W. Estes and has been in operation since 1931. They are a privately-owned freight shipping company in North America known for their competitive pay and employee benefits. The company provides asset-based and brokered freight solutions for regional, national, international, and offshore delivery destinations in the North American region.  ","spans":[]}},{"type":"paragraph","content":{"text":"Estes provides time-critical shipping solutions as an asset-based freight transportation and custom logistics solutions provider. They are America’s largest privately held freight carrier with U.S. national and international networks of terminals to connect the U.S. including Alaska and Hawaii with Canada, Mexico, and the Caribbean. As an international, cross-border freight-forwarding company, Estes handles typical and custom shipping needs:","spans":[]}},{"type":"heading3","content":{"text":"Custom Shipping and Logistics Solutions","spans":[]}},{"type":"paragraph","content":{"text":"Estes provides expert leaders to design and execute end-to-end shipping and deliveries from standard to complex requirements including hazmat. Residential and commercial non-dock delivery solutions such as:","spans":[]}},{"type":"list-item","content":{"text":"Dedicated Delivery","spans":[]}},{"type":"list-item","content":{"text":"Flatbed and Truckload","spans":[]}},{"type":"list-item","content":{"text":"Warehousing","spans":[]}},{"type":"list-item","content":{"text":"Supply Chain Management","spans":[]}},{"type":"list-item","content":{"text":"Pick and Pack","spans":[]}},{"type":"paragraph","content":{"text":"If you’re sending or waiting for a package with Estes and you want to know exactly where it is,try Circuit Package Tracker for free.","spans":[{"start":0,"end":48,"type":"em"},{"start":54,"end":132,"type":"em"},{"start":95,"end":131,"type":"strong"},{"start":95,"end":131,"type":"hyperlink","data":{"url":"https://getcircuit.com/package-tracker"}}]}},{"type":"heading3","content":{"text":"What does Estes Express Lines deliver?","spans":[]}},{"type":"paragraph","content":{"text":"Estes delivers products within the commercial industries and directly to consumers in residential areas—including consumer-to-consumer deliveries through their Final Mile Home Delivery service. Sellers and wholesale distributors can arrange shipments to scale through Estes:","spans":[{"start":160,"end":184,"type":"hyperlink","data":{"url":"https://www.estes-express.com/solutions/final-mile/"}}]}},{"type":"heading4","content":{"text":"Less than Loads (LTL) ","spans":[]}},{"type":"paragraph","content":{"text":"Transportation of products and goods that are less than a full truckload. LTL shipments are typically pallets or individual consumer items where the total will be less than 10,000 pounds.","spans":[]}},{"type":"heading4","content":{"text":"Volume and Truckload (V/TL)","spans":[]}},{"type":"paragraph","content":{"text":"V/TL is ideal for larger shipments. Large shipments are those that total over 10,000 pounds or when a seller requires the extra handling of volume during any peak selling period.","spans":[]}},{"type":"heading3","content":{"text":"Where in the world does Estes Express Lines deliver?","spans":[]}},{"type":"paragraph","content":{"text":"Estes delivers to and from all 50 U.S. states—including most places in Alaska and Hawaii. They also deliver to and from Canada, Mexico, and the Caribbean Islands: Antigua, Aruba, Bahamas (Freeport and Nassau), Barbados, Curacao, Dominica, Dominica Republic, Grand Cayman, Grenada, Guadeloupe, Jamaica (Kingston and Montego Bay), Martinique, Puerto Rico, St. Kitts, St. Lucia, St. Martin, St. Vincent, Trinidad, and the Us. Virgin Islands (St. Croix and St. Thomas).","spans":[]}},{"type":"paragraph","content":{"text":"Estes offers modern accommodation with their own equipment to dock and undock loads to shipping ports, and warehouses so that the buyer does not necessarily have to have their own equipment to accept large loads","spans":[]}},{"type":"paragraph","content":{"text":"Speciality Residential Delivery:","spans":[]}},{"type":"list-item","content":{"text":"Entryway Delivery","spans":[]}},{"type":"list-item","content":{"text":"Through the front door into a foyer or first available similar area","spans":[]}},{"type":"list-item","content":{"text":"White-Glove Delivery","spans":[]}},{"type":"list-item","content":{"text":"Placement in room or area of choice up to one flight of stairs and debris removal upon request","spans":[]}},{"type":"list-item","content":{"text":"White-Glove with Assembly","spans":[]}},{"type":"paragraph","content":{"text":"In addition to placement in an area of choice, includes light assembly of a product","spans":[]}},{"type":"heading2","content":{"text":"Frequently Asked Questions","spans":[]}},{"type":"paragraph","content":{"text":"The following are frequently asked questions about Estes-Express Lines and include information about how Circuit Package Tracking works with Estes.","spans":[]}},{"type":"paragraph","content":{"text":"Can I track an Estes package without a tracking number?","spans":[]}},{"type":"paragraph","content":{"text":"Circuit Package Tracker uses the tracking number provided by Estes to give you an update on your package at every phase. Directly access our package tracker to plan for the arrival of your package so that you can plan your day.","spans":[{"start":141,"end":156,"type":"hyperlink","data":{"url":"https://getcircuit.com/package-tracker"}}]}},{"type":"paragraph","content":{"text":"You can also check on your delivery through Estes using the following alternatives to the tracking number:","spans":[{"start":36,"end":49,"type":"hyperlink","data":{"url":"https://www.estes-express.com/myestes/shipment-tracking/"}}]}},{"type":"list-item","content":{"text":"PRO Number","spans":[]}},{"type":"list-item","content":{"text":"Bill of Lading Number","spans":[]}},{"type":"list-item","content":{"text":"Pickup Request Number","spans":[]}},{"type":"list-item","content":{"text":"Purchase Order Number","spans":[]}},{"type":"list-item","content":{"text":"Interline PRO Number","spans":[]}},{"type":"list-item","content":{"text":"Load Order Number","spans":[]}},{"type":"list-item","content":{"text":"Optional EXLA-ID Number","spans":[]}},{"type":"heading3","content":{"text":"Does Circuit offer better tracking than Estes?","spans":[]}},{"type":"paragraph","content":{"text":"Circuit Package Tracking provides you a direct update on the status of your package. Circuit works with Estes, not instead of Estes.","spans":[{"start":0,"end":24,"type":"hyperlink","data":{"url":"https://getcircuit.com/package-tracker"}}]}},{"type":"paragraph","content":{"text":"We work with couriers worldwide to provide consumers with access to the tracking portions of our integrated logistics and supply chain management system. As the applications are exchanging information, customers can monitor the movement of their items to help inform their personal schedules in preparation for receiving deliveries.","spans":[]}},{"type":"heading3","content":{"text":"How late does Estes deliver?","spans":[]}},{"type":"paragraph","content":{"text":"Times will vary based on the type of delivery service arranged. You can arrange for a specific delivery time with Estes to receive a guaranteed appointment time of 5pm or an earlier available slot. The Guaranteed program offered by Estes does not apply to delivery orders that require protection from freezes accommodations.","spans":[]}},{"type":"heading3","content":{"text":"How long does it usually take to deliver an international package with Estes?","spans":[]}},{"type":"paragraph","content":{"text":"The time that it takes to deliver international packages with Estes usually falls within a range of 4 to 7 days. When placing your delivery order, keep in mind that several factors, such as seasonal demands and holidays, may alter or impact the length of time it takes to deliver a package.","spans":[]}},{"type":"paragraph","content":{"text":"To estimate the transit time between any two points between the U.S., Canada, and Mexico—enter both the origin and destination country’s city, state and zip code in their Transit Time Calculator. If time is a critical issue for your delivery, Estes offers their customers the option to deliver through their Time Critical Guarantee service.","spans":[{"start":171,"end":194,"type":"hyperlink","data":{"url":"https://www.estes-express.com/myestes/transit-time-calculator/"}}]}},{"type":"heading3","content":{"text":"How long will Estes hold a package?","spans":[]}},{"type":"paragraph","content":{"text":"Schedule your pickup with Estes by placing your request through your My Estes account. Click here to be taken directly to your pickup-request page after you complete login.","spans":[{"start":87,"end":97,"type":"hyperlink","data":{"url":"https://www.estes-express.com/myestes/pickup-request/login"}}]}},{"type":"paragraph","content":{"text":"How to sign for an Estes package","spans":[]}},{"type":"paragraph","content":{"text":"Estes will have you sign a release upon arrival. You may also choose to schedule an unattended delivery. You must be present for deliveries that are arranged with White Glove services.","spans":[]}},{"type":"heading3","content":{"text":"How to track an Estes package with Circuit","spans":[]}},{"type":"paragraph","content":{"text":"Use our Circuit Package Tracker by entering the tracking code, selecting your carrier, and hit “Track my package.”","spans":[{"start":8,"end":31,"type":"hyperlink","data":{"url":"https://getcircuit.com/package-tracker"}}]}},{"type":"paragraph","content":{"text":"What do I do if I haven't received my package from Estes?","spans":[]}},{"type":"paragraph","content":{"text":"If you have not received your package within the estimated time range that you were given, you can look up your nearest terminal here or contact Estes Customer Care at (866) 378-3748 ext. 2030.","spans":[{"start":129,"end":133,"type":"hyperlink","data":{"url":"https://www.estes-express.com/myestes/terminal-lookup/?abbr=full#terminals"}}]}},{"type":"heading3","content":{"text":"What happens if Estes loses my package?","spans":[]}},{"type":"paragraph","content":{"text":"File a claim for lost freight through your My Estes account to fill out a form online through the claims page. You can also directly download the form and fax to 804-232-1407 or mail.","spans":[{"start":98,"end":109,"type":"hyperlink","data":{"url":"https://www.estes-express.com/myestes/claims/login"}},{"start":133,"end":150,"type":"hyperlink","data":{"url":"https://www.estes-express.com/dA/364208f7cb/EstesClaimsForm.pdf"}}]}},{"type":"paragraph","content":{"text":"If you’re filing a claim that has to do with an Estes Forwarding Worldwide (EFW) shipment, download your EFW claim form from the Claims Forms section under the DOMESTIC FORMS heading.  ","spans":[{"start":105,"end":119,"type":"hyperlink","data":{"url":"https://efwnow.com/services/resources/"}}]}},{"type":"heading3","content":{"text":"What happens if I miss my Estes delivery?","spans":[]}},{"type":"paragraph","content":{"text":"If your delivery required a signature, but you missed its arrival, then you’ll need to log in to your account or contact Customer Care to reschedule. Additional charges may apply for redelivery. You may be able to schedule a pickup from the Estes terminal where your package is being held.","spans":[]}},{"type":"paragraph","content":{"text":"What time will my Estes package arrive?","spans":[]}},{"type":"paragraph","content":{"text":"Discuss the delivery schedule with customer service when you request a quote to get the most up-to-date information. Hours of operation are usually 8am to 5pm Monday through Friday not including holidays which will impact your delivery schedule.  ","spans":[]}},{"type":"paragraph","content":{"text":"Dates of holidays that are observed will vary based on the country. Plan your delivery around national holidays by viewing the complete, international schedule of holiday dates observed by Estes.","spans":[{"start":137,"end":159,"type":"hyperlink","data":{"url":"https://www.estes-express.com/resources/holiday-schedule"}}]}},{"type":"heading3","content":{"text":"Where is my Estes package?","spans":[]}},{"type":"paragraph","content":{"text":"We provide you the Circuit Package Tracker as a direct way to quickly determine where your package is en route to its delivery destination so you can worry less and plan more.","spans":[]}},{"type":"paragraph","content":{"text":"Where is my Estes tracking number?","spans":[]}},{"type":"paragraph","content":{"text":"Your tracking number will have been provided to you by the company you purchased your goods from. You may check your records for receipt or contact the company directly to inquire about getting the tracking number for your Estes delivery.","spans":[]}},{"type":"heading3","content":{"text":"Why is my Estes package not moving?","spans":[]}},{"type":"paragraph","content":{"text":"If you have a Time-Critical Guaranteed delivery scheduled, you can contact their Customer Care line at (804) 359-9307 ext. 2269.","spans":[]}},{"type":"paragraph","content":{"text":"For all other issues, you can contact Customer Care. Before doing so consider that:","spans":[]}},{"type":"list-item","content":{"text":"You may just be observing a normal layover event","spans":[]}},{"type":"list-item","content":{"text":"For residential consumers with LTL deliveries, it is not uncommon for an LTL to have a layover","spans":[]}},{"type":"list-item","content":{"text":"Check that it is not a holiday, inclement weather, or other unforeseeable events that have caused a delay in your package’s movement.","spans":[]}},{"type":"paragraph","content":{"text":"If you are still concerned about the delay you observe with your package, you may also try contacting the terminal where your package is indicated as being held or the terminal where your package is expected to arrive.","spans":[]}},{"type":"paragraph","content":{"text":"Why is my Estes package pending?","spans":[]}},{"type":"paragraph","content":{"text":"You may see a notification that your package is pending because the seller has notified Estes to expect your package. However, your package has not yet been received by a terminal. It’s in the tracking system and being watched for, but has not yet been physically checked in.","spans":[]}},{"type":"paragraph","content":{"text":"This is normal as packages wait to come together in bundles with other packages from a seller or in-transit between terminals.","spans":[]}},{"type":"paragraph","content":{"text":"If you’re sending or waiting for a package with tEstes and you want to know exactly where it is, try Circuit Package Tracker for free.","spans":[{"start":0,"end":49,"type":"em"},{"start":54,"end":134,"type":"em"},{"start":97,"end":133,"type":"strong"},{"start":97,"end":133,"type":"hyperlink","data":{"url":"https://getcircuit.com/package-tracker"}}]}}],"type":"package_tracker_carriers","tags":[],"lang":"en-us","grouplang":"YNDk6REAABEKGeVg"}