{"slug":"colissimo","carrier_id":"Colissimo","carrier_title":"Colissimo","uk_english":false,"description":[{"type":"paragraph","content":{"text":"Colissimo is a french courier service, when you ship using this courier, it's easy to keep track of your packages by using the tracking feature. On the circuit package tracker website, you can follow the shipment of your packages and you no longer have to fear losing your package. ","spans":[]}},{"type":"heading3","content":{"text":"What is Colissimo?","spans":[]}},{"type":"paragraph","content":{"text":"Colissimo is the package delivery service for individuals from La Poste, the French postal company. It is the number one package delivery service in France. Colissimo is the official postal service in France and delivers to Europe, French overseas territories, and international countries. Colissimo offers ready-to-ship packaging and prepaid labels in addition to standard postage at counters, machines, and delivery of online purchases. ","spans":[{"start":0,"end":9,"type":"hyperlink","data":{"preview":{"title":"https://www.colissimo.entreprise.laposte.fr/fr/offre-colissimo-public"},"url":"https://www.colissimo.entreprise.laposte.fr/fr/offre-colissimo-public"}},{"start":63,"end":71,"type":"hyperlink","data":{"id":"YNDk4hEAAO0mGeSU","preview":{"title":"la-poste"},"wioUrl":"wio://documents/YNDk4hEAAO0mGeSU"}}]}},{"type":"paragraph","content":{"text":"The good thing about Colissimo is that they ship all over the world and offer home deliveries or local pick-up points in France. Local deliveries are done within two business days.","spans":[]}},{"type":"heading3","content":{"text":"What do they deliver?","spans":[]}},{"type":"paragraph","content":{"text":"Colissimo is a package delivery service suitable for deliveries to individuals. They deliver packages, letters, or express consignments. The maximum weight of packages delivered via Colissimo is 30 kg. ","spans":[]}},{"type":"paragraph","content":{"text":"Where in the world do they deliver?","spans":[]}},{"type":"paragraph","content":{"text":"They deliver locally in France, but also give an international delivery service to countries outside of France and Europe. International delivery will incur specific charges. ","spans":[]}},{"type":"paragraph","content":{"text":"If you’re sending or waiting for a package with Colissimo and you want to know exactly where it is,try Circuit Package Tracker for free.","spans":[{"start":0,"end":136,"type":"em"},{"start":99,"end":135,"type":"strong"},{"start":99,"end":135,"type":"hyperlink","data":{"url":"https://getcircuit.com/package-tracker"}}]}},{"type":"heading2","content":{"text":"Frequently asked questions","spans":[]}},{"type":"paragraph","content":{"text":"Can I track a Colissimo package without a tracking number?","spans":[]}},{"type":"paragraph","content":{"text":"No, you can not. You will need the tracking number given in order to track the package. ","spans":[]}},{"type":"paragraph","content":{"text":"Does Circuit offer better tracking than Colissimo?","spans":[]}},{"type":"paragraph","content":{"text":"The Circuit Package Tracker connects with a variety of different systems in order to give accurate tracking from as wide a range of services as possible. On the other hand, Colissimo’s tracker is limited to their packages and is tied to the functionality of their website.","spans":[]}},{"type":"heading3","content":{"text":"How late does Colissimo deliver?","spans":[]}},{"type":"paragraph","content":{"text":"Colissimo delivers on Mondays to Fridays before 6.00 pm (excluding bank and public holidays).","spans":[]}},{"type":"paragraph","content":{"text":"How long does it usually take to deliver an international package with Colissimo?","spans":[]}},{"type":"paragraph","content":{"text":"International deliveries outside of Europe usually take 11 to 18 business days. However, this can vary. Colissimo does not compensate for packages delivered outside of the delivery timeframe window. ","spans":[]}},{"type":"heading3","content":{"text":"How long will Colissimo hold a package?","spans":[]}},{"type":"paragraph","content":{"text":"Packages are typically held for 15 days. During the Summer months, packages are held for 30 days at the post office. ","spans":[]}},{"type":"heading3","content":{"text":"How to sign for a Colissimo package?","spans":[]}},{"type":"paragraph","content":{"text":"You do not need to sign for a package delivered via Colissimo.","spans":[]}},{"type":"paragraph","content":{"text":"How to track a Colissimo package with Circuit?","spans":[]}},{"type":"paragraph","content":{"text":"To track your package with Circuit, enter the tracking number of the package given by Colissimo into the Circuit Package Tracker and click 'Track my package’. You can then view the current location as well as previous shipping updates. ","spans":[]}},{"type":"heading3","content":{"text":"What do I do if I haven't received my package from Colissimo?","spans":[]}},{"type":"paragraph","content":{"text":"You should track your package by using the tracking number to determine its location. If there is no update available you can contact the company via their contact page. Giving them the tracking number would be helpful. ","spans":[{"start":156,"end":168,"type":"hyperlink","data":{"preview":{"title":"https://aide.laposte.fr/contenu/comment-contacter-ou-reclamer-aupres-du-service-clients-pour-votre-colissimo-et-votre-courrier?t=p"},"url":"https://aide.laposte.fr/contenu/comment-contacter-ou-reclamer-aupres-du-service-clients-pour-votre-colissimo-et-votre-courrier?t=p"}}]}},{"type":"heading3","content":{"text":"What happens if Colissimo loses my package?","spans":[]}},{"type":"paragraph","content":{"text":"Packages shipped with Colissimo are insured in the event of damage, loss, or theft. If your package is lost you can contact them here to inform them and get assistance. ","spans":[]}},{"type":"heading3","content":{"text":"What happens if I miss my Colissimo delivery?","spans":[]}},{"type":"paragraph","content":{"text":"If you are not there to accept your delivery, Colissimo will leave a message stating they made a delivery attempt. You will be given the option to have a second delivery attempt, or you can collect the package from the post office address they give. ","spans":[]}},{"type":"heading3","content":{"text":"What time will my Colissimo package arrive?","spans":[]}},{"type":"paragraph","content":{"text":"Colissimo delivers from Monday to Saturday, excluding public holidays. Although the delivery time can change, by using Circuit tracking you can see the expected delivery time on the day. ","spans":[]}},{"type":"heading3","content":{"text":"Where is my Colissimo package?","spans":[]}},{"type":"paragraph","content":{"text":"To view the location of your package enter the tracking number into the ‘track my package’ box on the Circuit website.","spans":[]}},{"type":"heading3","content":{"text":"Where is my Colissimo tracking number?","spans":[]}},{"type":"paragraph","content":{"text":"You can find your tracking number in the link given in your order, under \"my orders\", or on the link sent by email or SMS after shipment of the package. The tracking number is a set of numbers made up of 11-15 characters.","spans":[]}},{"type":"heading3","content":{"text":"Why is my Colissimo package not moving?","spans":[]}},{"type":"paragraph","content":{"text":"There are a number of reasons why your package could not be moving or stuck in transit. ","spans":[]}},{"type":"list-item","content":{"text":"Customs clearance – This is possible with international shipments. Failure to give the necessary documentation will have your shipment stuck in transit. To solve, you would need to contact Colissimo for further information.","spans":[]}},{"type":"list-item","content":{"text":"Wrong or incomplete address – If the address given does not have all the necessary details for it to be delivered this would prevent it from moving. If Colissimo is unable to deliver your package because of an address issue they would inform you. ","spans":[]}},{"type":"list-item","content":{"text":"The package is oversized/overweight – If a package is heavier than Colissimo’s weight limit, the package may not be delivered. Packages delivered via Colissimo should weigh no more than 30kg.","spans":[]}},{"type":"paragraph","content":{"text":"If you believe there is an issue with your package you should contact Colissimo.","spans":[]}},{"type":"heading3","content":{"text":"Why is my Colissimo package pending?","spans":[]}},{"type":"paragraph","content":{"text":"When your package is labeled as \"pending\", this means the packages are scheduled to be processed later. When your package is pending you can continue to check on its status via Circuit. Once it has been processed the status will be updated, and you can then track the location of your package.","spans":[]}},{"type":"paragraph","content":{"text":"If you’re sending or waiting for a package with Colissimo and you want to know exactly where it is,try Circuit Package Tracker for free.","spans":[{"start":0,"end":136,"type":"em"},{"start":99,"end":135,"type":"strong"},{"start":99,"end":135,"type":"hyperlink","data":{"url":"https://getcircuit.com/package-tracker"}}]}}],"type":"package_tracker_carriers","tags":[],"lang":"en-us","grouplang":"YNDk7hEAAO0mGeWJ"}