{"slug":"purolator","carrier_id":"Purolator","carrier_title":"Purolator","uk_english":false,"description":[{"type":"paragraph","content":{"text":"Purolator Inc. is a Canadian courier company primarily owned by Canada Post and partially owned by Rainmaker Investments Ltd. Purolator also has a freight forwarding subsidiary called Purolator International based in the US. The corporate head office for Purolator Inc. is located in Mississauga, Ontario and the head office for Purolator International is in New Jersey.","spans":[{"start":20,"end":44,"type":"hyperlink","data":{"url":"https://en.wikipedia.org/wiki/Purolator_Inc."}},{"start":184,"end":207,"type":"hyperlink","data":{"url":"https://en.wikipedia.org/wiki/Purolator_International"}},{"start":284,"end":304,"type":"hyperlink","data":{"url":"https://mininglifeonline.net/company-article/purolator-facts---history/9786"}}]}},{"type":"paragraph","content":{"text":"The history of Puralor dates back to 1967, when it started as a courier company named Trans Canada Couriers. An American company that produced air filters and oil, named Purolator, took ownership until 1987, when it again became a Canadian company. Purolator kept its name but has no association with the American oil company today. ","spans":[]}},{"type":"paragraph","content":{"text":"Purolator can deliver mail and packages that weigh up to 68 kg (about 150 pounds). If your package is heavier than this, Purolator International does reserve the right to refuse your package. That said, most people don't need to ship packages heavier than 68 kg too often. ","spans":[{"start":45,"end":62,"type":"hyperlink","data":{"url":"https://www.purolatorinternational.com/content/uploads/2019/01/Purolator-International-Inc.-Terms-and-Conditions-of-Service-2019.01.04.pdf"}}]}},{"type":"paragraph","content":{"text":"Purolator can deliver packages to the US, Canada and worldwide to over 210 countries and territories. If you are shipping a package to someone, you just have to keep in mind that you'll have to prepare customs forms and tariff codes before bringing your package to your local Purolator shipping center.","spans":[{"start":194,"end":232,"type":"hyperlink","data":{"url":"https://www.purolator.com/en/shipping/us-international"}}]}},{"type":"paragraph","content":{"text":"If you’re sending or waiting for a package with the Purolator and you want to know exactly where it is,try Circuit Package Tracker for free.","spans":[{"start":0,"end":52,"type":"em"},{"start":62,"end":140,"type":"em"},{"start":103,"end":139,"type":"strong"},{"start":103,"end":139,"type":"hyperlink","data":{"url":"https://getcircuit.com/package-tracker"}}]}},{"type":"heading2","content":{"text":"Circuit Package Tracker and Purolator","spans":[]}},{"type":"paragraph","content":{"text":"When it comes to tracking your packages, Circuit Package Tracker provides you with peace of mind. No one should have to worry all week about important items, and Circuit can help ease that worry. Purolator tracking can be tough to follow, as couriers often forget to provide consistent updates that are up-to-speed. ","spans":[{"start":41,"end":64,"type":"hyperlink","data":{"url":"https://getcircuit.com/package-tracker"}}]}},{"type":"paragraph","content":{"text":"You can trust Circuit for all of your tracking needs and be aware of crucial information concerning your delivery. All you need is your Purolator tracking number and to select \"Purolator\" from the list of couriers. Next, everything you need to know, including when the package left the warehouse, when it's out for delivery, and everything in between, will be right in front of you!","spans":[]}},{"type":"heading2","content":{"text":"Frequently Asked Questions ","spans":[]}},{"type":"heading3","content":{"text":"Can I track a Purolator package without a tracking number?","spans":[]}},{"type":"paragraph","content":{"text":"It is possible to track your Purolator package without a tracking number. You can use a pin or reference number to track your package on the Purolator track shipment page. You should double-check that your tracking number isn't in your email with your shipment confirmation since you should use Circuit Package Tracker for more efficient tracking. ","spans":[{"start":151,"end":165,"type":"hyperlink","data":{"url":"https://www.purolator.com/en/shipping/tracker#"}}]}},{"type":"heading3","content":{"text":"Does Circuit offer better tracking than Purolator?","spans":[]}},{"type":"paragraph","content":{"text":"Circuit offers better tracking than Purolator with its simple search process and up-to-speed information on the whereabouts of your package. Couriers are often bogged down and overwhelmed with deliveries. This can lead to slow updates on the status of your package. ","spans":[]}},{"type":"paragraph","content":{"text":"International deliveries also involve many people that handle your package from its origin to its destination. This can cause miscommunication and a lack of accurate updates. Circuit Package Tracker lets you know everything you need to know; its main focus is providing delivery updates that keep you satisfied. ","spans":[]}},{"type":"heading3","content":{"text":"How late does Purolator deliver?","spans":[]}},{"type":"paragraph","content":{"text":"Purolator can deliver packages as late as 9 pm. You can pay extra to receive a package before a certain time. These options include: ","spans":[{"start":110,"end":131,"type":"hyperlink","data":{"url":"https://www.purolator.com/en/shipping/shipping-canada"}}]}},{"type":"list-item","content":{"text":"Purolator Express® 9 AM","spans":[]}},{"type":"list-item","content":{"text":"Purolator Express® 10:30 AM","spans":[]}},{"type":"list-item","content":{"text":"Purolator Express® 12 PM","spans":[]}},{"type":"list-item","content":{"text":"Purolator Express® Evening between 5:30 and 9 pm","spans":[]}},{"type":"heading3","content":{"text":"How long does it usually take to deliver an international package with Purolator?","spans":[]}},{"type":"paragraph","content":{"text":"Purolator Express International can ship international packages quickly. If your package doesn't need to be delivered urgently, you can select this option and expect delivery after two or more business days. ","spans":[{"start":0,"end":31,"type":"hyperlink","data":{"url":"https://www.purolator.com/en/shipping/us-international/ship-us-internationally"}}]}},{"type":"heading3","content":{"text":"How long will Purolator hold a package?","spans":[]}},{"type":"paragraph","content":{"text":"Purolator will hold your package at the selected shipping location for a maximum of 5 days. Someone can pick it up for you with a photo ID and other important information, like the tracking number or proof of address. ","spans":[{"start":73,"end":90,"type":"hyperlink","data":{"url":"https://www.purolator.com/en/support/faqs/receiving#:~:text=How%20long%20will%20Purolator%20hold,Some%20exceptions%20may%20apply."}},{"start":130,"end":138,"type":"hyperlink","data":{"url":"https://www.purolator.com/en/support/faqs/receiving#receiving-my-shipment"}}]}},{"type":"heading3","content":{"text":"How to sign for a Purolator package","spans":[]}},{"type":"paragraph","content":{"text":"To sign for your Purolator package, simply stay home when you see the notification that it is out for delivery. If you can't, you can pick it up at the chosen location listed on your attempted delivery slip. You can select SNR (signature not required) for your package if you can't accommodate staying at home to sign. ","spans":[{"start":223,"end":251,"type":"hyperlink","data":{"url":"https://www.purolator.com/en/shipping/purolator-specialized-services"}}]}},{"type":"heading3","content":{"text":"How to track a Purolator package with Circuit","spans":[]}},{"type":"paragraph","content":{"text":"Circuit Package Tracker gives you up-to-date info in seconds. It's straightforward, and you don't have to waste time entering additional information. All you need is your Purolator tracking number and to choose \"Purolator\" as your courier. ","spans":[{"start":0,"end":23,"type":"hyperlink","data":{"url":"https://getcircuit.com/package-tracker"}}]}},{"type":"heading3","content":{"text":"What do I do if I haven't received my package from Purolator?","spans":[]}},{"type":"paragraph","content":{"text":"There may be a delay, in which case you should wait patiently for your package to arrive. You can call Purolator customer service for reassurance and see if they have additional information about your package. If you haven't checked Circuit in a while, you should also check their package tracker for new updates. ","spans":[]}},{"type":"paragraph","content":{"text":"The delivery driver may have also failed to deliver your package for several reasons. There could have been a vehicle emergency, or the driver had too many deliveries and didn't have time to complete them all. If this happens, you will get a \"delayed due to missed delivery\" notification.","spans":[{"start":275,"end":287,"type":"hyperlink","data":{"url":"https://www.purolator.com/en/support/faqs/receiving"}}]}},{"type":"paragraph","content":{"text":"You may have to contact the seller, as well. Your package could be stuck at a warehouse due to insufficient information, or the item was unavailable, and the seller didn't inform you. In any case, you will get to the bottom of it!","spans":[]}},{"type":"heading3","content":{"text":"What happens if Purolator loses my package?","spans":[]}},{"type":"paragraph","content":{"text":"A seller can file a claim for your lost package. You can also do the same if you have sent a package and it hasn't reached the recipient yet. Losing a package is a rare occurrence, and you should contact Purolator customer service for more support and understand the process fully. ","spans":[{"start":13,"end":25,"type":"hyperlink","data":{"url":"https://www.purolator.com/en/support/file-claim"}},{"start":204,"end":230,"type":"hyperlink","data":{"url":"https://www.purolator.com/en/support/contact-us"}}]}},{"type":"heading3","content":{"text":"What happens if I miss my Purolator delivery?","spans":[]}},{"type":"paragraph","content":{"text":"There will be a \"missed delivery\" slip in your mailbox indicating where and when you can pick up your Purolator package. You can assign someone to pick up the package for you, provided they have an ID. You should also make sure they bring the slip with them when they go to pick it up. ","spans":[{"start":66,"end":80,"type":"hyperlink","data":{"url":"https://www.purolator.com/en/support/faqs/receiving#:~:text=What%20if%20I%20missed%20my,maximum%20of%205%20business%20days."}}]}},{"type":"heading3","content":{"text":"What time will my Purolator package arrive?","spans":[]}},{"type":"paragraph","content":{"text":"If Circuit says that your package is at its final destination or it's out for delivery, this means that your package will likely arrive that day. If you don't have a preference for a specific time, that means your package will arrive at the end of the day, meaning by 9 pm. There may also be an estimated time of delivery. ","spans":[{"start":257,"end":272,"type":"hyperlink","data":{"url":"https://www.purolator.com/en/shipping/shipping-canada"}}]}},{"type":"heading3","content":{"text":"Where is my Purolator package?","spans":[]}},{"type":"paragraph","content":{"text":"You should check Circuit Package Tracker to see where your package currently is. It may be at customs, on the way to its final destination facility, or even out for delivery. Keep in mind, Purolator doesn't lose packages very often, but you can also contact their customer support. ","spans":[{"start":258,"end":280,"type":"hyperlink","data":{"url":"https://www.purolator.com/en/support/contact-us"}}]}},{"type":"paragraph","content":{"text":"There may also be a delay, which can happen for many reasons. By checking Circuit, there will be as much information as possible about why there may be a delay. You can also contact the seller if you think your package hasn't shipped at all. ","spans":[]}},{"type":"heading3","content":{"text":"Where is my Purolator tracking number?","spans":[]}},{"type":"paragraph","content":{"text":"If you have sent a package to someone, you can let them know a tracking number. You can find it on your yellow Purolator waybill. It is a 12 digit number. ","spans":[{"start":104,"end":128,"type":"hyperlink","data":{"url":"https://www.switchhealth.ca/en/support/articles/5132058"}}]}},{"type":"paragraph","content":{"text":"If you have ordered a package, the seller will send you a shipping confirmation email. In this email, you will save on your Purolator tracking number and enter it into Circuit Package Tracker. ","spans":[]}},{"type":"heading3","content":{"text":"Why is my Purolator package not moving?","spans":[]}},{"type":"paragraph","content":{"text":"If you have sent a package to someone and your Purolator status is \"pending,\" just be patient. It will be sent to the final destination when the delivery schedule is prepared. However, if your package has been sent and you notice in Circuit Package Tracker that it has not moved in a week or so, there may be a delay. ","spans":[]}},{"type":"paragraph","content":{"text":"Delays can occur for several reasons. Unless your package is lost in transit, it will be resolved eventually. Some causes of delivery delays include:","spans":[{"start":110,"end":121,"type":"hyperlink","data":{"url":"https://www.gopeople.com.au/prevent-causes-late-deliveries/"}}]}},{"type":"list-item","content":{"text":"Delivery volume","spans":[]}},{"type":"list-item","content":{"text":"Bad weather","spans":[]}},{"type":"list-item","content":{"text":"Packaging issues","spans":[]}},{"type":"list-item","content":{"text":"Technical difficulties ","spans":[]}},{"type":"list-item","content":{"text":"Documentation errors","spans":[]}},{"type":"heading3","content":{"text":"Why is my Purolator package pending?","spans":[]}},{"type":"paragraph","content":{"text":"A \"pending\" message means that your package is waiting to be sent for delivery. If it's been pending for too long, you should contact Purolator. Purolator still needs to prepare the delivery schedule, and the shipping courier is still processing it.","spans":[{"start":209,"end":248,"type":"hyperlink","data":{"url":"https://rosewe.store/fedex-scheduled-delivery-pending/"}}]}},{"type":"paragraph","content":{"text":"A package that you're waiting for can also remain stuck at the original warehouse for many reasons. For instance, sometimes the postal staff is overworked, and they simply missed your package. ","spans":[]}},{"type":"paragraph","content":{"text":"If you’re sending or waiting for a package with the Purolator and you want to know exactly where it is, try Circuit Package Tracker for free.","spans":[{"start":0,"end":52,"type":"em"},{"start":62,"end":141,"type":"em"},{"start":104,"end":140,"type":"strong"},{"start":104,"end":140,"type":"hyperlink","data":{"url":"https://getcircuit.com/package-tracker"}}]}},{"type":"paragraph","content":{"text":"","spans":[]}}],"type":"package_tracker_carriers","tags":[],"lang":"en-us","grouplang":"YNDk5hEAAJMfGeVC"}