{"slug":"fastway","carrier_id":"Fastway","carrier_title":"Fastway","uk_english":false,"description":[{"type":"paragraph","content":{"text":"","spans":[]}},{"type":"paragraph","content":{"text":"Fastway Couriers is a unique courier service with over 250 franchises based across New Zealand, Australia, Ireland, Northern Ireland, and South Africa. Established in Napier, NZ in 1983, Fastway offers an ideal courier service targeted toward small to medium businesses alongside international “e-tailors” (businesses selling their products on the internet).   ","spans":[]}},{"type":"paragraph","content":{"text":"Fastway offers domestic services to areas in Ireland and Northern Ireland, as well as international services in the UK. This is how it works. If you are the sender, Fastway will pick up your products and deliver them to the appropriate sorting hub. After they receive the products, they can deliver them within 48 hours domestically. Click here to get more details about where they deliver. ","spans":[{"start":340,"end":344,"type":"hyperlink","data":{"url":"https://www.fastway.ie/faqs/18-faq/sending-parcels/45-can-i-send-internationally"}}]}},{"type":"paragraph","content":{"text":"You can become a frequent sender or send a one-off delivery; it is catered to your specific needs. There is an option to get a quote or proposal from Fastway on their website. They keep their prices low by delivering using public transportation, which is one reason why they must confirm redelivery with its customers. ","spans":[]}},{"type":"paragraph","content":{"text":"With 30 years of service under their belt, Fastway is determined to provide an efficient, convenient, and easy to use courier service. Here are a few frequently asked questions about Fastway’s services.","spans":[]}},{"type":"paragraph","content":{"text":"If you’re sending or waiting for a package with the USPS and you want to know exactly where it is,try Circuit Package Tracker for free.","spans":[{"start":0,"end":135,"type":"em"},{"start":98,"end":134,"type":"strong"},{"start":98,"end":134,"type":"hyperlink","data":{"url":"https://getcircuit.com/package-tracker"}}]}},{"type":"heading2","content":{"text":"Frequently Asked Questions","spans":[]}},{"type":"heading3","content":{"text":"Can I track a Fastway package without a tracking number? ","spans":[]}},{"type":"paragraph","content":{"text":"There is no option to track your package without a tracking number, but you can always contact the support department at your closest Fastway location if you have lost your tracking number. You may do this by using the support function on the bottom right of their web page, or for existing customers, with your client phone number or email address. Before you call though, make sure to check your email for a confirmation message including your tracking number. ","spans":[{"start":265,"end":273,"type":"hyperlink","data":{"url":"https://www.fastway.ie/"}}]}},{"type":"heading3","content":{"text":"Does Circuit offer better tracking than Fastway?","spans":[]}},{"type":"paragraph","content":{"text":"Fastway uses scanners to quickly and efficiently relay tracking information to Circuit. This allows Circuit to quickly relay the information directly to customers. By using the fastest and most efficient technology, Circuit and Fastway work together to give you the best experience possible.","spans":[]}},{"type":"heading3","content":{"text":"How late does Fastway deliver? ","spans":[]}},{"type":"paragraph","content":{"text":"Fastway’s multiple franchises have separate information about their timetables. You can contact your closest local franchise on this page. You can also use the Support button on the bottom right of Fastway’s website. ","spans":[{"start":128,"end":138,"type":"hyperlink","data":{"url":"https://www.fastway.ie/contact-us"}}]}},{"type":"paragraph","content":{"text":"They keep their prices low by delivering using public transportation, which is one reason why they must confirm redelivery with its customers. If you miss your delivery, you can also fill out an “Authority to Leave” form, which allows you to give instructions to the courier on where to leave your package – as long as it does not have to be signed for.","spans":[]}},{"type":"paragraph","content":{"text":"How long does it usually take to deliver an international package with Fastway?  ","spans":[]}},{"type":"paragraph","content":{"text":"International shipping times depend on the region you are sending the package. To request a quote or proposal for your needs, fill out this form. Fastway also offers competitive pricing rates for international shipping, which will be included in your quote. ","spans":[{"start":140,"end":144,"type":"hyperlink","data":{"url":"https://www.fastway.ie/pricing/request-a-proposal"}}]}},{"type":"heading3","content":{"text":"How long will Fastway hold a package?","spans":[]}},{"type":"paragraph","content":{"text":"Fastway will hold your package for 5 days or more, depending on the location you are using. You may call your local franchise to arrange a time for pickup if you missed the delivery, and they will - also let you know how long they can keep it on-site if it differs from the usual 5 days.","spans":[]}},{"type":"heading3","content":{"text":"How to sign for a Fastway package:","spans":[]}},{"type":"paragraph","content":{"text":"When your package arrives, remember to have your photo ID available. Fastway’s policy is to obtain a signature for every package; this is how they confirm the right person is getting the package. In some cases the package can be left in a designated area, just remember to fill out an “Authority to Leave” form. ","spans":[]}},{"type":"heading3","content":{"text":"How to track a Fastway package with Circuit? ","spans":[]}},{"type":"paragraph","content":{"text":"To track your Fastway package through Circuit, you must go to the Circuit Package Tracker website. Enter your tracking/label number and Circuit will automatically detect which courier you are using (of course in this case Fastway should appear). If you do not have your tracking number, you should contact your local Fastway franchise to get a copy of the confirmation. ","spans":[]}},{"type":"paragraph","content":{"text":"Your Fastway tracking number is found on your label. It consists of 12 digits, containing both numbers and letters. Shipping labels are prepaid so when you receive your labels before shipping, make sure to record your tracking number. If you forget, make sure to check your email address for a message containing the number.","spans":[]}},{"type":"heading3","content":{"text":"What do I do if I haven't received my package from Fastway?","spans":[]}},{"type":"paragraph","content":{"text":"Use our Circuit Package Tracking service to track your package. By working together with Fastway’s label scanning technology, we can tell you where your package is in seconds, every hour of the day. If it still has not arrived in a reasonable amount of time, you can contact your local franchise or use the Support button on the bottom of the web page. ","spans":[]}},{"type":"paragraph","content":{"text":"The most likely reason your package has not arrived is that it has not reached the Fastway Ireland Hub yet. If it’s coming from an international seller, when it arrives at the hub, you’ll get a notification saying it should be shipped to you within 1-2 days. ","spans":[]}},{"type":"paragraph","content":{"text":"If coming from a domestic seller, you’ll get a notification saying it has been received. Once it has been received, Fastway offers deliveries within 48 hours domestically.","spans":[]}},{"type":"heading3","content":{"text":"What happens if Fastway loses my package?","spans":[]}},{"type":"paragraph","content":{"text":"With Fastway’s Limited Liability Coverage you can file a claim for missing or damaged items (damaged items must be filed within 48 hours of delivery). There are no fees for filing a claim, but you must provide certain evidence for it to be accepted and receive compensation. You must be able to provide the cost of your goods and what type of product was lost. Providing a Supplier Invoice is the best way to prove the cost of goods. ","spans":[]}},{"type":"paragraph","content":{"text":"There are some types of products that are not covered under Fastway’s insurance though. They include glass and jewelry as well as others which can be found in Fastway’s “Conditions of Carriage”. ","spans":[{"start":169,"end":194,"type":"hyperlink","data":{"url":"https://www.fastway.ie/images/legal/Standard-COC-NI-31.03.21.pdf"}}]}},{"type":"heading3","content":{"text":"What happens if I miss my Fastway delivery?","spans":[]}},{"type":"paragraph","content":{"text":"Fastway uses transportation that lowers cost (usually a bus or train) so they can offer low fees and no hidden fees to its customers. This means they won’t be able to just turn around and hand it to you if you miss the delivery. However, you can rearrange for redelivery with no fee. You can also fill out an “Authority to Leave” form, which allows you to give instructions to the courier on where to leave your package – as long as it does not have to be signed for. ","spans":[]}},{"type":"paragraph","content":{"text":"Fastway will hold your package for 5 days or more, depending on the location you are using. You may call your local franchise to arrange a time for pickup if you missed the delivery, and they will - also let you know how long they can keep it on-site if it differs from the usual 5 days.","spans":[]}},{"type":"heading3","content":{"text":"Where is my Fastway package and what time will it arrive?","spans":[]}},{"type":"paragraph","content":{"text":"You can locate and find an approximate time for your package’s arrival using Circuit Package Tracker’s tool. This tool is easy to use, quick and efficient. It works by receiving information from Fastway’s scanning technology within ","spans":[{"start":77,"end":102,"type":"hyperlink","data":{"url":"https://getcircuit.com/package-tracker"}}]}},{"type":"heading3","content":{"text":"Where is my Fastway tracking number?","spans":[]}},{"type":"paragraph","content":{"text":"Your Fastway tracking number is found on your label. It consists of 12 digits, containing both numbers and letters. Shipping labels are prepaid so when you receive your labels before shipping, make sure to record your tracking number. If you forget, make sure to check your email address for a message containing the number. If you still can’t find it, contact your local Fastway franchise. ","spans":[]}},{"type":"heading3","content":{"text":"Why is my Fastway package not moving/pending?","spans":[]}},{"type":"paragraph","content":{"text":"The most likely reason your package is not moving is that it has not reached the Fastway Ireland Hub yet. If it’s coming from an international seller, when it arrives at the hub, you’ll get a notification saying it should be shipped to you within 1-2 days. ","spans":[]}},{"type":"paragraph","content":{"text":"If coming from a domestic seller, you’ll get a notification saying it has been received. Once it has been received, Fastway offers deliveries within 48 hours domestically.","spans":[]}},{"type":"heading3","content":{"text":"What happens if Fastway loses my package?","spans":[]}},{"type":"paragraph","content":{"text":"With Fastway’s Limited Liability Coverage you can file a claim for missing or damaged items (damaged items must be filed within 48 hours of delivery). There are no fees for filing a claim, but you must provide certain evidence for it to be accepted and receive compensation. You must be able to provide the cost of your goods and what type of product was lost. Providing a Supplier Invoice is the best way to prove the cost of goods. ","spans":[]}},{"type":"paragraph","content":{"text":"There are some types of products that are not covered under Fastway’s insurance though. They include glass and jewelry as well as others which can be found in Fastway’s “Conditions of Carriage”.","spans":[{"start":170,"end":192,"type":"hyperlink","data":{"url":"https://www.fastway.ie/images/legal/Standard-COC-NI-31.03.21.pdf"}}]}},{"type":"paragraph","content":{"text":"If you’re sending or waiting for a package with fastway and you want to know exactly where it is, try Circuit Package Tracker for free.","spans":[{"start":0,"end":135,"type":"em"},{"start":98,"end":134,"type":"strong"},{"start":98,"end":134,"type":"hyperlink","data":{"url":"https://getcircuit.com/package-tracker"}}]}}],"type":"package_tracker_carriers","tags":[],"lang":"en-us","grouplang":"YNDk6hEAABEKGeVr"}