{"slug":"post-nl","carrier_id":"PostNL","carrier_title":"PostNL","uk_english":false,"description":[{"type":"paragraph","content":{"text":"Use Circuit Package Tracker to track your package with PostNL. Get the updates you need to manage your schedule and never miss a delivery.","spans":[]}},{"type":"paragraph","content":{"text":"PostNL was formed after a series of transactions starting in the late 90s. Its roots are from an Australian-based company called TNT Limited. Then KPN, a government-owned postal monopoly in the Netherlands, purchased portions of TNT Limited from the Australian firm. Afterwards, KPN merged its own post division with TNT Limited to form the TNT Post Group (TPG).","spans":[]}},{"type":"paragraph","content":{"text":"For the next 10 years, TPG went on to make a series of acquisitions from private freight and package delivery firms from around the world. PostNL was thus formed by TPG who finally branched PostNL off as a separate business specializing in express delivery services.","spans":[]}},{"type":"paragraph","content":{"text":"PostNL is a domestic and international mail and package delivery corporation that is also involved in e-commerce. They operate from the European nations of the Netherlands, Germany, Italy, Belgium, and the United Kingdom. PostNL provides universal delivery in the Netherlands.","spans":[]}},{"type":"paragraph","content":{"text":"A feature of PostNL is its quick turnaround delivery. Their standard provision is domestic next-day delivery unless you request a reschedule. ","spans":[]}},{"type":"paragraph","content":{"text":"PostNL delivers packages up to 30kg, letter posts, cold items that include frozen foods, fresh foods, and supplements.","spans":[]}},{"type":"paragraph","content":{"text":"PostNL delivers worldwide to every continent in the world as well as remote-island countries such as Fiji..","spans":[]}},{"type":"paragraph","content":{"text":"If you’re sending or waiting for a package with  PostNL and you want to know exactly where it is,try Circuit Package Tracker for free.","spans":[{"start":0,"end":49,"type":"em"},{"start":56,"end":134,"type":"em"},{"start":97,"end":133,"type":"strong"},{"start":97,"end":133,"type":"hyperlink","data":{"url":"https://getcircuit.com/package-tracker"}}]}},{"type":"heading2","content":{"text":"Frequently Asked Questions","spans":[]}},{"type":"paragraph","content":{"text":"The following are frequently asked questions about PostNL and includes information about how Circuit Package Tracking works with PostNL.","spans":[]}},{"type":"heading3","content":{"text":"Can I track a PostNL package without a tracking number?","spans":[]}},{"type":"paragraph","content":{"text":"Circuit Package Tracker uses the tracking number provided by PostNL to give you an update on your package at every phase. Directly access our package tracker to plan for the arrival of your package so that you can plan your day. ","spans":[]}},{"type":"paragraph","content":{"text":"You can also check on your delivery through PostNL, but you will still need your tracking number as well as the postcode of your delivery recipient.","spans":[]}},{"type":"heading3","content":{"text":"Does Circuit offer better tracking than PostNL?","spans":[]}},{"type":"paragraph","content":{"text":"Circuit Package Tracking gives you a direct update on the status of your package. Circuit works with PostNL, not instead of PostNL.","spans":[]}},{"type":"paragraph","content":{"text":"We work with couriers worldwide to provide consumers with access to the tracking portions of our integrated logistics and supply chain management system. As the applications are exchanging information, customers can monitor the movement of their items to help inform their personal schedules in preparation for receiving deliveries.","spans":[]}},{"type":"heading3","content":{"text":"How late does PostNL deliver?","spans":[]}},{"type":"paragraph","content":{"text":"PostNL delivers packages, registered mail, and funeral cards from Monday to Saturday until 9:30 p.m. ","spans":[]}},{"type":"paragraph","content":{"text":"Funeral cards posted before 4:30 p.m. on weekdays will be delivered the next day. Funeral cards posted on a weekend will be delivered by the following evening.","spans":[]}},{"type":"paragraph","content":{"text":"For a letter post such as letters and postcards, delivery is from Tuesday to Saturday until 6 p.m. ","spans":[]}},{"type":"paragraph","content":{"text":"Healthcare deliveries are available from Monday to Saturday. The last delivery of the day will vary. All healthcare deliveries posted during the weekend before Sunday at 5 p.m. will be delivered the following Monday.","spans":[]}},{"type":"paragraph","content":{"text":"Food and supplement deliveries are usually scheduled to as part of the morning deliveries. ","spans":[]}},{"type":"heading3","content":{"text":"How long does it usually take to deliver an international package with PostNL?","spans":[]}},{"type":"paragraph","content":{"text":"PostNL sends letter-sized mail, packages, and international registered mail worldwide. Check with PostSNL for correct size and weight requirements and a list of specifications per country to ensure that your items are correctly addressed.","spans":[{"start":87,"end":105,"type":"hyperlink","data":{"url":"https://www.postnl.nl/en/sending/letter-or-card/international-mail/"}}]}},{"type":"paragraph","content":{"text":"For a complete list of countries and the delivery times for each, visit PostNL’s complete international delivery schedule.","spans":[{"start":104,"end":121,"type":"hyperlink","data":{"url":"https://www.postnl.nl/en/Images/delivery-times_tcm9-23680.pdf"}}]}},{"type":"heading3","content":{"text":"How long will PostNL hold a package?","spans":[]}},{"type":"paragraph","content":{"text":"PostNL will hold your package at a pick-up point for 7 days before they will initiate a return to sender.","spans":[]}},{"type":"paragraph","content":{"text":"How to sign for a PostNL package","spans":[]}},{"type":"paragraph","content":{"text":"PostNL offers a Signature for Delivery service that requires the addressee to sign for the delivery. Signature for Delivery also confers a level of insurance coverage for the delivery. In the event that a package or letter is lost or damaged, you will receive compensation for up to 500 euros.","spans":[{"start":101,"end":123,"type":"hyperlink","data":{"url":"https://www.postnl.nl/en/sending/sending-a-parcel/domestic-parcel/signature-for-delivery/"}}]}},{"type":"paragraph","content":{"text":"Otherwise, deliveries will be left with a neighbor or at a pick-up point. You’ll be provided a note about the location that your delivery was left at in the event that you were unavailable.","spans":[]}},{"type":"paragraph","content":{"text":"Using Circuit Package Tracker will help you know when to expect your package so you can still plan your day and be available for your delivery’s arrival.","spans":[]}},{"type":"heading3","content":{"text":"How to track a PostNL package with Circuit","spans":[]}},{"type":"paragraph","content":{"text":"Use our Circuit Package Tracker by entering the tracking code, selecting your carrier, and hit “Track my package.”","spans":[{"start":8,"end":31,"type":"hyperlink","data":{"url":"https://getcircuit.com/package-tracker"}}]}},{"type":"heading3","content":{"text":"What do I do if I haven't received my package from PostNL?","spans":[]}},{"type":"paragraph","content":{"text":"PostNL recommends that you check your delivery status first. You can use Circuit Package Tracker or go directly to PostNL’s tracker page. You’ll need your tracking number and destination information—specifically the postal code.","spans":[]}},{"type":"paragraph","content":{"text":"If your delivery status is “Delivered,” PostNL recommends checking with your neighbors or PostNL pick-up points. Your driver will have left you a note letting you know where you can locate your package. PostNL recommends you also check with housemates and family members.","spans":[]}},{"type":"paragraph","content":{"text":"If you are still unable to locate your delivery, PostNL asks that you wait 1 to 2 more days. PostNL generally provides next-day delivery on Monday through Saturday but asks that you allow them a two-day additional window. ","spans":[]}},{"type":"paragraph","content":{"text":"After two days if your delivery has still not arrived, contact customer service so they can look into the matter. If you are the recipient of a delivery, PostNL asks that you notify the sender about the non-arrival immediately.","spans":[]}},{"type":"paragraph","content":{"text":"Send a direct message to PostNL through Twitter about your package delivery issues 24/7 (except for bank recognized holidays)","spans":[{"start":7,"end":21,"type":"hyperlink","data":{"url":"https://twitter.com/messages/138062686-3242224733?recipient_id=138062686&text="}}]}},{"type":"heading3","content":{"text":"What happens if PostNL loses my package?","spans":[]}},{"type":"paragraph","content":{"text":"PostNL will do everything that it can to find the cause of your lost package. They ask that you:","spans":[]}},{"type":"list-item","content":{"text":"Check with neighbors, housemates, and family members for your package","spans":[]}},{"type":"list-item","content":{"text":"Check the status of your delivery","spans":[]}},{"type":"list-item","content":{"text":"Contact their Customer Service to report that your delivery is missing","spans":[]}},{"type":"list-item","content":{"text":"If you are the recipient of the package, notify the sender immediately","spans":[]}},{"type":"paragraph","content":{"text":"Customer Support Telephone: 31-88-8686161","spans":[]}},{"type":"paragraph","content":{"text":"Customer Support 24/7 messaging (except for bank recognized holidays): direct message through Twitter.","spans":[{"start":71,"end":85,"type":"hyperlink","data":{"url":"https://twitter.com/messages/138062686-3242224733?recipient_id=138062686&text="}}]}},{"type":"paragraph","content":{"text":"What happens if I miss my PostNL delivery?","spans":[]}},{"type":"paragraph","content":{"text":"If you miss your delivery with PostNL, they will leave you a note and either drop off your delivery to a neighbor’s address that you have specified or a pick-up point.","spans":[{"start":153,"end":166,"type":"hyperlink","data":{"url":"https://www.postnl.nl/en/location-finder"}}]}},{"type":"paragraph","content":{"text":"At the pick-up point, be prepared to:","spans":[]}},{"type":"list-item","content":{"text":"Show your ID","spans":[]}},{"type":"list-item","content":{"text":"Pay for delivery if necessary","spans":[]}},{"type":"list-item","content":{"text":"Sign for delivery","spans":[]}},{"type":"paragraph","content":{"text":"You can have someone else pick up a package for you. They will need their ID, your delivery note, and your address information.","spans":[]}},{"type":"heading3","content":{"text":"What time will my PostNL package arrive?","spans":[]}},{"type":"paragraph","content":{"text":"PostNL delivers domestic packages, registered mail, and funeral cards from Monday to Saturday until 9:30 p.m. There is special accommodation for funeral cards. PostNL offers a free pick-up service for funeral cards during the weekend. Funeral cards posted before 4:30 p.m. on weekdays will be delivered the next day.  ","spans":[]}},{"type":"paragraph","content":{"text":"For domestic letter post such as letters and postcards, delivery is from Tuesday to Saturday until 6 p.m. ","spans":[]}},{"type":"paragraph","content":{"text":"Domestic healthcare deliveries are available from Monday to Saturday. All healthcare deliveries posted during the weekend before Sunday at 5 p.m. will be delivered the following Monday as long as they are posted to the postbox designated for healthcare deliveries.","spans":[]}},{"type":"paragraph","content":{"text":"Domestic insured and priority letters and packages are delivered the next day","spans":[]}},{"type":"heading3","content":{"text":"Where is my PostNL package?","spans":[]}},{"type":"paragraph","content":{"text":"We provide you with the Circuit Package Tracker as a direct way to quickly determine where your package is en route to its delivery destination so you can worry less and plan more. ","spans":[]}},{"type":"paragraph","content":{"text":"Where is my PostNL tracking number?","spans":[]}},{"type":"paragraph","content":{"text":"You will receive your tracking number from the company that you purchased your goods from. You may check your records for receipt or contact the company directly to inquire about getting the tracking number for your PostNL delivery.","spans":[]}},{"type":"heading3","content":{"text":"Why is my PostNL package not moving?","spans":[]}},{"type":"paragraph","content":{"text":"If you notice your package is not moving, you can contact Customer Care. Before doing so consider that:","spans":[]}},{"type":"list-item","content":{"text":"You may just be observing a normal layover event","spans":[]}},{"type":"list-item","content":{"text":"Check that it is not a holiday, inclement weather, or other unforeseeable events that have caused a delay in your package’s movement.","spans":[]}},{"type":"paragraph","content":{"text":"If you are still concerned about the delay you observe with your package, PostNL requests that you wait 1 or 2 days and then contact Customer Service.","spans":[]}},{"type":"heading3","content":{"text":"Why is my PostNL package pending?","spans":[]}},{"type":"paragraph","content":{"text":"You may see a notification that your package is pending because the seller has notified PostNL to expect your package. However, your package has not yet been received for processing. It’s in the tracking system and being watched for, but has not yet been physically checked in.","spans":[]}},{"type":"paragraph","content":{"text":"This is normal as packages wait to come together in bundles with other packages from a seller or in-transit between shipping facilities.","spans":[]}},{"type":"paragraph","content":{"text":"If you’re sending or waiting for a package with PostNL and you want to know exactly where it is, try Circuit Package Tracker for free.","spans":[{"start":0,"end":48,"type":"em"},{"start":55,"end":134,"type":"em"},{"start":97,"end":133,"type":"strong"},{"start":97,"end":133,"type":"hyperlink","data":{"url":"https://getcircuit.com/package-tracker"}}]}}],"type":"package_tracker_carriers","tags":[],"lang":"en-us","grouplang":"YNDk6BEAACMAGeVZ"}