{"slug":"couriersplease","carrier_id":"CouriersPlease","carrier_title":"CouriersPlease","uk_english":false,"description":[{"type":"paragraph","content":{"text":"CouriersPlease is a long-standing and leading expert in package delivery. When it launched in 1983, the company started out serving only metropolitan customers in Australia. Though, they had their eyes on bigger sights and now delivers a range of items across the whole country. Additionally, with the launch of their International Air Services, you can now ship their packages to over 220 countries.","spans":[]}},{"type":"heading2","content":{"text":"Frequently Asked Questions About CouriersPlease","spans":[]}},{"type":"heading3","content":{"text":"Can I track a CouriersPlease package without a tracking number?","spans":[]}},{"type":"paragraph","content":{"text":"The simple answer is no. However, once an item has been sent or posted with CouriersPlease, you should have received a tracking number. This should allow you to know where your package is at any time. ","spans":[]}},{"type":"heading3","content":{"text":"Does Circuit offer better tracking than CouriersPlease?","spans":[]}},{"type":"paragraph","content":{"text":"At Circuit, we believe that you should never have any doubt about where your package is. This can be important if the item is being shipped abroad as it may switch hands between different carriers. However, by using our Circuit Package Tracker, we offer you the ease of mind of always knowing your item’s location. This includes the current city, carrier, and how quickly you should expect to have it in your hands. ","spans":[]}},{"type":"paragraph","content":{"text":"This should allow you to plan for the arrival of your package and prepare for the delivery time, which is much better than waiting by your phone or being anxious that you have already missed the delivery. ","spans":[]}},{"type":"heading3","content":{"text":"How late does CouriersPlease deliver?","spans":[]}},{"type":"paragraph","content":{"text":"Domestically, CouriersPlease operates its services by splitting the region into different zones. So, how late they will deliver your item will depend on what zone it is being shipped to. However, in most regions, CouriersPlease will make deliveries up to 6:00 pm.  ","spans":[{"start":80,"end":95,"type":"hyperlink","data":{"preview":{"title":"https://www.couriersplease.com.au/service/delivery-schedules"},"url":"https://www.couriersplease.com.au/service/delivery-schedules"}}]}},{"type":"paragraph","content":{"text":"As international packages may switch carriers depending on your country, CouriersPlease does not give a specific time when your package will be delivered. Though, you can find out what carrier has your item by using our Circuit Package Tracker and your tracking number. ","spans":[]}},{"type":"heading3","content":{"text":"How long does it usually take to deliver an international package with CouriersPlease?","spans":[]}},{"type":"paragraph","content":{"text":"CouriersPlease only gives a delivery estimate for international packages. This is because delivery times to non-domestic locations will depend on a range of factors. This could include the place the item is begin shipped to, the type of transit service you choose, etc.  ","spans":[{"start":50,"end":72,"type":"hyperlink","data":{"preview":{"title":"https://en.wikipedia.org/wiki/Cargo"},"url":"https://en.wikipedia.org/wiki/Cargo"}}]}},{"type":"paragraph","content":{"text":"If you feel that you should already have received your item, but it has not yet been delivered, don’t fret. There could be several reasons why your CouriersPlease package is taking longer than expected, such as an additional customs inspection. To find out exactly where your item is, please add your tracking number to our Circuit Package Tracker. You can also contact CouriersPlease directly. ","spans":[]}},{"type":"heading3","content":{"text":"How long will CouriersPlease hold a package?","spans":[]}},{"type":"paragraph","content":{"text":"If CouriersPlease cannot deliver an item, it may be sent to a depot or one of their POPStation lockers. If this is the case, you must visit one of these lockers within seven days of the delivery notice. This is highly important as if you do not visit within this period, your item may be returned to the sender. ","spans":[]}},{"type":"heading3","content":{"text":"How to sign for a CouriersPlease package?","spans":[]}},{"type":"paragraph","content":{"text":"CouriersPlease gives a range of options for you to sign for your package. If you feel that you will not be home when the item may be delivered, you can sign in advance. This will give the delivery driver the authority to leave their package next to your home. Additionally, you can also have the package delivered to one of your neighbors if you are not at home. ","spans":[]}},{"type":"paragraph","content":{"text":"However, if you are home when they deliver your package, you can sign for it directly. This signature will state that you have received the item in good condition. ","spans":[]}},{"type":"heading3","content":{"text":"How to track a CouriersPlease package with Circuit?","spans":[]}},{"type":"paragraph","content":{"text":"We understand how difficult it can be if you are unable to locate your package. So, our Circuit package Tracking service allows you to find your item anywhere in the world. Once you receive your tracking number from CouriersPlease, simply input it to our tracker and hit “Track My Package”. This will not only show you the status of your delivery but also the current location and estimated time of arrival of your CouriersPlease package. ","spans":[]}},{"type":"heading3","content":{"text":"What do I do if I haven't received my package from CouriersPlease?","spans":[]}},{"type":"paragraph","content":{"text":"If you cannot track your package with our tracking service and it is past the estimated delivery date, you must contact CouriersPlease immediately. They will give a short inquiry form that you can use to explain the details of the lost item. You should also be ready to give your tracking number. ","spans":[]}},{"type":"heading3","content":{"text":"What happens if CouriersPlease loses my package?","spans":[]}},{"type":"paragraph","content":{"text":"If CouriersPlease has lost your package, then you must complete their online claim form. The claim limit that you receive will depend on the type of shipping that you choose. For the saver option, your limit will be $150 per shipment. However, for priority shipments, you should expect insurance of $25 per kg, which will rise to $100 per shipment. Though, if this is a domestic delivery, CouriersPlease will give insurance for up to AUD 1,000. ","spans":[{"start":77,"end":87,"type":"hyperlink","data":{"preview":{"title":"https://www.couriersplease.com.au/service-insurance"},"url":"https://www.couriersplease.com.au/service-insurance"}}]}},{"type":"paragraph","content":{"text":"You must also be aware that you need to satisfy certain conditions for CouriersPlease to accept your claim request. So, if you are going to lodge an insurance claim, you must prepare to give a cost or sales invoice for the item that CouriersPlease has lost. Additionally, you must file your complaint within 14 days of the intended delivery date. If they receive your claim after this timeframe, then it may be rejected. ","spans":[]}},{"type":"paragraph","content":{"text":"Before lodging your claim, you should check that your item is eligible. CouriersPlease does not give insurance for several items such as antiques, refrigerated goods, and goods that they deem to have been poorly packaged.","spans":[]}},{"type":"heading3","content":{"text":"What happens if I miss my CouriersPlease delivery?","spans":[]}},{"type":"paragraph","content":{"text":"If CouriersPlease were meant to hand the delivery in person but you were unavailable, you must book redelivery online. Once you do so, they will attempt to hand over the package to you again at another time. Alternatively, you can also book redelivery to one of the many CouriersPlease POPStations, but you must collect your package within seven days if you choose this option.  ","spans":[{"start":100,"end":110,"type":"hyperlink","data":{"preview":{"title":"https://www.couriersplease.com.au/ship-redeliver"},"url":"https://www.couriersplease.com.au/ship-redeliver"}}]}},{"type":"heading3","content":{"text":"What time will my CouriersPlease package arrive?","spans":[]}},{"type":"paragraph","content":{"text":"Unfortunately, CouriersPlease does not give a specific time that they will deliver an item to your home. However, you can always use the Circuit Package Tracker to know the location of your package at any time. Simply add the tracking number that CouriersPlease has gived for you and hit “Track My Package”. Our service allows you to know the location and status of your package in a matter of seconds. ","spans":[{"start":46,"end":59,"type":"hyperlink","data":{"preview":{"title":"https://en.wikipedia.org/wiki/Delivery_(commerce)"},"url":"https://en.wikipedia.org/wiki/Delivery_(commerce)"}}]}},{"type":"heading3","content":{"text":"Where is my CouriersPlease package?","spans":[]}},{"type":"paragraph","content":{"text":"To know where your CouriersPlease package is, you must locate your tracking number. Once you have this number, input it to the Circuit Package Tracker immediately. With this service, you will be able to track the current location of your package from pre-transit to right when they deliver it to your home. ","spans":[]}},{"type":"heading3","content":{"text":"Where is my CourierPlease tracking number?","spans":[]}},{"type":"paragraph","content":{"text":"Once CouriersPlease ships your item, they will give your sender with a tracking number. If the package is from an external store, they will give your tracking number in your receipt. If you have not received this, you must contact them immediately as CouriersPlease packages cannot be located without a tracking number. ","spans":[]}},{"type":"heading3","content":{"text":"Why is my CouriersPlease package not moving?","spans":[]}},{"type":"paragraph","content":{"text":"It can be a bit of a worry when you track an item, but the status remains the same over several days. However, you must remain calm as this is a common issue. There are several reasons why your CouriersPlease package may not be moving or is stuck in a location for a while. ","spans":[]}},{"type":"paragraph","content":{"text":"If they are shipping your package internationally, then it is likely that customs are still in the process of clearing your item. As they receive several packages every day, it may take longer than usual to clear your item. Though, if you would like to know the exact status of your package, then you can use our Circuit Package Tracking service.","spans":[]}},{"type":"paragraph","content":{"text":"Our service gives current updates about the status of your package, letting you know precisely when customs clear your item to move to the next location. This should help ease any concerns that you have about the status of your package. ","spans":[]}},{"type":"heading3","content":{"text":"Why is my CouriersPlease package pending?","spans":[]}},{"type":"paragraph","content":{"text":"If your package has a pending status, then it may mean that the tracking number has not yet been added to the CouriersPlease system. This likely means that your item is still in the pre-delivery stage. If your tracking number has this status a few hours or a day after your delivery ships, then there is no need to worry, and it will change soon. However, if you feel that your package should not have a pending status, you must contact CouriersPlease immediately.","spans":[]}},{"type":"paragraph","content":{"text":"If you’re sending or waiting for a package with CouriersPlease and you want to know exactly where it is, try Circuit Package Tracker for free.","spans":[{"start":0,"end":142,"type":"em"},{"start":105,"end":141,"type":"strong"},{"start":105,"end":141,"type":"hyperlink","data":{"url":"https://getcircuit.com/package-tracker"}}]}}],"type":"package_tracker_carriers","tags":[],"lang":"en-us","grouplang":"YNDk7BEAABEKGeV3"}