{"slug":"dicom","carrier_id":"Dicom","carrier_title":"Dicom","uk_english":false,"description":[{"type":"paragraph","content":{"text":"Founded in 1968, Dicom is a Canadian courier and logistics company. Coming from humble beginnings, Dicom started as a single car, single driver courier service. Today, Dicom offers speedy regional delivery throughout parts of western Canada, Ontario, Quebec, Atlantic Canada and the United States. ","spans":[]}},{"type":"paragraph","content":{"text":"There are two ways you can receive packages from Dicom, based on customer needs. Dicom Parcel and Dicom Express can transport packages via air or truck to Ontario, Quebec and Atlantic Canada. Dicom Parcel and Express can also deliver packages via air or transport truck to some western Canadian cities. ","spans":[]}},{"type":"paragraph","content":{"text":"Dicom Freight offers express services to businesses that need large, expedited deliveries. Dicom Freight can deliver to Ontario, Quebec, western Canada and Atlantic Canada. In addition, Dicom Freight is the only Dicom service that can deliver goods across the border to the United States. ","spans":[]}},{"type":"paragraph","content":{"text":"Today, the UK-based company General Logistics Systems(GLS) owns Dicom. GLS is a division of Royal Mail in the UK and purchased Dicom from a firm called Wind Point Partners. The presence of GLS is apparent when you visit the Dicom website, but the company continues to serve Canadians and will always be a part of Canadian history. ","spans":[]}},{"type":"paragraph","content":{"text":"You can ship packages that weigh up to 76 pounds with Dicom Parcel and Express. If you need to ship goods that weigh over 300 pounds, you will need to use Dicom Freight. Dicom does not allow the delivery of perishable and fresh food items, but you can deliver non-perishable goods that don't spoil. ","spans":[]}},{"type":"heading3","content":{"text":"Circuit Package Tracker and Dicom ","spans":[]}},{"type":"paragraph","content":{"text":"If you're a Canadian or American waiting for valuable packages, goods and supplies from Dicom, you should use Circuit Package Tracker. Worrying about supplies and packages can be taxing, and Circuit eliminates the stress that comes with package tracking. Your time is precious, and you shouldn't have to wonder how swamped your courier is, causing them to be slow with tracking updates. ","spans":[]}},{"type":"paragraph","content":{"text":"Using Circuit is a breeze. First, all you need is your Dicom tracking number which you can copy and paste into Circuit. Next, scroll through the drop-down list of couriers until you find Dicom. This is the only information Circuit needs to show you reliable and up-to-date tracking information. ","spans":[]}},{"type":"paragraph","content":{"text":"No customer should feel doubtful about where their package is, and you paid good money to receive only the best service. Instead, you should let Dicom handle the delivery process while regularly checking Circuit for updates that ease your mind. Circuit Package Tracker is one of the best tracking software tools and is here to help you relax. ","spans":[]}},{"type":"heading2","content":{"text":"Frequently Asked Questions","spans":[]}},{"type":"heading3","content":{"text":"Can I track a Dicom package without a tracking number?","spans":[]}},{"type":"paragraph","content":{"text":"You may be able to describe the contents of the package or use an order or reference number to track your package. You should call Dicom customer service to do so. Make sure you select “Freight” or “Parcel” in the top left corner for the contact info you need.   ","spans":[]}},{"type":"paragraph","content":{"text":"It would be best if you also double-checked that you don't have your tracking number. You can usually find it on the merchant's website under \"your orders.\" It is also sent to you when you get a confirmation of shipment email. ","spans":[]}},{"type":"paragraph","content":{"text":"If you are the sender, you can find the tracking number under \"shipment history\" after logging into your Dicom account. You can also find tracking numbers on your waybills. It is preferable to use your tracking number if possible so that you can track your packages with Circuit Package Tracker. ","spans":[]}},{"type":"heading3","content":{"text":"Does Circuit offer better tracking than Dicom?","spans":[]}},{"type":"paragraph","content":{"text":"Circuit offers tracking updates that you can depend on. In addition, the software Circuit uses is more efficient and can relay important information to the customer much quicker than Dicom package tracking can. Dicom package tracking is also difficult to find on their website, while Circuit Package Tracker is clear and upfront. ","spans":[]}},{"type":"paragraph","content":{"text":"Circuit can show you: ","spans":[]}},{"type":"list-item","content":{"text":"The current location of your package.","spans":[]}},{"type":"list-item","content":{"text":"Your package's location history, with details. ","spans":[]}},{"type":"list-item","content":{"text":"If there have been any delays. ","spans":[]}},{"type":"list-item","content":{"text":"The estimated time of your delivery arrival.","spans":[]}},{"type":"paragraph","content":{"text":"And much more!","spans":[]}},{"type":"heading3","content":{"text":"How late does Dicom deliver?","spans":[]}},{"type":"paragraph","content":{"text":"According to FlagShip, Dicom can deliver to businesses up until 3:30 pm and residences up until 5:30 pm. ","spans":[]}},{"type":"paragraph","content":{"text":"How long does it usually take to deliver an international package with Dicom?","spans":[]}},{"type":"paragraph","content":{"text":"Dicom shipments to the United States may take up to 3 days at the most via truck delivery. As with most couriers, you can pay extra for expedited 24-hour delivery. Dicom Freight is the only Dicom service that can deliver to the United States from Canada. ","spans":[]}},{"type":"paragraph","content":{"text":"Conditions apply if you are shipping to the United States, and they're available on the Dicom FAQ page under the question \"do you deliver out of Canada?\" ","spans":[]}},{"type":"heading3","content":{"text":"How long will Dicom hold a package?","spans":[]}},{"type":"paragraph","content":{"text":"Under the \"Hold for pickup\" section of this Dicom Rules and Regulations Guide, you will see that Dicom can hold your package for a maximum of five business days. You must present a piece of valid photo ID to receive your items. ","spans":[]}},{"type":"heading3","content":{"text":"How to sign for a Dicom package","spans":[]}},{"type":"paragraph","content":{"text":"If your items require a signature, you can either sign during the delivery or when you go to pick them up at a Dicom terminal. Shippers can also fill out a document that authorizes delivery without a signature. ","spans":[]}},{"type":"heading3","content":{"text":"How to track a Dicom package with Circuit","spans":[]}},{"type":"paragraph","content":{"text":"Many couriers have confusing websites that are difficult to use. Likewise, using Circuit Package Tracker is much easier than using the Dicom tracking page. It's as easy as entering your tracking number and selecting \"Dicom\" from the drop-down list of couriers. ","spans":[]}},{"type":"heading3","content":{"text":"What do I do if I haven't received my package from Dicom?","spans":[]}},{"type":"paragraph","content":{"text":"If you haven't received your package from Dicom, you can call customer service to determine the issue. Please note, you should make sure your package isn't held up in a short delay. You can check if there are any delays with Circuit Package Tracker, as well as the relevant details. ","spans":[]}},{"type":"paragraph","content":{"text":"If Circuit Package Tracker shows a delay, you should give them an extra few days to get back on track. However, Circuit may indicate that your package hasn't left the original destination, in which case you should contact the merchant or seller. ","spans":[]}},{"type":"paragraph","content":{"text":"If Circuit or Dicom shows that your package was delivered, it may have ended up at the wrong address. Sometimes, packages can also get lost or stolen. Contact Dicom customer service ASAP if you think this may be possible. ","spans":[]}},{"type":"heading3","content":{"text":"What happens if Dicom loses my package?","spans":[]}},{"type":"paragraph","content":{"text":"If you are a merchant and a customer hasn't received their goods, you can file a lost package claim with Dicom. The website directs you to this GLS page. You can also file a claim for damaged goods. ","spans":[]}},{"type":"paragraph","content":{"text":"Dicom requires the following information for lost or damaged package claims:","spans":[]}},{"type":"list-item","content":{"text":"Tracking number","spans":[]}},{"type":"list-item","content":{"text":"Cost or repair invoice for damages","spans":[]}},{"type":"list-item","content":{"text":"In the case of damaged goods, photos of the damages","spans":[]}},{"type":"heading3","content":{"text":"What happens if I miss my Dicom delivery?","spans":[]}},{"type":"paragraph","content":{"text":"Dicom states that if you miss a delivery, you need to contact their customer service team to reschedule your delivery date. Their phone number is 1-888-463-4266, and you can also email them at assistance@dicom.com.","spans":[]}},{"type":"paragraph","content":{"text":"To prevent missing the delivery of your packages, you can choose to pick them up at one of the many Dicom terminal locations. Please note, this may only be an option if you live in Ontario or Quebec. ","spans":[]}},{"type":"heading3","content":{"text":"What time will my Dicom package arrive?","spans":[]}},{"type":"paragraph","content":{"text":"Consult the following to know what time your Dicom package will arrive: ","spans":[]}},{"type":"paragraph","content":{"text":"Dicom has a transit time calculator that gives you an estimated time of arrival. ","spans":[]}},{"type":"paragraph","content":{"text":"When you placed your order, the online store likely gave you a rough estimate of what day your package will arrive. ","spans":[]}},{"type":"paragraph","content":{"text":"Circuit Package Tracker will show you when your package is out for delivery. Dicom packages are delivered to residences before 5:30 pm and businesses before 3:30 pm. ","spans":[]}},{"type":"heading3","content":{"text":"Where is my Dicom package?","spans":[]}},{"type":"paragraph","content":{"text":"Check Circuit Package Tracker for accurate details on your package's travel history, as well as where it currently is. Hopefully, this simple step answers your question.","spans":[]}},{"type":"paragraph","content":{"text":"If it doesn't, there is a chance your items are still at the original destination. For example, they may still be in a warehouse if the company oversold some of your items and then ran out. If Circuit is telling you that your package hasn't shipped, or it has, but there have been no updates since, please contact the merchant or seller's customer service team. ","spans":[]}},{"type":"paragraph","content":{"text":"Your Dicom package can also remain stuck in transit or be sent back to the warehouse for other reasons, such as: ","spans":[]}},{"type":"list-item","content":{"text":"Incomplete or incorrect address","spans":[]}},{"type":"list-item","content":{"text":"Inability to enter the United States (absence of the proper documents)","spans":[]}},{"type":"list-item","content":{"text":"Improper packaging ","spans":[]}},{"type":"paragraph","content":{"text":"If your package is lost, the merchant or seller will need to file a claim with Dicom/GLS. If your package is lost in transit, you should contact both the merchant and Dicom so they can start working together to resolve the problem. ","spans":[]}},{"type":"heading3","content":{"text":"Where is my Dicom tracking number?","spans":[]}},{"type":"paragraph","content":{"text":"Your Dicom tracking number is given to you by the online retailer you purchased your items from. In your shipment confirmation email from the store, you'll see the tracking number, and you can copy and paste it into Circuit. ","spans":[]}},{"type":"paragraph","content":{"text":"If you are the shipper, you can find your shipment information by logging into your account. You can then see your shipping history, as well as your tracking numbers. ","spans":[]}},{"type":"heading3","content":{"text":"Why is my Dicom package not moving?","spans":[]}},{"type":"paragraph","content":{"text":"We've already noted that your package could be stuck at the warehouse for several reasons. Some other reasons for package delays include poor weather, which many Canadians are familiar with. Canadian winters, in particular, cause dangerous driving conditions for transport trucks. ","spans":[]}},{"type":"paragraph","content":{"text":"Packaging Blog also notes that dangerous weather can cause power outages and facility closures. Other reasons for delays include overwhelmed couriers and high package volume. But, again, you can trust Circuit Package Tracker will have an explanation for your delayed package. ","spans":[]}},{"type":"heading3","content":{"text":"Why is my Dicom package pending?","spans":[]}},{"type":"paragraph","content":{"text":"A \"pending\" message means that Dicom is aware of your shipment and that it will be moving through their transit system soon. When your shipment is still pending, it also gives you time to make sure all relevant information is correct before it ships.","spans":[]}}],"type":"package_tracker_carriers","tags":[],"lang":"en-us","grouplang":"YNDk5xEAACMAGeVS"}