{"slug":"hong-kong-post","carrier_id":"HongKongPost","carrier_title":"Hong King Post","uk_english":false,"description":[{"type":"paragraph","content":{"text":"Hong Kong Post was originally founded in 1841 by Royal Mail when Hong Kong was still a colony of Great Britain. Hong Kong chose to keep Hong Kong Post in its current form when Britain handed over Hong Kong to China in 1997. Now, Hong Kong Post has been delivering packages for over 180 years and has grown to be responsible for delivering anything from supplies to personal packages to over 200 countries across the globe.","spans":[{"start":0,"end":14,"type":"hyperlink","data":{"url":"https://www.hongkongpost.hk/en/home/index.html"}},{"start":49,"end":59,"type":"hyperlink","data":{"url":"https://www.royalmail.com/"}}]}},{"type":"heading2","content":{"text":"Frequently Asked Questions","spans":[]}},{"type":"heading3","content":{"text":"Can I Track a Hong Kong Post Package Without a Tracking Number?","spans":[]}},{"type":"paragraph","content":{"text":"You are, unfortunately, unable to track a package without a tracking number. Luckily, most merchants or online storefronts will send you an email confirmation of your order that will have your tracking number. Other times they will send it in the form of an SMS to your mobile device. If you cannot find your tracking number in either of these places and you have an account online with the merchant or online storefront, check your recent orders for tracking information. If all else fails, contact the merchant or online storefront you ordered from for more information.","spans":[]}},{"type":"heading3","content":{"text":"Does Circuit Offer Better Package Tracking Than Hong Kong Post?","spans":[]}},{"type":"paragraph","content":{"text":"With Circuit Package Tracker you can have the peace of mind of knowing where your valuable package is at all times at the click of the button. All you need to do is enter your tracking number and we will do the work for you, no need to even know the courier carrying your package. We also offer the Circuit Package Tracker app for on-the-go tracking of your package, meaning you can truly check your package’s location at any time anywhere. Circuit knows how important it is for you to know where your package is at all times.","spans":[{"start":5,"end":28,"type":"hyperlink","data":{"url":"https://getcircuit.com/package-tracker"}}]}},{"type":"heading3","content":{"text":"How Late Does Hong Kong Post Deliver?","spans":[]}},{"type":"paragraph","content":{"text":"The time Hong Kong Post delivery drivers end their day domestically depends on your location, but typically deliveries stop around 5 or 6 PM local time on weekdays and 1 PM on Saturdays with no delivery on national holidays or Sundays. If your package is shipping internationally, delivery times will depend on your local courier. In some cases, delivery times may also vary on whether or address is residential, rural, or commercial.","spans":[]}},{"type":"heading3","content":{"text":"How Long Does It Usually Take to Deliver an International Package with Hong Kong Post?","spans":[]}},{"type":"paragraph","content":{"text":"Packages shipping internationally from Hong Kong may take 6 to 28 days to arrive at their destination depending on the service chosen and the destination country’s proximity to Hong Kong. They do offer express options for international packages that reduce the time to 4 to 10 working days. Hong Kong Post does not move or ship mail on Sundays or national holidays, which is something to keep in mind when determining the shipping speed of a package.","spans":[]}},{"type":"heading3","content":{"text":"How Long Will Hong Kong Post Hold a Package?","spans":[]}},{"type":"paragraph","content":{"text":"In some cases, Hong Kong Post will be unable to deliver your package, whether that is due to being unable to reach your door or your package requires a signature and you are not home. If Hong Kong Post cannot deliver your package, they will hold your package for 15 working days before returning the package to the sender. However, this only applies to domestic deliveries. If receiving a package internationally, hold times will depend on your local courier as Hong Kong Post only sees your package through customs before passing it off to your local courier. If Hong Kong Post cannot read the address or the address is incorrect, it typically is sent to the lost mail department.","spans":[]}},{"type":"heading3","content":{"text":"How Do I Sign for a Hong Kong Post Package?","spans":[]}},{"type":"paragraph","content":{"text":"Packages that are valuable, insured or contained sensitive information often require a signature before being released to the recipient. If your package requires a signature, your delivery person will let you know and ask that you sign electronically on a device with a tablet pen, both of which your courier’s delivery driver will provide, before releasing the package to you. If your package requires a signature and you are not home when Hong Kong Post or your local courier attempts delivery, you will have to pick it up the next day at the nearest post office to sign.","spans":[]}},{"type":"heading3","content":{"text":"How Do I Track a Hong Kong Post Package with Circuit?","spans":[]}},{"type":"paragraph","content":{"text":"To track your Hong Kong Post package with Circuit all you need to do is enter your tracking number into the white box on the Circuit Package Tracker page. From there, we do all the work and find out exactly where your package is and who has it for you. We also have the Circuit Package Tracker app that can be found in your mobile device’s app store for added convenience, letting your track all your packages on the go at all times.","spans":[]}},{"type":"heading3","content":{"text":"What Do I Do If I Have Not Received My Hong Kong Post Package?","spans":[]}},{"type":"paragraph","content":{"text":"If your package has not arrived by the expected arrival date, check your package’s location on Circuit Package Tracker. Packages may be delayed by weather, operational backlogs, weekends, national holidays, or issues at customs if shipping internationally. If Circuit Package Tracker says your package has been delivered and it is not on your doorstep, reach out to your local courier to see if it is still out for delivery or if your package required a signature and needs to be picked up at your local courier’s nearest post office.","spans":[]}},{"type":"heading3","content":{"text":"What Happens If Hong Kong Post Loses My Package?","spans":[]}},{"type":"paragraph","content":{"text":"Hong Kong Post insures most, but not all, of its packages against loss or damage. In most cases, Hong Kong Post will attempt to find the package for you before reimbursing you for the value of your package. This is why it is always a good idea, to be honest when reporting the contents of a package for shipping. However, this only applies if your package was in Hong Kong or had yet to reach its destination country and was still in Hong Kong Post’s hands. If your package had reached its destination country and passed customs, the liability falls on your local courier, at which point you would need to contact your local courier for more information.","spans":[{"start":0,"end":14,"type":"hyperlink","data":{"url":"https://www.hongkongpost.hk/en/contact_us/index.html"}}]}},{"type":"heading3","content":{"text":"What Happens If I Miss My Hong Kong Post Package Delivery?","spans":[]}},{"type":"paragraph","content":{"text":"If you are not home and you miss your package delivery, Hong Kong Post will leave the package at your doorstep unless your package requires a signature before being released. If your package requires a signature, they will return it to the nearest Hong Kong Post Office after leaving a note. At this point, you have 15 working days to pick up and sign for your package before Hong Kong Post returns your package to the sender. If receiving a package internationally, the procedure is typically the same for most post offices, with only the hold times changing.","spans":[]}},{"type":"heading3","content":{"text":"What Time Will My Hong Kong Post Package Arrive?","spans":[]}},{"type":"paragraph","content":{"text":"If your destination country is Hong Kong, your package’s arrival time depends largely on the service you chose. Typically, packages arrive before 5 PM or 6 PM local time during weekdays and 1 PM local time on Saturdays, but these times are expedited with their express options. If your destination country is international, delivery times depend on your local courier delivery times and where you sit on your delivery driver’s route for the day. The express option will still expedite your local courier’s times, as the service costs extra.","spans":[]}},{"type":"heading3","content":{"text":"Where Is My Hong Kong Post Package?","spans":[]}},{"type":"paragraph","content":{"text":"By entering your tracking number into the Circuit Package Tracker, you can know exactly where your package is at all times. Whether sailing across the ocean or flying over another continent, we will find your package. If your package appears as pending, this just means the courier has not shipped it yet. In some cases, packages may arrive after the expected arrival date due to weather, operational backlogs, or other events outside of the courier’s control.","spans":[]}},{"type":"heading3","content":{"text":"Why Is My Hong Kong Post Package Not Moving?","spans":[]}},{"type":"paragraph","content":{"text":"Many couriers like Hong Kong Post use milestone tracking for simpler tracking for international packages. This means if your package is moving across a country, you may just see the country name for a few days, not the exact location as it moves towards you. Other times, this may be due to weather events, weekends, operational backlogs, or national holidays in the country your package is traveling through. If your package is shipping internationally has just reached its destination country, your package may be going through customs, a process that cannot be rushed.","spans":[]}},{"type":"heading3","content":{"text":"Why Is My Hong Kong Post Package Pending?","spans":[]}},{"type":"paragraph","content":{"text":"Before a package is scanned onto a truck, plane, or ship to start its journey to you, it may appear as pending as it waits to be processed by Hong Kong Post. If you ordered during a national holiday, weekend, or during a busy season such as winter, your package may appear as pending for longer than normal as the courier catches up. If your package is pending longer than normal, contact Hong Kong Post either by phone or email for more information on your package's whereabouts.","spans":[{"start":389,"end":403,"type":"hyperlink","data":{"url":"https://www.hongkongpost.hk/en/contact_us/index.html"}}]}},{"type":"paragraph","content":{"text":"If you’re sending or waiting for a package with the Hong King Post and you want to know exactly where it is, try Circuit Package Tracker for free.","spans":[{"start":0,"end":52,"type":"em"},{"start":66,"end":146,"type":"em"},{"start":109,"end":145,"type":"strong"},{"start":109,"end":145,"type":"hyperlink","data":{"url":"https://getcircuit.com/package-tracker"}}]}}],"type":"package_tracker_carriers","tags":[],"lang":"en-us","grouplang":"YNDk6xEAABEKGeV0"}