{"slug":"estafeta","carrier_id":"Estafeta","carrier_title":"Estafeta","uk_english":false,"description":[{"type":"paragraph","content":{"text":"Trouble finding your Estafeta package? Find out where your Estafeta package is with Circuit package tracking.","spans":[]}},{"type":"heading2","content":{"text":"Estafeta","spans":[]}},{"type":"paragraph","content":{"text":"Estafeta was established in 1979, making it the first company to offer door-to-door and same-day delivery services in Mexico. Since then, Estafeta has grown to ship all over North America and offer door-to-door services to Honduras, Mexico, Guatemala, Costa Rica, El Salvador, and Nicaragua. They now also ship everything from automotive to commercial to personal packages, making them one of Central America’s leading package couriers.","spans":[{"start":0,"end":8,"type":"hyperlink","data":{"url":"https://www.estafeta.com/en"}}]}},{"type":"heading2","content":{"text":"Frequently Asked Questions","spans":[]}},{"type":"heading3","content":{"text":"Can I Track an Estafeta Package Without a Tracking Number?","spans":[]}},{"type":"paragraph","content":{"text":"Unfortunately, you will need your tracking number from Estafeta to track your package. Luckily, there are a few places you can find your tracking number. Merchants and online storefronts usually send your tracking information in your order confirmation email or SMS to your mobile device. If they have not sent it to you, check your online account with the merchant, as it is usually in your purchase details. Orders made in a physical storefront may have had the tracking information generated on the receipt given to you.","spans":[]}},{"type":"heading3","content":{"text":"Does Circuit Offer Better Tracking Than Estafeta?","spans":[]}},{"type":"paragraph","content":{"text":"Circuit understands how important it is to know your package is going to reach its destination as safely and as quickly as possible. That is why we make it as easy as possible to track your package’s progress on its way to its destination with the Circuit Package Tracker. All you need to do is enter your tracking number and let us do the rest, within seconds we will know the location of your package. If you are on the go, we also offer the Circuit Package Tracker app available in your mobile device’s app store.","spans":[{"start":248,"end":271,"type":"hyperlink","data":{"url":"https://getcircuit.com/package-tracker"}}]}},{"type":"heading3","content":{"text":"How Late Does Estafeta Deliver?","spans":[]}},{"type":"paragraph","content":{"text":"Delivery times with Estafeta vary by region and by your address’s location, as delivery times to more rural addresses may run earlier or later. Packages shipping to Central America also have door-to-door next-day services available. However, you can schedule what time your package will be delivered for the time most convenient to you. International delivery times will also vary if Estafeta needs to hand your package off to end-of-mile delivery service in your area.","spans":[{"start":204,"end":221,"type":"hyperlink","data":{"url":"https://www.estafeta.com/Servicios/MYP/Nacional/Horarios-garantizados"}}]}},{"type":"heading3","content":{"text":"How Long Does It Usually Take to Deliver an International Package with Estafeta?","spans":[]}},{"type":"paragraph","content":{"text":"The average time it takes to deliver a package internationally with Estafeta is 3 business days, but may take less if your package’s destination country is in Central America. Estafeta works as hard as possible to get your package to you as quickly as possible. However, these times may be delayed by weather events, operational backlogs, national holidays, weekends, and more, all of which are largely outside of Estafeta’s control. If your package is shipping internationally, it may get caught up in customs while your country’s customs team inspects your package.","spans":[]}},{"type":"heading3","content":{"text":"How Long Will Estafeta Hold a Package?","spans":[]}},{"type":"paragraph","content":{"text":"If you miss your Estafeta package delivery, Estafeta will typically leave your package at your door. However, there may be times you simply are not available or the Estafeta delivery driver cannot reach your door. If this is the case, the time Estafeta will hold your package before returning it to the sender will largely depend on how much space they have for package holds and if there is an Estafeta center near you. If you are unable to receive your package at home, it is best to call Estafeta for more information regarding your package.","spans":[]}},{"type":"heading3","content":{"text":"How Do I Sign for an Estafeta Package?","spans":[]}},{"type":"paragraph","content":{"text":"There may be times your package requires you to sign for it before your courier will release the package to you. Usually, this is when your package either contains sensitive information, is high in value, or has a signed for service request attached to it. If this is the case, your Estafeta delivery driver will have a tablet and tablet pen for you to electronically sign with. If a physical signature is required, your Estafeta delivery driver will have a paper for you to sign with a pen. In both cases, you will usually receive a copy of both documents.","spans":[]}},{"type":"heading3","content":{"text":"How Do I Track My Package with Circuit?","spans":[]}},{"type":"paragraph","content":{"text":"Circuit makes tracking your packages easy and quick. All you need to do is enter your tracking number in the white box on the Circuit Package Tracker webpage and we will have your package tracked within seconds. We at Circuit know the worry that comes with not knowing your package’s location or if it is safe, which is why we also offer the Circuit Package Tracker app available in your mobile device’s app store. This way, no matter where you are you can track your package’s movements on its way to its destination, even if you are half a world away.","spans":[]}},{"type":"heading3","content":{"text":"What Do I Do If I Haven't Received My Package from Estafeta?","spans":[]}},{"type":"paragraph","content":{"text":"If it is past your package’s expected arrival date, use the Circuit Package Tracker to see where your package was last. It may be that your package was delayed by weather, customs, or an operational backlog if you ordered during a busy season like the winter holidays. If your package says it was delivered or has been sitting in the same spot for too long, contact Estafeta to see if they can inform you of any delays or find your package.","spans":[]}},{"type":"heading3","content":{"text":"What Happens if Estafeta Loses My Package?","spans":[]}},{"type":"paragraph","content":{"text":"If you receive the notification your package has been delivered, only to open the door and find no package, contact Estafeta. It may be that your package is still out for delivery, but your driver accidentally scanned your package too early. In any case, Estafeta will ask for your tracking information and ask you to describe the contents of the package to them. From there, they will attempt to locate your package or decide whether or not to reimburse you. No matter what, it is best to contact Estafeta as soon as possible, as many couriers have a time limit to contact them for lost or damaged packages.","spans":[{"start":490,"end":506,"type":"hyperlink","data":{"url":"https://www.estafeta.com/Atencion-al-Cliente/Indemnizacion"}}]}},{"type":"heading3","content":{"text":"What Happens If I Miss My Estafeta Delivery?","spans":[]}},{"type":"paragraph","content":{"text":"If you are not home when Estafeta attempts to deliver your package, they will either leave it in your mailbox or on your doorstep. However, for packages that are high in value, contain sensitive information, or have a signed service request attached to them, your package will be returned to the nearest Estafeta package center. Once your package has been returned to the Estafeta package center, you will have to contact them to either reschedule a delivery or pick up your package.","spans":[{"start":280,"end":327,"type":"hyperlink","data":{"url":"https://www.estafeta.com/Atencion-al-Cliente/Preguntas-frecuentes"}}]}},{"type":"heading3","content":{"text":"What Time Will My Estafeta Package Arrive?","spans":[]}},{"type":"paragraph","content":{"text":"Estafeta package arrival times are in the sender’s hands, as you can schedule your delivery for a time convenient to you. Times may be delayed, however, if there is extreme weather, traffic, or operational backlogs, all of which are largely out of Estafeta’s hands.","spans":[]}},{"type":"heading3","content":{"text":"Where is My Estafeta Package?","spans":[]}},{"type":"paragraph","content":{"text":"By using the Circuit Package Tracker, you can know exactly where your package is at any time. You can also use the Circuit Package Tracker app available in your mobile device’s app store, for easy package tracking on the go. If your package appears as pending, however, it just means it has not started its journey to you yet. If your package has held still at the border of your destination country, it likely is still going through customs.","spans":[{"start":13,"end":36,"type":"hyperlink","data":{"url":"https://getcircuit.com/package-tracker"}}]}},{"type":"heading3","content":{"text":"Where is My Estafeta Tracking Number?","spans":[]}},{"type":"paragraph","content":{"text":"There are a few different places you can find your Estafeta tracking number. The first, and most frequently used, is your email inbox or SMS inbox on your mobile device. Many merchants and online storefronts prefer to send tracking information in your order confirmation email or SMS so that there is digital evidence that is not as easy to lose. Other times, if you have an online account with the merchant or online storefront, it may be in your order details in your purchase history. Physical storefronts may also choose to print your tracking information on your receipt after you have checked out, instead of or on top of a digital copy.","spans":[]}},{"type":"paragraph","content":{"text":"If your tracking information is in none of these locations, contact the merchant or online storefront you originally ordered from to track down your package information.","spans":[]}},{"type":"heading3","content":{"text":"Why is My Estafeta Package Not Moving?","spans":[]}},{"type":"paragraph","content":{"text":"Some couriers prefer to use milestone tracking for packages. This may be because your package is traveling a short distance or internationally, and it makes more sense to only update the package when it experiences a major shipping event. Major shipping events can include reaching the destination country or being out for delivery. Milestone tracking makes things easier on the courier but may make it seem like your package is not moving.","spans":[]}},{"type":"heading3","content":{"text":"Why is My Estafeta Package Pending?","spans":[]}},{"type":"paragraph","content":{"text":"If you ordered on a weekend, national holiday, large weather event, or during a major sale event your package may appear as pending. Pending packages can mean a few different things. It might mean that Estafeta has picked up your package and is getting ready to sort it or it can mean your package is waiting to be scanned onto the plane or truck taking it to you. It can also mean that the merchant or online storefront has generated the tracking information, but has yet to send the package out.","spans":[]}},{"type":"paragraph","content":{"text":"If you’re sending or waiting for a package with Estaferta and you want to know exactly where it is,try Circuit Package Tracker for free.","spans":[{"start":0,"end":136,"type":"em"},{"start":99,"end":135,"type":"strong"},{"start":99,"end":135,"type":"hyperlink","data":{"url":"https://getcircuit.com/package-tracker"}}]}}],"type":"package_tracker_carriers","tags":[],"lang":"en-us","grouplang":"YNDk7BEAACMAGeV-"}