{"slug":"canada-post","carrier_id":"CanadaPost","carrier_title":"Canada Post","uk_english":false,"description":[{"type":"paragraph","content":{"text":"‏Canada Post is the primary postal operator in Canada and the country’s leading business-to-consumer delivery offer. They offer courier express services, freight forwarding services, and logistics services. ‏","spans":[{"start":0,"end":12,"type":"hyperlink","data":{"preview":{"title":"https://www.canadapost-postescanada.ca/"},"url":"https://www.canadapost-postescanada.ca/"}}]}},{"type":"paragraph","content":{"text":"‏They deliver to 6.2 million addresses and have the largest retail network in the country with over 6,200 post offices. They aim to offer an affordable and reliable service, including convenient pickup and return options for all their customers.‏","spans":[]}},{"type":"paragraph","content":{"text":"‏Canada Post operates as a group of companies called ‘The Canada Post Group’ and has an annual revenue of $8.2 billion combined. Along with their subsidiaries, Canada Post delivers over 8 billion items of mail, packages, and messages every year.‏","spans":[]}},{"type":"heading2","content":{"text":"‏Background and a short history‏","spans":[]}},{"type":"paragraph","content":{"text":"‏Canada Post was founded in 1867 and was initially known as Royal Mail Canada until it rebranded to Canada Post during the late 1960s. During the early years, Canada Post operated as the Post Office Department created by the government.‏","spans":[]}},{"type":"paragraph","content":{"text":"‏In 1981, Canada Post became a Crown Corporation. Since then, the postal company has been following the Canada Post Corporation Act set out by the federal government. This legislation legally guarantees a standard-level postal service to all Canadians. ‏","spans":[]}},{"type":"paragraph","content":{"text":"‏In 2000, Canada Post created a company called Epost. This company allowed customers to receive their bills online for free. Then, in 2007, Candas Post integrated Epost into the company.‏","spans":[]}},{"type":"heading3","content":{"text":"‏Who is Canada Post?‏","spans":[]}},{"type":"paragraph","content":{"text":"‏The Canada Post Group consists of Canada Post, Purolator, SCI Group, and Innovapost. ‏","spans":[{"start":48,"end":57,"type":"hyperlink","data":{"preview":{"title":"https://www.purolator.com/"},"url":"https://www.purolator.com/"}},{"start":59,"end":68,"type":"hyperlink","data":{"preview":{"title":"https://www.scigrp.com/"},"url":"https://www.scigrp.com/"}},{"start":74,"end":84,"type":"hyperlink","data":{"preview":{"title":"https://innovapost.com/"},"url":"https://innovapost.com/"}}]}},{"type":"list-item","content":{"text":"‏Purolator is Canada’s most influential freight, package, and logistics solutions offer that has been operating for over 50 years.‏","spans":[]}},{"type":"list-item","content":{"text":"‏SCI Group specializes in logistics and transportation management solutions for companies.‏","spans":[]}},{"type":"list-item","content":{"text":"‏Innovapost is an information technology shared services offer that supplies IT and business solutions to the other group members. ‏","spans":[]}},{"type":"paragraph","content":{"text":"‏Together they are the most prominent transportation fleet in Canada, with approximately 64,000 full and part-time employees. ‏","spans":[]}},{"type":"paragraph","content":{"text":"‏The Group’s vision is to become a world leader in offering innovative physical and electronic delivery solutions to Canada and beyond. They also collaborate with many large and small Canadian businesses, helping them to compete and succeed in their industries. The Canada Post Group actively uses its position to empower enterprises and local communities and strengthen the economy.‏","spans":[]}},{"type":"paragraph","content":{"text":"‏The headquarters is in Ottawa, Ontario, and the president and CEO of Canada Post is Doug Ettinger. Other key personnel are Anita Anand, the company’s minister, and Jessica L. McDonald, the board’s chair.‏","spans":[]}},{"type":"heading3","content":{"text":"‏What do they deliver?‏","spans":[]}},{"type":"paragraph","content":{"text":"Canada Post delivers personal and business letters and packages of all weights and sizes. They offer many door-to-door services, such as registered mail, priority mail, express post, expedited package, and mail forwarding,‏","spans":[]}},{"type":"paragraph","content":{"text":"‏You can privately send letters and packages by the Post Office or register your business for their business mailing services. They also work with many online retail stores and marketplaces, delivering items to their customers for them.‏","spans":[]}},{"type":"paragraph","content":{"text":"‏Canada Post will deliver most types of items, but there are some restrictions. For example, they will not send any items prohibited by law, such as illegal, obscene, or fraudulent items, or anything explosive, highly flammable, or dangerous in any way. Moreover, with international mail, restrictions will differ from country to country.‏","spans":[]}},{"type":"paragraph","content":{"text":"‏There are also ‘controlled items’ that can be mailed and delivered within Canada only if they meet specific needments. However, they must be appropriately prepared and abide by government regulations. Controlled items include tobacco and vaping products, firearms, alcohol, and perishable items.‏","spans":[]}},{"type":"heading3","content":{"text":"‏Where does Canada Post deliver?‏","spans":[]}},{"type":"paragraph","content":{"text":"Domestically all over Canada, including remote areas. They also send mail internationally to the US and over 190 countries worldwide, so you can send and receive package from almost anywhere. This includes the UK, Australia, New Zealand, and Europe. They also deliver to most parts of the Middle East, Africa, Southeast Asia, China, India, and South & Central America.‏","spans":[]}},{"type":"paragraph","content":{"text":"If you’re sending or waiting for a delivery from Canada Post and you want to know exactly where it is, try Circuit Package Tracker for free now.","spans":[]}},{"type":"paragraph","content":{"text":"If you’re sending or waiting for a package with  Canada Post and you want to know exactly where it is, try Circuit Package Tracker for free now.Frequently Asked Questions‏","spans":[{"start":0,"end":144,"type":"em"},{"start":107,"end":143,"type":"hyperlink","data":{"preview":{"title":"https://getcircuit.com/package-tracker"},"url":"https://getcircuit.com/package-tracker"}}]}},{"type":"heading3","content":{"text":"‏Can I track a Canada Post package without a tracking number?‏","spans":[]}},{"type":"paragraph","content":{"text":"‏Unfortunately not, the only way to track a package is with a tracking number. Therefore, you will be unable to locate a package without its unique digits. Furthermore, Canada Post is unable to look up the tracking number for you if you lose it. This is because they do not keep shipment records by address or name for privacy reasons. ‏","spans":[]}},{"type":"heading3","content":{"text":"‏Does Circuit offer better tracking than Canada Post?‏","spans":[]}},{"type":"paragraph","content":{"text":"‏What is unique about Circuit is that our package tracker works for almost any courier company or delivery service worldwide. In contrast, Canada Post package tracking can only track packages  sent by them. This gives you peace of mind knowing that you can locate your valuable items regardless of the delivery company used.‏","spans":[]}},{"type":"paragraph","content":{"text":"‏Circuit Package Tracker connects with a wide range of different postal and mailing systems and services to offer fast and accurate tracking. These systems include but are not limited to Australia Post, Deutsche Post, FedEx, Hermes, Yodel, Royal Mail, and various DHL services, including eCommerce, Freight, and Express.‏","spans":[]}},{"type":"paragraph","content":{"text":"‏What’s more, Circuit is the best tracker for USPS tracking Canada Post packages, as it shows the exact location of your items once they arrive in the US.‏","spans":[]}},{"type":"heading3","content":{"text":"‏How late does Canada Post deliver?‏","spans":[]}},{"type":"paragraph","content":{"text":"‏All Canada Post services, including Canada Post expedited package tracking, can be delivered between 9 am to 8 pm Monday to Friday for residents and from 9 am to 5 pm for businesses.‏","spans":[]}},{"type":"heading3","content":{"text":"‏How long does it usually take to deliver an international package with Canada Post?‏","spans":[]}},{"type":"paragraph","content":{"text":"‏The delivery standard for Canada Post packages sent from Canada to another country (except the US) is four to seven business days. For packages sent to the US, they will typically arrive in four to six business days. Remember that business days for Canada Post are Monday to Friday only.‏","spans":[]}},{"type":"paragraph","content":{"text":"‏However, this is only an estimate and not a guarantee. Canada Post tracking international package's can get stuck in customs for whatever reason. If this is the case, you should see this information with our international tracking tool, Circuit.‏","spans":[]}},{"type":"heading3","content":{"text":"‏How long will Canada Post hold a package?‏","spans":[]}},{"type":"paragraph","content":{"text":"‏Canada Post usually holds packages for 14 days. After 15 days, they will return the package to the sender. However, if you call them, the post office may hold it for longer if you’re unable to collect it within 14 days for whatever reason.‏","spans":[]}},{"type":"paragraph","content":{"text":"‏*Note that due to COVID-19, Canada post has currently suspended their standard 15-day hold period. They will not return uncollected packages to the sender until further notice. This is to avoid people coming to the post office when they are feeling unwell or self-isolating.‏","spans":[]}},{"type":"heading3","content":{"text":"‏How to sign for a Canada Post package‏","spans":[]}},{"type":"paragraph","content":{"text":"‏Many Canada Post packages need proof of delivery, so you will have to sign for it when it arrives. The delivery driver will have an electronic device with a stylus for you to electronically sign for it. While some couriers allow you to sign for a package online before it arrives, Canada Post does not have this option.‏","spans":[]}},{"type":"paragraph","content":{"text":"‏*Note that because of the COVID-19 pandemic, where possible, Canada Post is temporarily leaving signed-for items at your address without asking for a signature. The only exceptions are those that need proof of identity, proof of age, COD items, or packages with customs due.‏","spans":[]}},{"type":"heading3","content":{"text":"‏How to track a Canada Post package with Circuit‏","spans":[]}},{"type":"paragraph","content":{"text":"‏Tracking Canada Post packages with Circuit couldn’t be any easier! Enter your tracking number in the tracking code box, then click ‘Track my package.’ The tracker will automatically detect the mail carrier, so you don’t need to select from the dropdown list unless you want to. ‏","spans":[]}},{"type":"paragraph","content":{"text":"‏Once you click on ‘Track my package,’ your package information, including its current location, will appear immediately. ‏","spans":[]}},{"type":"heading3","content":{"text":"‏What do I do if I haven't received my package from Canada Post?‏","spans":[]}},{"type":"paragraph","content":{"text":"‏First, track the package using your tracking number to see what the delivery status says. If it is still in transit and within the estimated delivery time, sit tight and wait. However, if it should have arrived by now, and from the tracking, it appears that the package is not moving, get in touch with Canada Post. ‏","spans":[]}},{"type":"paragraph","content":{"text":"‏Alternatively, suppose the tracking states that delivery has been successful, but you have not received it. In that case, there are a few things you can do:‏","spans":[]}},{"type":"list-item","content":{"text":"‏First, check that the address is correct. If it is, check with everyone in the household or workplace to ensure someone else did not receive it on your behalf. ‏","spans":[]}},{"type":"list-item","content":{"text":"‏Look to see if the tracking shows a signature. If so, see if it matches anyone at the address.‏","spans":[]}},{"type":"list-item","content":{"text":"‏Check around the property as the delivery driver may have left it in a ‘safe drop’ location.‏","spans":[]}},{"type":"paragraph","content":{"text":"‏If you still have no luck, report the problem to Canada Post. You can do this by phone, social media, or by opening a service ticket on their website.‏","spans":[]}},{"type":"heading3","content":{"text":"‏What happens if Canada Post loses my package?‏","spans":[]}},{"type":"paragraph","content":{"text":"‏If you have been unsuccessful in locating your package and you believe Canada Post has lost it, you will need to make a claim. You can submit a service ticket on their website or get assistance from customer service on the online chat. They will advise you on the process and begin a search to locate your package.‏","spans":[]}},{"type":"heading3","content":{"text":"‏What happens if I miss my Canada Post delivery?‏","spans":[]}},{"type":"paragraph","content":{"text":"‏In most cases, when Canada Post attempts delivery when you’re not home, they will leave a delivery notice card. This card will have the details of the post office it has been taken to and its opening times so you can go there to pick it up. ‏","spans":[]}},{"type":"heading3","content":{"text":"‏What time will my Canada Post package arrive?‏","spans":[]}},{"type":"paragraph","content":{"text":"Canada Post delivers at residential properties between 9 am and 8 pm. So, if the tracking says it is out for delivery, it can come anytime between 9 am and 8 pm that day. This is also the case for Canada Post express tracking and priority packages.‏","spans":[]}},{"type":"heading3","content":{"text":"‏Where is my Canada Post package?‏","spans":[]}},{"type":"paragraph","content":{"text":"‏If you want to find out the location of your package, input your tracking number into the Circuit Package Tracker tool. You will then be able to see the exact location of your package, even if it is overseas. ‏","spans":[]}},{"type":"heading3","content":{"text":"‏Where is my Canada Post tracking number?‏","spans":[]}},{"type":"paragraph","content":{"text":"‏You can find your Canada Post tracking number at the bottom of your receipt or on the package. However, this is only the case for packages sent through the following services: Canada Post tracking Xpresspost, priority, or regular package, with delivery confirmation.‏","spans":[]}},{"type":"paragraph","content":{"text":"‏For tracking international Canada Post packages, you can find the tracking number on your copy of the shipping label as well as the receipt. This includes packages shipped to the US.‏","spans":[]}},{"type":"paragraph","content":{"text":"‏Suppose you are tracking an item you have ordered from a marketplace or online store. In that case, the tracking number should be on your dispatch confirmation email. All Canada Post tracking numbers are usually 11 or 13 numbers with the letters CA at the end.‏","spans":[]}},{"type":"heading3","content":{"text":"‏Why is my Canada Post package not moving?‏","spans":[]}},{"type":"paragraph","content":{"text":"‏Sometimes, packages get delayed for various reasons, including if the delivery company is currently experiencing delays. It may stay stuck in a depot for a few days as the postal staff work through a backlog. Or, with Canada Post international tracking, it could be held up at customs out of Canada Post’s control.‏","spans":[]}},{"type":"paragraph","content":{"text":"‏It’s worth noting that occasionally a technical problem could prevent the tracking status from updating. If this happens, it may appear stuck when it is moving. ‏","spans":[]}},{"type":"heading3","content":{"text":"‏Why is my Canada Post package pending?‏","spans":[]}},{"type":"paragraph","content":{"text":"‏If your Canada Post tracking information says ‘pending,’ it most likely means that your package has a shipping label created, but Canada Post hasn’t received it yet. Alternatively, they may have received it but not yet processed it for delivery.","spans":[]}},{"type":"paragraph","content":{"text":"If you’re sending or waiting for a delivery from Canada Post and you want to know exactly where it is, try Circuit Package Tracker for free now.","spans":[{"start":0,"end":144,"type":"em"}]}},{"type":"paragraph","content":{"text":"If you’re sending or waiting for a package with the Canada Post and you want to know exactly where it is, try Circuit Package Tracker for free.","spans":[{"start":0,"end":143,"type":"em"},{"start":106,"end":142,"type":"strong"},{"start":106,"end":142,"type":"hyperlink","data":{"url":"https://getcircuit.com/package-tracker"}}]}}],"type":"package_tracker_carriers","tags":[],"lang":"en-us","grouplang":"YNDk6xEAAJMfGeVz"}