{
  "slug": "flex-app-reviews",
  "time_to_read": "time to read",
  "title": "These 11 Brave Flex App Reviews Say It Isn’t Easy to Use (Here’s Why and What to Do)",
  "abstract": [],
  "author": {
    "id": "Yg60FBEAACEAeKI0",
    "wioUrl": "wio://documents/Yg60FBEAACEAeKI0"
  },
  "product": "route-planner",
  "description": [
    {
      "type": "paragraph",
      "content": {
        "text": "Before you start as an Amazon driver, let’s take a look at the Flex app reviews and whether you can trust it",
        "spans": []
      }
    }
  ],
  "featured_image": {
    "origin": {
      "id": "",
      "url": "https://wordpress.getcircuit.com/wp-content/uploads/2021/11/59a02948-2610-4d28-b7a9-4159465ca3ad.png",
      "width": 2224,
      "height": 1288
    }
  },
  "body": [
    {
      "key": "rich_text$e9ede6f0-d3b6-404c-96be-a694d70c776c",
      "value": {
        "variation": "default-slice",
        "items": [
          {}
        ],
        "primary": {
          "content": [
            {
              "type": "paragraph",
              "content": {
                "text": "Looking for a great new job, a way to supplement an existing one, or maybe a new delivery driver experience?",
                "spans": []
              }
            },
            {
              "type": "paragraph",
              "content": {
                "text": "Being a driver for Amazon is an option.",
                "spans": []
              }
            },
            {
              "type": "paragraph",
              "content": {
                "text": "The new Amazon Flex app has created opportunities for drivers looking for work, or for those thinking about becoming a delivery driver.",
                "spans": []
              }
            },
            {
              "type": "paragraph",
              "content": {
                "text": "But Flex also raises questions, like is the Amazon Flex app safe? How easy is it to use and what are the Amazon Flex App reviews?",
                "spans": []
              }
            },
            {
              "type": "paragraph",
              "content": {
                "text": "Here’s what we’ll cover:",
                "spans": []
              }
            },
            {
              "type": "list-item",
              "content": {
                "text": "Is Amazon Flex a real app?",
                "spans": []
              }
            },
            {
              "type": "list-item",
              "content": {
                "text": "Can Amazon Flex be trusted?",
                "spans": []
              }
            },
            {
              "type": "list-item",
              "content": {
                "text": "Amazon Flex app reviews ",
                "spans": []
              }
            },
            {
              "type": "list-item",
              "content": {
                "text": "The best delivery route planner apps",
                "spans": []
              }
            },
            {
              "type": "paragraph",
              "content": {
                "text": "Before you take the leap as an Amazon Flex driver, let’s take a look at how it works and whether you can trust it. We’ll run down 11 Amazon Flex app reviews that say it isn’t easy to use, and help you out with suggestions for other apps you may need as a courier. ",
                "spans": []
              }
            },
            {
              "type": "heading2",
              "content": {
                "text": "Is Amazon Flex A Real App?",
                "spans": []
              }
            },
            {
              "type": "image",
              "content": {
                "text": "",
                "spans": []
              },
              "data": {
                "origin": {
                  "url": "https://wordpress.getcircuit.com/wp-content/uploads/2021/11/398bf960-4f0b-4cf7-81a9-fcbf6ff653e3-1024x593.png"
                },
                "alt": "These 11 Brave Flex App Reviews Say It Isn't Easy to Use. Is Amazon Flex A Real App?"
              }
            },
            {
              "type": "paragraph",
              "content": {
                "text": "Amazon Flex is the app that e-commerce giant Amazon has released that allows drivers to work for the Amazon Flex courier service. It’s similar to other on-demand driver jobs like Uber, except that you deliver packages instead of people. You’ll pick up packages from the fulfillment centers of Amazon or partner stores, and deliver them to their destinations using your own vehicle.",
                "spans": []
              }
            },
            {
              "type": "paragraph",
              "content": {
                "text": "Drivers can handle delivery for Amazon Prime Now, which are time-sensitive deliveries, or Amazon Logistics Delivery, which range from same-day to regular shipping times.",
                "spans": []
              }
            },
            {
              "type": "paragraph",
              "content": {
                "text": "It’s relatively easy to get started and get on the road to becoming an Amazon Flex driver:",
                "spans": [
                  {
                    "type": "hyperlink",
                    "data": {
                      "url": "/how-to-become-an-amazon-flex-driver"
                    },
                    "start": 59,
                    "end": 89
                  }
                ]
              }
            },
            {
              "type": "image",
              "content": {
                "text": "",
                "spans": []
              },
              "data": {
                "origin": {
                  "url": "https://wordpress.getcircuit.com/wp-content/uploads/2021/09/dbb9f306-25d8-499e-b69c-486550ae79f2-1-1024x593.jpg"
                },
                "alt": "These 11 Brave Flex App Reviews Say It Isn't Easy to Use: Amazon Flex App"
              }
            },
            {
              "type": "o-list-item",
              "content": {
                "text": "Download the Amazon Flex app onto your mobile device, as it’s available at the Apple store, on Google Play, or at the Amazon Flex website.",
                "spans": []
              }
            },
            {
              "type": "o-list-item",
              "content": {
                "text": "Once installed, create a new account or sign in using an existing Amazon account.",
                "spans": []
              }
            },
            {
              "type": "o-list-item",
              "content": {
                "text": "Answer some qualifying questions. Some of these are to give permission to the app to access various components of your mobile device: GPS, camera and phone. Others ask about your availability, zip code, and the type of vehicle you will use to deliver for Amazon Flex.",
                "spans": []
              }
            },
            {
              "type": "o-list-item",
              "content": {
                "text": "Supply additional information, such as work history, educational background, among others, so the company can do a background check. From here, it will ask for required documents and payment details.",
                "spans": []
              }
            },
            {
              "type": "paragraph",
              "content": {
                "text": "Then you simply wait for the background check and soon you’ll be ready to drive.",
                "spans": []
              }
            },
            {
              "type": "heading2",
              "content": {
                "text": "Can Amazon Flex Be Trusted?",
                "spans": []
              }
            },
            {
              "type": "paragraph",
              "content": {
                "text": "Is Amazon Flex legit? Yes, it is, although you’ll need to check whether jobs with Amazon Flex are available in your city or area. If not, you can create an account and wait for Amazon to recruit drivers.",
                "spans": []
              }
            },
            {
              "type": "image",
              "content": {
                "text": "",
                "spans": []
              },
              "data": {
                "origin": {
                  "url": "https://wordpress.getcircuit.com/wp-content/uploads/2021/11/fd1ca874-cdee-44ac-a98d-2ffe4809d42f-1024x593.jpg"
                },
                "alt": "These 11 Brave Flex App Reviews Say It Isn't Easy to Use: Can Amazon Flex be trusted?"
              }
            },
            {
              "type": "paragraph",
              "content": {
                "text": "If you are signed on, you choose a delivery block and follow the app’s instructions to make your deliveries. Since you added bank account information when you created the account, you should be paid in a few days. Amazon usually processes pay twice a week. The app also tracks your pay on the earnings screen.",
                "spans": []
              }
            },
            {
              "type": "paragraph",
              "content": {
                "text": "Depending on which Amazon service you choose to work for, there are different requirements for drivers. Amazon Prime Now requires time-sensitive deliveries, sometimes within an hour, for which customers pay a premium. As a result, you will need to complete jobs in one-hour or two-hour windows. You’ll get a higher base pay, and can keep any tips, but you must meet the deadlines.",
                "spans": []
              }
            },
            {
              "type": "heading3",
              "content": {
                "text": "Amazon Logistics",
                "spans": []
              }
            },
            {
              "type": "image",
              "content": {
                "text": "",
                "spans": []
              },
              "data": {
                "origin": {
                  "url": "https://wordpress.getcircuit.com/wp-content/uploads/2021/11/14484d3b-b6f0-49f3-9d80-2809ee521aca-1024x593.png"
                },
                "alt": "These 11 Brave Flex App Reviews Say It Isn't Easy to Use. Can Amazon Flex be trusted"
              }
            },
            {
              "type": "paragraph",
              "content": {
                "text": "If you choose Amazon Logistics, you will get either a three-hour or six-hour block to deliver packages and typically work between 8 a.m. and 9 p.m. You get the packages and a route from a local Amazon warehouse, and when you’re done, you can pick up another block of deliveries if you choose. Each block could be up to 70 packages.",
                "spans": []
              }
            },
            {
              "type": "paragraph",
              "content": {
                "text": "As for your income, the company’s website states earnings range between 8 and 5 an hour, with variations for different locations, any tips received, and how long it takes to complete deliveries. For instance, you look on the app and choose a three-hour block that pays 0, which is the amount that Amazon contributes. You also get all the tips, since Amazon Prime Now gives customers the option to add a tip.",
                "spans": []
              }
            },
            {
              "type": "paragraph",
              "content": {
                "text": "But that doesn’t mean it’s all fun and games.",
                "spans": []
              }
            },
            {
              "type": "heading3",
              "content": {
                "text": "Amazon Flex app issues",
                "spans": []
              }
            },
            {
              "type": "image",
              "content": {
                "text": "",
                "spans": []
              },
              "data": {
                "origin": {
                  "url": "https://wordpress.getcircuit.com/wp-content/uploads/2021/11/148d072c-adf2-41ad-a501-93e37de4d960-1024x593.jpg"
                },
                "alt": "These 11 Brave Flex App Reviews Say It Isn't Easy to Use. Amazon Flex app issues"
              }
            },
            {
              "type": "paragraph",
              "content": {
                "text": "Drivers do report issues with the app, or with the work in general. Some reviews state that they had trouble getting the account set up. Others complain that their delivery blocks weren’t actually for their area, resulting in long drives just to get to the delivery location. ",
                "spans": []
              }
            },
            {
              "type": "paragraph",
              "content": {
                "text": "There’s also a complex rating system that can impact your standing as a driver. To maintain a good rating, you need to deliver on time, and cancel any blocks on time. You must meet delivery quality standards, which means the customer actually gets the package. ",
                "spans": [
                  {
                    "type": "hyperlink",
                    "data": {
                      "url": "https://www.ridesharingdriver.com/amazon-flex-standing-reliability-deactivations/"
                    },
                    "start": 15,
                    "end": 36
                  }
                ]
              }
            },
            {
              "type": "paragraph",
              "content": {
                "text": "Some of the reasons that impact your driver standing include a package not delivered because there’s no safe location to drop it. But even a glitch in the app, like the inability to scan a package, can impact your rating. It doesn’t seem fair but it happens.",
                "spans": []
              }
            },
            {
              "type": "heading3",
              "content": {
                "text": "Amazon Flex: Pros",
                "spans": []
              }
            },
            {
              "type": "paragraph",
              "content": {
                "text": "The benefits of Amazon Flex include the flexibility to work when you want, by reserving blocks ahead of time. You also get to work alone and don’t have to worry about transporting passengers. The app shows you how much you will earn, so you can determine how much money you can make in a week, for instance.",
                "spans": []
              }
            },
            {
              "type": "heading3",
              "content": {
                "text": "Amazon Flex: Cons",
                "spans": []
              }
            },
            {
              "type": "paragraph",
              "content": {
                "text": "The downsides are limited availability, depending on where you live, which can also impact workload. You might do well over the holiday season and then sit at home with no work. You have to cover your own fuel, insurance and maintenance costs as well as parking and tolls. You can be penalized if you don’t cancel a block in time. Finally, you have to check whether your vehicle is qualified for the work, as smaller cars or open-bed pickups are sometimes not valid.",
                "spans": []
              }
            },
            {
              "type": "paragraph",
              "content": {
                "text": "Let’s get a better sense of its reliability with some real Amazon Flex app reviews as we dig into some actual experiences of Amazon Flex drivers.  ",
                "spans": []
              }
            },
            {
              "type": "heading2",
              "content": {
                "text": "Amazon Flex App Reviews",
                "spans": []
              }
            },
            {
              "type": "paragraph",
              "content": {
                "text": "Besides the common issues that can arise when you deliver packages with your own car –  like rising fuel costs – there appear to be issues with the Amazon Flex app itself.",
                "spans": [
                  {
                    "type": "hyperlink",
                    "data": {
                      "url": "/route-planner/blog/deliver-packages-with-your-car"
                    },
                    "start": 50,
                    "end": 84
                  }
                ]
              }
            },
            {
              "type": "image",
              "content": {
                "text": "",
                "spans": []
              },
              "data": {
                "origin": {
                  "url": "https://wordpress.getcircuit.com/wp-content/uploads/2021/11/581c5384-c49e-4e16-a564-48061ec109ef-1024x593.png"
                },
                "alt": "These 11 Brave Flex App Reviews Say It Isn't Easy to Use. Amazon Flex reviews"
              }
            },
            {
              "type": "paragraph",
              "content": {
                "text": "Here are some specific examples, as these 11 brave Flex app reviews that say it isn’t easy to use.",
                "spans": []
              }
            },
            {
              "type": "heading3",
              "content": {
                "text": "1. The GPS is inefficient or wrong",
                "spans": [
                  {
                    "type": "hyperlink",
                    "data": {
                      "url": "https://www.reddit.com/r/AmazonFlexDrivers/comments/i6udxx/this_amazon_gps_system_is_awful/"
                    },
                    "start": 14,
                    "end": 34
                  }
                ]
              }
            },
            {
              "type": "paragraph",
              "content": {
                "text": "This is a big issue for any delivery driver. If you’re being rated for on-time delivery then it’s imperative to know where you’re going. There’s an entire string on Reddit of drivers having issues: ",
                "spans": []
              }
            },
            {
              "type": "preformatted",
              "content": {
                "text": "This Amazon GPS system is awful. Been driving for a couple of weeks now and this mapping system is just awful. The amount of time I have to turn around and get my heading corrected is ridiculous.",
                "spans": []
              }
            },
            {
              "type": "preformatted",
              "content": {
                "text": "Anybody using Amazon’s app GPS after doing this for a month is just torturing themselves when they don’t have to. So many other, better, solutions to this problem.",
                "spans": []
              }
            },
            {
              "type": "preformatted",
              "content": {
                "text": "I’ve had to call in multiple times for the address being in the wrong location (one was off by 74 miles!) Called support each time, and without fail, they tell me to use a separate GPS program such as Google Maps.",
                "spans": []
              }
            },
            {
              "type": "heading3",
              "content": {
                "text": "2. The app gives drivers work in the wrong location",
                "spans": [
                  {
                    "type": "hyperlink",
                    "data": {
                      "url": "https://uk.trustpilot.com/reviews/617d957d234f1b1fe569851a"
                    },
                    "start": 25,
                    "end": 51
                  }
                ]
              }
            },
            {
              "type": "paragraph",
              "content": {
                "text": "One driver who finally got the app working was allocated jobs over 100 miles away.",
                "spans": []
              }
            },
            {
              "type": "preformatted",
              "content": {
                "text": "Why do they waste our time, allowing us to sign up, do a background check, submit all the documents then give us locations over 100 miles away.",
                "spans": []
              }
            },
            {
              "type": "heading3",
              "content": {
                "text": "3. It’s difficult to tell where deliveries will be",
                "spans": [
                  {
                    "type": "hyperlink",
                    "data": {
                      "url": "https://uk.trustpilot.com/reviews/61318075cc0087e8ef6cbacf"
                    },
                    "start": 26,
                    "end": 50
                  }
                ]
              }
            },
            {
              "type": "paragraph",
              "content": {
                "text": "One driver reports that:",
                "spans": []
              }
            },
            {
              "type": "preformatted",
              "content": {
                "text": "They should show you the itinerary beforehand. That way, you can decide if you want to run that block. 80% of the time you get sketchy unsafe areas, get taken to the middle of nowhere.",
                "spans": []
              }
            },
            {
              "type": "heading3",
              "content": {
                "text": "4. It’s not easy to make changes",
                "spans": [
                  {
                    "type": "hyperlink",
                    "data": {
                      "url": "https://uk.trustpilot.com/reviews/611263ebf9f48708b48b5dc3"
                    },
                    "start": 8,
                    "end": 32
                  }
                ]
              }
            },
            {
              "type": "paragraph",
              "content": {
                "text": "Many reviews state that support for drivers is poor. For instance, drivers who contact customer service to get their region updated are frustrated by the lack of response.",
                "spans": []
              }
            },
            {
              "type": "preformatted",
              "content": {
                "text": "Been asking them to remove my Region from app so I can keep looking for any vacancies available near my new home. But they just can’t seem to understand or know how to do it. ",
                "spans": []
              }
            },
            {
              "type": "heading3",
              "content": {
                "text": "5. Extra packages can’t be scanned",
                "spans": [
                  {
                    "type": "hyperlink",
                    "data": {
                      "url": "https://www.reddit.com/r/AmazonFlexDrivers/comments/qwibgs/only_delivered_9_out_of_like_42_packages_today/"
                    },
                    "start": 18,
                    "end": 34
                  }
                ]
              }
            },
            {
              "type": "paragraph",
              "content": {
                "text": "One driver had extra packages added at the warehouse but the app couldn’t add them, and the app couldn’t help find the new addresses:",
                "spans": []
              }
            },
            {
              "type": "preformatted",
              "content": {
                "text": "The extra packages could not be scanned on the app. They were already marked as delivered, so the warehouse workers said to put the addresses manually on Google Maps. So it turns out the added packages … are all very rural and spaced out far apart. Some addresses were hard to find. Since I also was not using the Flex app, I had to figure out my own route so that must have wasted a lot of time as well.",
                "spans": []
              }
            },
            {
              "type": "heading3",
              "content": {
                "text": "6. Glitches in the app can impact a driver’s rating",
                "spans": [
                  {
                    "type": "hyperlink",
                    "data": {
                      "url": "https://www.reddit.com/r/AmazonFlexDrivers/comments/qwormi/late_check_in/"
                    },
                    "start": 27,
                    "end": 51
                  }
                ]
              }
            },
            {
              "type": "paragraph",
              "content": {
                "text": "One driver review said the app marked a late arrival every day.",
                "spans": []
              }
            },
            {
              "type": "preformatted",
              "content": {
                "text": "My Flex app is showing me as checking in late for every shift. For instance this morning, shift started at 5:30. I checked in exactly at 5:15, and scanned every single one of my block packages by 5:26. I’m still flagged as late. ",
                "spans": [
                  {
                    "type": "strong",
                    "start": 228,
                    "end": 229
                  }
                ]
              }
            },
            {
              "type": "heading3",
              "content": {
                "text": "7. Navigation is a challenge",
                "spans": [
                  {
                    "type": "hyperlink",
                    "data": {
                      "url": "https://www.reddit.com/r/AmazonFlexDrivers/comments/dcxlko/flex_app_now_allows_3rd_party_navigation/"
                    },
                    "start": 3,
                    "end": 28
                  }
                ]
              }
            },
            {
              "type": "paragraph",
              "content": {
                "text": "Giving rise to the need for third-party navigation:",
                "spans": []
              }
            },
            {
              "type": "preformatted",
              "content": {
                "text": "Amazon maps is horrendous and doesn’t reroute correctly for me if you get off the path.",
                "spans": []
              }
            },
            {
              "type": "heading3",
              "content": {
                "text": "8. Other glitches in the app cause issues for drivers",
                "spans": [
                  {
                    "type": "hyperlink",
                    "data": {
                      "url": "https://www.reddit.com/r/AmazonFlexDrivers/comments/j7mliw/flex_gps/"
                    },
                    "start": 9,
                    "end": 28
                  }
                ]
              }
            },
            {
              "type": "preformatted",
              "content": {
                "text": "The flex app keeps freezing every after stop;” ​​”GPS getting stuck at a location and then continually bouncing back to that location numerous times;” “have a problem with the sound going out. Then I have to constantly look at the screen to see where to go.",
                "spans": []
              }
            },
            {
              "type": "heading3",
              "content": {
                "text": "9. Doesn’t provide real-time solutions to issues like traffic snarls",
                "spans": [
                  {
                    "type": "hyperlink",
                    "data": {
                      "url": "https://www.reddit.com/r/AmazonFlexDrivers/comments/j7mliw/flex_gps/"
                    },
                    "start": 19,
                    "end": 38
                  }
                ]
              }
            },
            {
              "type": "preformatted",
              "content": {
                "text": "The Flex app doesn’t factor in road closures;”  “the turn by turn navigation sucks. It doesn’t seem to factor in traffic and takes very bad routes a lot of the time.",
                "spans": []
              }
            },
            {
              "type": "heading3",
              "content": {
                "text": "10. More in-app bugs",
                "spans": [
                  {
                    "type": "hyperlink",
                    "data": {
                      "url": "https://uk.trustpilot.com/reviews/60a9daebf9f4870a94aa6b5a"
                    },
                    "start": 9,
                    "end": 20
                  }
                ]
              }
            },
            {
              "type": "preformatted",
              "content": {
                "text": "Their driver app is extremely buggy. I would arrive for my route on time and check-in but have to wait because the delivery station near where I live is slow as hell, it took them too long to get me a route and the Flex app stated that I was late and could not do my route. This has happened to me twice now, again hurting my driver standing, for which was not my fault. ",
                "spans": []
              }
            },
            {
              "type": "heading3",
              "content": {
                "text": "11. Once again, sending drivers to the wrong location",
                "spans": [
                  {
                    "type": "hyperlink",
                    "data": {
                      "url": "https://uk.trustpilot.com/reviews/60a9daebf9f4870a94aa6b5a"
                    },
                    "start": 16,
                    "end": 53
                  }
                ]
              }
            },
            {
              "type": "preformatted",
              "content": {
                "text": "When the packages need to be delivered to a locker in a mailroom, for example at an apartment complex, the app will send you to the customer’s actual apartment building and not the mailroom building. This does not allow you to complete the deliveries. When this happens, you have to call support for them to override it for you so you can complete the delivery, and you have to do this for each package. This is very inefficient. ",
                "spans": []
              }
            },
            {
              "type": "paragraph",
              "content": {
                "text": "So what can Amazon Flex drivers do about issues with the app? The biggest problems seem to be navigating and getting the deliveries done on time. The solution: quality route planning.",
                "spans": []
              }
            },
            {
              "type": "heading2",
              "content": {
                "text": "The Best Delivery Route Planner Apps",
                "spans": []
              }
            },
            {
              "type": "paragraph",
              "content": {
                "text": "Despite the fact Amazon claims the Flex app can be used as guidance to navigate to each destination, there are obviously problems with using it, as drivers are reporting in online reviews. The good news is that drivers also report you can use other options.",
                "spans": []
              }
            },
            {
              "type": "image",
              "content": {
                "text": "",
                "spans": []
              },
              "data": {
                "origin": {
                  "url": "https://wordpress.getcircuit.com/wp-content/uploads/2021/09/eb4126e0-1956-41a1-9e15-0fa120cec187-1024x593.jpg"
                },
                "alt": "These 11 Brave Flex App Reviews Say It Isn't Easy to Use: Route planners"
              }
            },
            {
              "type": "paragraph",
              "content": {
                "text": "One driver states that you have the option of “using third party maps while on delivery by tapping on the square with the arrow instead of start travel” when in the app.",
                "spans": [
                  {
                    "type": "hyperlink",
                    "data": {
                      "url": "https://www.reddit.com/r/AmazonFlexDrivers/comments/i6udxx/this_amazon_gps_system_is_awful/"
                    },
                    "start": 4,
                    "end": 22
                  },
                  {
                    "type": "em",
                    "start": 46,
                    "end": 152
                  }
                ]
              }
            },
            {
              "type": "paragraph",
              "content": {
                "text": "Other online tips advise not to use the Amazon Flex app for navigating.",
                "spans": [
                  {
                    "type": "hyperlink",
                    "data": {
                      "url": "https://www.moneypixels.com/rideshare/amazon-flex-tricks/"
                    },
                    "start": 0,
                    "end": 17
                  }
                ]
              }
            },
            {
              "type": "paragraph",
              "content": {
                "text": "Instead, drivers are encouraged to use another app to check live traffic conditions, for instance, since Flex doesn’t take into account issues like road closures or heavy traffic. It’s even suggested that a second phone could help, so you could keep Flex running but use a better route planning platform to find your way. Having a smartphone and a good route planning app is key to being successful as an Amazon Flex driver.",
                "spans": [
                  {
                    "type": "hyperlink",
                    "data": {
                      "url": "/route-planner/blog/amazon-courier-delivery-top-driver-hacks"
                    },
                    "start": 375,
                    "end": 398
                  }
                ]
              }
            },
            {
              "type": "paragraph",
              "content": {
                "text": "Which raises the question, what is the best delivery route planner app for drivers? You can launch Google navigation from the Flex app, but Google Maps becomes cumbersome when you have many addresses to enter. ",
                "spans": [
                  {
                    "type": "hyperlink",
                    "data": {
                      "url": "/route-planner/blog/plan-a-route-with-multiple-stops-on-google-maps"
                    },
                    "start": 140,
                    "end": 151
                  }
                ]
              }
            },
            {
              "type": "paragraph",
              "content": {
                "text": "Or, you can choose among the best delivery route planner apps and know that you’ll get where you need to go.",
                "spans": [
                  {
                    "type": "hyperlink",
                    "data": {
                      "url": "/route-planner/blog/delivery-route-planner-apps"
                    },
                    "start": 29,
                    "end": 61
                  }
                ]
              }
            },
            {
              "type": "heading3",
              "content": {
                "text": "#No 1 app: Circuit Route Planner",
                "spans": []
              }
            },
            {
              "type": "paragraph",
              "content": {
                "text": "Circuit Route Planner is a top choice for many drivers, with its ease of use and the added bonus of a Fast Package Finder that helps you locate packages in your vehicle. Circuit Route Planner will prevent unnecessary stops as you try to figure out where you are. It will help to avoid traffic congestion as the intelligent software finds faster, more efficient delivery routes. That in turn will ensure you complete your Amazon Flex delivery blocks on time or even early.",
                "spans": [
                  {
                    "type": "hyperlink",
                    "data": {
                      "url": "/route-planner"
                    },
                    "start": 0,
                    "end": 21
                  },
                  {
                    "type": "hyperlink",
                    "data": {
                      "url": "/route-planner/blog/place-in-vehicle-feature"
                    },
                    "start": 102,
                    "end": 121
                  }
                ]
              }
            },
            {
              "type": "image",
              "content": {
                "text": "",
                "spans": []
              },
              "data": {
                "origin": {
                  "url": "https://wordpress.getcircuit.com/wp-content/uploads/2021/09/71624c81-f407-464f-92ba-8a296201da00-1024x593.jpg"
                },
                "alt": "These 11 Brave Flex App Reviews Say It Isn't Easy to Use: Circuit Route Planner"
              }
            },
            {
              "type": "paragraph",
              "content": {
                "text": "There are some drivers that have experience using the Circuit Route Planner and Amazon Flex. ",
                "spans": []
              }
            },
            {
              "type": "paragraph",
              "content": {
                "text": "For instance, here is an Amazon Flex review that gives information on using Circuit Route Planner with Flex:",
                "spans": [
                  {
                    "type": "hyperlink",
                    "data": {
                      "url": "https://amazonflexukforum.wordpress.com/2017/05/21/using-a-route-planner-app-for-amazon-flex-deliveries/"
                    },
                    "start": 14,
                    "end": 43
                  }
                ]
              }
            },
            {
              "type": "preformatted",
              "content": {
                "text": "The app itself (Circuit) was very easy to use. Simply download and you are ready to enter your address list. You can import them but for Flex deliveries we have to enter them manually which is easy and quick to do anyway, just go down your itinerary list when you have collected from the pick up station and search for the addresses. There is an automatic list of options to choose from which is very quick to use.",
                "spans": []
              }
            },
            {
              "type": "paragraph",
              "content": {
                "text": "Here’s another review by a driver who finds it better to use Circuit Route Planner:",
                "spans": [
                  {
                    "type": "hyperlink",
                    "data": {
                      "url": "https://www.reddit.com/r/AmazonFlexDrivers/comments/a20l50/for_those_of_you_using_google_maps_for_every_stop/"
                    },
                    "start": 7,
                    "end": 21
                  }
                ]
              }
            },
            {
              "type": "preformatted",
              "content": {
                "text": "I use the Circuit app to prioritize my routes. Although sometimes the Flex app does a decent job and I don’t need to…Once I’ve scanned all my packages I always look at the map summary in the Flex app and see where everything is. If it looks crazy I use the Circuit app, if not I just manage w/o.",
                "spans": []
              }
            },
            {
              "type": "paragraph",
              "content": {
                "text": "This driver goes on to say it’s worth the time upfront to copy and paste all the addresses before starting out, and then provides this Pro Tip: ",
                "spans": []
              }
            },
            {
              "type": "preformatted",
              "content": {
                "text": "I just switch to the Circuit app and see what the next address is and then switch back to the Flex app and select that address from the list. This avoids GPS “arrival” issues on the Flex app. I know this seems confusing but basically if you’re using any other app to navigate sometimes when you switch back to the Flex app to deliver the package it doesn’t register you as being at the address, so you don’t get the prompt that you’ve arrived.",
                "spans": []
              }
            },
            {
              "type": "paragraph",
              "content": {
                "text": "So it appears that the Amazon Flex app needs some help, in particular when it comes to navigation and route optimization.",
                "spans": []
              }
            },
            {
              "type": "heading2",
              "content": {
                "text": "Flex App Reviews: DrivingItHome",
                "spans": [
                  {
                    "type": "strong",
                    "start": 0,
                    "end": 25
                  },
                  {
                    "type": "strong",
                    "start": 25,
                    "end": 27
                  },
                  {
                    "type": "strong",
                    "start": 27,
                    "end": 31
                  }
                ]
              }
            },
            {
              "type": "paragraph",
              "content": {
                "text": "Picking up work as an Amazon Flex driver is a great way to make extra money, or to start or expand your job as a delivery driver. While the process to apply seems straightforward, there does seem to be some glitches in the Amazon Flex app itself.",
                "spans": []
              }
            },
            {
              "type": "paragraph",
              "content": {
                "text": "A route optimization app will address the biggest issues for any courier or driver by:",
                "spans": []
              }
            },
            {
              "type": "list-item",
              "content": {
                "text": "giving you the best way to navigate",
                "spans": []
              }
            },
            {
              "type": "list-item",
              "content": {
                "text": "updating your route to account for traffic and construction",
                "spans": []
              }
            },
            {
              "type": "list-item",
              "content": {
                "text": "making sure you get your Amazon Flex delivery blocks done on time",
                "spans": []
              }
            },
            {
              "type": "paragraph",
              "content": {
                "text": "Circuit Route Planner can do all that for you, at a low monthly price. Get your free trial now.",
                "spans": [
                  {
                    "type": "hyperlink",
                    "data": {
                      "url": "https://getcircuit.com/route-planner"
                    },
                    "start": 71,
                    "end": 95
                  },
                  {
                    "type": "em",
                    "start": 0,
                    "end": 95
                  }
                ]
              }
            }
          ]
        }
      }
    }
  ],
  "no_index": false,
  "meta": [
    {
      "title1": "These 11 Brave Flex App Reviews Say It Isn’t Easy to Use (Here’s Why and What to Do)",
      "description1": "Before you start as an Amazon driver, let’s take a look at the Flex app reviews and whether you can trust it\n"
    }
  ],
  "social": [
    {
      "image": {
        "origin": {
          "id": "",
          "url": "https://wordpress.getcircuit.com/wp-content/uploads/2021/11/59a02948-2610-4d28-b7a9-4159465ca3ad.png",
          "width": 2224,
          "height": 1288
        }
      },
      "title1": "These 11 Brave Flex App Reviews Say It Isn’t Easy to Use (Here’s Why and What to Do)",
      "description1": "Before you start as an Amazon driver, let’s take a look at the Flex app reviews and whether you can trust it\n"
    }
  ],
  "primary_category": {
    "id": "Yg7TlxEAACQAeTDA",
    "wioUrl": "wio://documents/Yg7TlxEAACQAeTDA"
  },
  "type": "article",
  "tags": [],
  "lang": "en-us",
  "grouplang": "Yg6MwBEAACMAd_Ea"
}